; ModuleID = 'assoc.c'
source_filename = "assoc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._stritem = type { %struct._stritem*, %struct._stritem*, %struct._stritem*, i32, i32, i32, i16, i16, i8, i8, [0 x %union.anon] }
%union.anon = type { i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.stats_state = type { i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon.0, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon.0 = type { i64 }
%union.anon.1 = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hashpower", scope: !2, file: !3, line: 32, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !63, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "assoc.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d738ec506cadd7570480190bbdf647e7")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pause_thread_types", file: !6, line: 246, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "PAUSE_WORKER_THREADS", value: 0)
!10 = !DIEnumerator(name: "PAUSE_ALL_THREADS", value: 1)
!11 = !DIEnumerator(name: "RESUME_ALL_THREADS", value: 2)
!12 = !DIEnumerator(name: "RESUME_WORKER_THREADS", value: 3)
!13 = !{!14, !19, !21, !22, !40, !62}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 27, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 45, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "assoc_iterator", file: !3, line: 292, size: 256, elements: !24)
!24 = !{!25, !26, !59, !60}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !23, file: !3, line: 293, baseType: !14, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !23, file: !3, line: 294, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !6, line: 598, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !6, line: 575, size: 384, elements: !30)
!30 = !{!31, !33, !34, !35, !38, !39, !41, !43, !46, !50, !51}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !6, line: 577, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !29, file: !6, line: 578, baseType: !32, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !29, file: !6, line: 580, baseType: !32, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !29, file: !6, line: 581, baseType: !36, size: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !37, line: 14, baseType: !7)
!37 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !29, file: !6, line: 582, baseType: !36, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !29, file: !6, line: 583, baseType: !40, size: 32, offset: 256)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !29, file: !6, line: 584, baseType: !42, size: 16, offset: 288)
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !29, file: !6, line: 585, baseType: !44, size: 16, offset: 304)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 25, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !17, line: 40, baseType: !42)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !29, file: !6, line: 586, baseType: !47, size: 8, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 38, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !29, file: !6, line: 587, baseType: !47, size: 8, offset: 328)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !6, line: 593, baseType: !52, offset: 384)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, elements: !57)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !6, line: 590, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !53, file: !6, line: 591, baseType: !14, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !53, file: !6, line: 592, baseType: !20, size: 8)
!57 = !{!58}
!58 = !DISubrange(count: -1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !3, line: 295, baseType: !27, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_locked", scope: !23, file: !3, line: 296, baseType: !61, size: 8, offset: 192)
!61 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!63 = !{!0, !64, !66, !70, !73, !75, !77, !79, !110, !151}
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "hash_bulk_move", scope: !2, file: !3, line: 191, type: !40, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "maintenance_tid", scope: !2, file: !3, line: 262, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !69, line: 27, baseType: !18)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "primary_hashtable", scope: !2, file: !3, line: 38, type: !72, isLocal: true, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "expanding", scope: !2, file: !3, line: 47, type: !61, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "expand_bucket", scope: !2, file: !3, line: 53, type: !14, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "old_hashtable", scope: !2, file: !3, line: 44, type: !72, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "maintenance_lock", scope: !2, file: !3, line: 29, type: !81, isLocal: true, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !69, line: 72, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !69, line: 67, size: 320, elements: !83)
!83 = !{!84, !104, !108}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !82, file: !69, line: 69, baseType: !85, size: 320)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !86, line: 22, size: 320, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!87 = !{!88, !89, !90, !91, !92, !93, !95, !96}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !85, file: !86, line: 24, baseType: !40, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !85, file: !86, line: 25, baseType: !7, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !85, file: !86, line: 26, baseType: !40, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !85, file: !86, line: 28, baseType: !7, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !85, file: !86, line: 32, baseType: !40, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !85, file: !86, line: 34, baseType: !94, size: 16, offset: 160)
!94 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !85, file: !86, line: 35, baseType: !94, size: 16, offset: 176)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !85, file: !86, line: 36, baseType: !97, size: 128, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !98, line: 53, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !98, line: 49, size: 128, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !99, file: !98, line: 51, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !99, file: !98, line: 52, baseType: !102, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !82, file: !69, line: 70, baseType: !105, size: 320)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 320, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 40)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !82, file: !69, line: 71, baseType: !109, size: 64)
!109 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "maintenance_cond", scope: !2, file: !3, line: 28, type: !112, isLocal: true, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !69, line: 80, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !69, line: 75, size: 384, elements: !114)
!114 = !{!115, !145, !149}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !113, file: !69, line: 77, baseType: !116, size: 384)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !98, line: 92, size: 384, elements: !117)
!117 = !{!118, !128, !137, !141, !142, !143, !144}
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !98, line: 94, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !98, line: 94, size: 64, elements: !120)
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !119, file: !98, line: 96, baseType: !122, size: 64)
!122 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !119, file: !98, line: 101, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !98, line: 97, size: 64, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !124, file: !98, line: 99, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !124, file: !98, line: 100, baseType: !7, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !98, line: 103, baseType: !129, size: 64, offset: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !98, line: 103, size: 64, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !129, file: !98, line: 105, baseType: !122, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !129, file: !98, line: 110, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !129, file: !98, line: 106, size: 64, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !133, file: !98, line: 108, baseType: !7, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !133, file: !98, line: 109, baseType: !7, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !116, file: !98, line: 112, baseType: !138, size: 64, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 2)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !116, file: !98, line: 113, baseType: !138, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !116, file: !98, line: 114, baseType: !7, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !116, file: !98, line: 115, baseType: !7, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !116, file: !98, line: 116, baseType: !138, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !113, file: !69, line: 78, baseType: !146, size: 384)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 384, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 48)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !113, file: !69, line: 79, baseType: !150, size: 64)
!150 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "do_run_maintenance_thread", scope: !2, file: !3, line: 188, type: !153, isLocal: true, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!154 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!155 = !{i32 7, !"Dwarf Version", i32 5}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{i32 7, !"uwtable", i32 1}
!159 = !{!"/home/xuheng/blackbox/llvm-test/memcached/assoc.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/assoc.gcda", !2}
!160 = !{!"clang version 14.0.0"}
!161 = distinct !DISubprogram(name: "assoc_init", scope: !3, file: !3, line: 55, type: !162, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164}
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!165 = !{!166}
!166 = !DILocalVariable(name: "hashtable_init", arg: 1, scope: !161, file: !3, line: 55, type: !164)
!167 = !DILocation(line: 0, scope: !161)
!168 = !DILocation(line: 56, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !161, file: !3, line: 56, column: 9)
!170 = !DILocation(line: 56, column: 9, scope: !161)
!171 = !DILocation(line: 59, column: 32, scope: !161)
!172 = !{!173, !173, i64 0}
!173 = !{!"int", !174, i64 0}
!174 = !{!"omnipotent char", !175, i64 0}
!175 = !{!"Simple C/C++ TBAA"}
!176 = !DILocation(line: 57, column: 21, scope: !177)
!177 = distinct !DILexicalBlock(scope: !169, file: !3, line: 56, column: 25)
!178 = !DILocation(line: 57, column: 19, scope: !177)
!179 = !DILocation(line: 58, column: 5, scope: !177)
!180 = !DILocation(line: 59, column: 25, scope: !161)
!181 = !DILocation(line: 59, column: 23, scope: !161)
!182 = !{!183, !183, i64 0}
!183 = !{!"any pointer", !174, i64 0}
!184 = !DILocation(line: 60, column: 11, scope: !185)
!185 = distinct !DILexicalBlock(scope: !161, file: !3, line: 60, column: 9)
!186 = !DILocation(line: 60, column: 9, scope: !161)
!187 = !DILocation(line: 61, column: 17, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !3, line: 60, column: 30)
!189 = !DILocation(line: 61, column: 9, scope: !188)
!190 = !DILocation(line: 62, column: 9, scope: !188)
!191 = !DILocation(line: 64, column: 5, scope: !161)
!192 = !DILocation(line: 65, column: 36, scope: !161)
!193 = !DILocation(line: 65, column: 34, scope: !161)
!194 = !{!195, !173, i64 40}
!195 = !{!"stats_state", !196, i64 0, !196, i64 8, !196, i64 16, !196, i64 24, !173, i64 32, !173, i64 36, !173, i64 40, !173, i64 44, !197, i64 48, !197, i64 49, !197, i64 50, !197, i64 51}
!196 = !{!"long", !174, i64 0}
!197 = !{!"_Bool", !174, i64 0}
!198 = !DILocation(line: 66, column: 30, scope: !161)
!199 = !DILocation(line: 66, column: 50, scope: !161)
!200 = !DILocation(line: 66, column: 28, scope: !161)
!201 = !{!195, !196, i64 24}
!202 = !DILocation(line: 67, column: 5, scope: !161)
!203 = !DILocation(line: 68, column: 1, scope: !161)
!204 = !DISubprogram(name: "calloc", scope: !205, file: !205, line: 542, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!205 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!206 = !DISubroutineType(types: !207)
!207 = !{!21, !208, !208}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 46, baseType: !18)
!209 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!210 = !{}
!211 = !DISubprogram(name: "fprintf", scope: !212, file: !212, line: 326, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!212 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!213 = !DISubroutineType(types: !214)
!214 = !{!40, !215, !269, null}
!215 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !218, line: 7, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !220, line: 49, size: 1728, elements: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237, !239, !240, !241, !243, !244, !246, !250, !253, !255, !258, !261, !262, !263, !264, !265}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !219, file: !220, line: 51, baseType: !40, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !219, file: !220, line: 54, baseType: !19, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !219, file: !220, line: 55, baseType: !19, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !219, file: !220, line: 56, baseType: !19, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !219, file: !220, line: 57, baseType: !19, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !219, file: !220, line: 58, baseType: !19, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !219, file: !220, line: 59, baseType: !19, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !219, file: !220, line: 60, baseType: !19, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !219, file: !220, line: 61, baseType: !19, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !219, file: !220, line: 64, baseType: !19, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !219, file: !220, line: 65, baseType: !19, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !219, file: !220, line: 66, baseType: !19, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !219, file: !220, line: 68, baseType: !235, size: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !220, line: 36, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !219, file: !220, line: 70, baseType: !238, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !219, file: !220, line: 72, baseType: !40, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !219, file: !220, line: 73, baseType: !40, size: 32, offset: 928)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !219, file: !220, line: 74, baseType: !242, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !17, line: 152, baseType: !109)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !219, file: !220, line: 77, baseType: !42, size: 16, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !219, file: !220, line: 78, baseType: !245, size: 8, offset: 1040)
!245 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !219, file: !220, line: 79, baseType: !247, size: 8, offset: 1048)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !219, file: !220, line: 81, baseType: !251, size: 64, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !220, line: 43, baseType: null)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !219, file: !220, line: 89, baseType: !254, size: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !17, line: 153, baseType: !109)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !219, file: !220, line: 91, baseType: !256, size: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !220, line: 37, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !219, file: !220, line: 92, baseType: !259, size: 64, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !220, line: 38, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !219, file: !220, line: 93, baseType: !238, size: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !219, file: !220, line: 94, baseType: !21, size: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !219, file: !220, line: 95, baseType: !208, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !219, file: !220, line: 96, baseType: !40, size: 32, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !219, file: !220, line: 98, baseType: !266, size: 160, offset: 1568)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 20)
!269 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!272 = !DISubprogram(name: "exit", scope: !205, file: !205, line: 617, type: !273, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !210)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !40}
!275 = !DISubprogram(name: "STATS_LOCK", scope: !6, file: !6, line: 991, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DISubprogram(name: "STATS_UNLOCK", scope: !6, file: !6, line: 992, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !210)
!279 = distinct !DISubprogram(name: "assoc_find", scope: !3, file: !3, line: 70, type: !280, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!280 = !DISubroutineType(types: !281)
!281 = !{!27, !270, !282, !283}
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 26, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 42, baseType: !7)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DILocalVariable(name: "key", arg: 1, scope: !279, file: !3, line: 70, type: !270)
!288 = !DILocalVariable(name: "nkey", arg: 2, scope: !279, file: !3, line: 70, type: !282)
!289 = !DILocalVariable(name: "hv", arg: 3, scope: !279, file: !3, line: 70, type: !283)
!290 = !DILocalVariable(name: "it", scope: !279, file: !3, line: 71, type: !27)
!291 = !DILocalVariable(name: "oldbucket", scope: !279, file: !3, line: 72, type: !14)
!292 = !DILocalVariable(name: "ret", scope: !279, file: !3, line: 82, type: !27)
!293 = !DILocalVariable(name: "depth", scope: !279, file: !3, line: 83, type: !40)
!294 = !DILocation(line: 0, scope: !279)
!295 = !DILocation(line: 74, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !279, file: !3, line: 74, column: 9)
!297 = !DILocation(line: 74, column: 19, scope: !296)
!298 = !DILocation(line: 79, column: 37, scope: !299)
!299 = distinct !DILexicalBlock(scope: !296, file: !3, line: 78, column: 12)
!300 = !DILocation(line: 79, column: 32, scope: !299)
!301 = !DILocation(line: 75, column: 23, scope: !296)
!302 = !DILocation(line: 75, column: 28, scope: !296)
!303 = !DILocation(line: 75, column: 26, scope: !296)
!304 = !DILocation(line: 75, column: 57, scope: !296)
!305 = !{!196, !196, i64 0}
!306 = !DILocation(line: 75, column: 54, scope: !296)
!307 = !DILocation(line: 74, column: 9, scope: !279)
!308 = !DILocation(line: 77, column: 14, scope: !309)
!309 = distinct !DILexicalBlock(scope: !296, file: !3, line: 76, column: 5)
!310 = !DILocation(line: 78, column: 5, scope: !309)
!311 = !DILocation(line: 79, column: 14, scope: !299)
!312 = !DILocation(line: 79, column: 35, scope: !299)
!313 = !DILocation(line: 84, column: 5, scope: !279)
!314 = !DILocation(line: 85, column: 26, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 85, column: 13)
!316 = distinct !DILexicalBlock(scope: !279, file: !3, line: 84, column: 16)
!317 = !{!174, !174, i64 0}
!318 = !DILocation(line: 85, column: 22, scope: !315)
!319 = !DILocation(line: 85, column: 19, scope: !315)
!320 = !DILocation(line: 85, column: 32, scope: !315)
!321 = !DILocation(line: 85, column: 43, scope: !315)
!322 = !DILocation(line: 85, column: 48, scope: !315)
!323 = !{!324, !324, i64 0}
!324 = !{!"short", !174, i64 0}
