; ModuleID = 'authfile.c'
source_filename = "authfile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.auth_entry = type { i8*, i64, i8*, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@entry_cnt = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@main_auth_data = dso_local local_unnamed_addr global i8* null, align 8, !dbg !17
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@main_auth_entries = dso_local global [8 x %struct.auth_entry] zeroinitializer, align 16, !dbg !21
@__llvm_gcov_ctr = internal global [18 x i64] zeroinitializer
@__llvm_gcov_ctr.1 = internal global [1 x i64] zeroinitializer
@__llvm_gcov_ctr.2 = internal global [8 x i64] zeroinitializer
@0 = private unnamed_addr constant [56 x i8] c"/home/xuheng/blackbox/llvm-test/memcached/authfile.gcda\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "entry_cnt", scope: !2, file: !3, line: 28, type: !36, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "authfile.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "0862e0458ee628bbb6fbc2f7d2dc38f1")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "authfile_ret", file: !6, line: 4, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./authfile.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "0dde135e0a78cac5fa53ca0c0171cf2a")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "AUTHFILE_OK", value: 0)
!10 = !DIEnumerator(name: "AUTHFILE_OOM", value: 1)
!11 = !DIEnumerator(name: "AUTHFILE_STATFAIL", value: 2)
!12 = !DIEnumerator(name: "AUTHFILE_OPENFAIL", value: 3)
!13 = !DIEnumerator(name: "AUTHFILE_MALFORMED", value: 4)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{!0, !17, !21}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "main_auth_data", scope: !2, file: !3, line: 29, type: !19, isLocal: false, isDefinition: true)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "main_auth_entries", scope: !2, file: !3, line: 27, type: !23, isLocal: false, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !34)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "auth_t", file: !3, line: 25, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "auth_entry", file: !3, line: 20, size: 256, elements: !26)
!26 = !{!27, !28, !32, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !25, file: !3, line: 21, baseType: !19, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ulen", scope: !25, file: !3, line: 22, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !25, file: !3, line: 23, baseType: !19, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !25, file: !3, line: 24, baseType: !29, size: 64, offset: 192)
!34 = !{!35}
!35 = !DISubrange(count: 8)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{i32 7, !"Dwarf Version", i32 5}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{i32 1, !"wchar_size", i32 4}
!40 = !{i32 7, !"uwtable", i32 1}
!41 = !{!"/home/xuheng/blackbox/llvm-test/memcached/authfile.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/authfile.gcda", !2}
!42 = !{!"clang version 14.0.0"}
!43 = distinct !DISubprogram(name: "authfile_load", scope: !3, file: !3, line: 31, type: !44, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!44 = !DISubroutineType(types: !45)
!45 = !{!5, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!48 = !{!49, !50, !90, !91, !92, !146, !147, !148, !150, !151, !153}
!49 = !DILocalVariable(name: "file", arg: 1, scope: !43, file: !3, line: 31, type: !46)
!50 = !DILocalVariable(name: "sb", scope: !43, file: !3, line: 32, type: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !52, line: 46, size: 1152, elements: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!53 = !{!54, !57, !59, !61, !63, !65, !67, !68, !69, !72, !74, !76, !84, !85, !86}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !51, file: !52, line: 48, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !56, line: 145, baseType: !31)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !51, file: !52, line: 53, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !56, line: 148, baseType: !31)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !51, file: !52, line: 61, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !56, line: 151, baseType: !31)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !51, file: !52, line: 62, baseType: !62, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !56, line: 150, baseType: !7)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !51, file: !52, line: 64, baseType: !64, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !56, line: 146, baseType: !7)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !51, file: !52, line: 65, baseType: !66, size: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !56, line: 147, baseType: !7)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !51, file: !52, line: 67, baseType: !36, size: 32, offset: 288)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !51, file: !52, line: 69, baseType: !55, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !51, file: !52, line: 74, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 152, baseType: !71)
!71 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !51, file: !52, line: 78, baseType: !73, size: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !56, line: 174, baseType: !71)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !51, file: !52, line: 80, baseType: !75, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !56, line: 179, baseType: !71)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !51, file: !52, line: 91, baseType: !77, size: 128, offset: 576)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !78, line: 10, size: 128, elements: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !77, file: !78, line: 12, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !56, line: 160, baseType: !71)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !77, file: !78, line: 16, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !56, line: 196, baseType: !71)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !51, file: !52, line: 92, baseType: !77, size: 128, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !51, file: !52, line: 93, baseType: !77, size: 128, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !51, file: !52, line: 106, baseType: !87, size: 192, offset: 960)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 192, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = !DILocalVariable(name: "auth_data", scope: !43, file: !3, line: 33, type: !19)
!91 = !DILocalVariable(name: "auth_entries", scope: !43, file: !3, line: 34, type: !23)
!92 = !DILocalVariable(name: "pwfile", scope: !43, file: !3, line: 36, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !95, line: 7, baseType: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !114, !116, !117, !118, !119, !121, !123, !127, !130, !132, !135, !138, !139, !140, !141, !142}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !96, file: !97, line: 51, baseType: !36, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !96, file: !97, line: 54, baseType: !19, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !96, file: !97, line: 55, baseType: !19, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !96, file: !97, line: 56, baseType: !19, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !96, file: !97, line: 57, baseType: !19, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !96, file: !97, line: 58, baseType: !19, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !96, file: !97, line: 59, baseType: !19, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !96, file: !97, line: 60, baseType: !19, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !96, file: !97, line: 61, baseType: !19, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !96, file: !97, line: 64, baseType: !19, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !96, file: !97, line: 65, baseType: !19, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !96, file: !97, line: 66, baseType: !19, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !96, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !97, line: 36, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !96, file: !97, line: 70, baseType: !115, size: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !96, file: !97, line: 72, baseType: !36, size: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !96, file: !97, line: 73, baseType: !36, size: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !96, file: !97, line: 74, baseType: !70, size: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !96, file: !97, line: 77, baseType: !120, size: 16, offset: 1024)
!120 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !96, file: !97, line: 78, baseType: !122, size: 8, offset: 1040)
!122 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !96, file: !97, line: 79, baseType: !124, size: 8, offset: 1048)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !96, file: !97, line: 81, baseType: !128, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !97, line: 43, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !96, file: !97, line: 89, baseType: !131, size: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 153, baseType: !71)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !96, file: !97, line: 91, baseType: !133, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !97, line: 37, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !96, file: !97, line: 92, baseType: !136, size: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !97, line: 38, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !96, file: !97, line: 93, baseType: !115, size: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !96, file: !97, line: 94, baseType: !15, size: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !96, file: !97, line: 95, baseType: !29, size: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !96, file: !97, line: 96, baseType: !36, size: 32, offset: 1536)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !96, file: !97, line: 98, baseType: !143, size: 160, offset: 1568)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 20)
!146 = !DILocalVariable(name: "auth_cur", scope: !43, file: !3, line: 46, type: !19)
!147 = !DILocalVariable(name: "auth_end", scope: !43, file: !3, line: 47, type: !19)
!148 = !DILocalVariable(name: "entry_cur", scope: !43, file: !3, line: 48, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!150 = !DILocalVariable(name: "used", scope: !43, file: !3, line: 49, type: !36)
!151 = !DILocalVariable(name: "x", scope: !152, file: !3, line: 52, type: !36)
!152 = distinct !DILexicalBlock(scope: !43, file: !3, line: 51, column: 122)
!153 = !DILocalVariable(name: "found", scope: !152, file: !3, line: 53, type: !36)
!154 = !DILocation(line: 0, scope: !43)
!155 = !DILocation(line: 32, column: 5, scope: !43)
!156 = !DILocation(line: 32, column: 17, scope: !43)
!157 = !DILocation(line: 34, column: 5, scope: !43)
!158 = !DILocation(line: 34, column: 12, scope: !43)
!159 = !DILocation(line: 36, column: 20, scope: !43)
!160 = !DILocation(line: 37, column: 16, scope: !161)
!161 = distinct !DILexicalBlock(scope: !43, file: !3, line: 37, column: 9)
!162 = !DILocation(line: 37, column: 9, scope: !43)
!163 = !DILocation(line: 38, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !161, file: !3, line: 37, column: 25)
!165 = !DILocation(line: 39, column: 22, scope: !166)
!166 = distinct !DILexicalBlock(scope: !161, file: !3, line: 39, column: 16)
!167 = !DILocation(line: 39, column: 16, scope: !166)
!168 = !DILocation(line: 39, column: 16, scope: !161)
!169 = !DILocation(line: 40, column: 16, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !3, line: 39, column: 44)
!171 = !DILocation(line: 40, column: 9, scope: !170)
!172 = !DILocation(line: 41, column: 9, scope: !170)
!173 = !DILocation(line: 44, column: 30, scope: !43)
!174 = !{!175, !176, i64 48}
!175 = !{!"stat", !176, i64 0, !176, i64 8, !176, i64 16, !179, i64 24, !179, i64 28, !179, i64 32, !179, i64 36, !176, i64 40, !176, i64 48, !176, i64 56, !176, i64 64, !180, i64 72, !180, i64 88, !180, i64 104, !177, i64 120}
!176 = !{!"long", !177, i64 0}
!177 = !{!"omnipotent char", !178, i64 0}
!178 = !{!"Simple C/C++ TBAA"}
!179 = !{!"int", !177, i64 0}
!180 = !{!"timespec", !176, i64 0, !176, i64 8}
!181 = !DILocation(line: 44, column: 38, scope: !43)
!182 = !DILocation(line: 44, column: 17, scope: !43)
!183 = !DILocation(line: 47, column: 37, scope: !43)
!184 = !DILocation(line: 47, column: 32, scope: !43)
!185 = !DILocation(line: 48, column: 25, scope: !43)
!186 = !DILocation(line: 51, column: 5, scope: !43)
!187 = !DILocation(line: 46, column: 11, scope: !43)
!188 = !DILocation(line: 48, column: 13, scope: !43)
!189 = !DILocation(line: 51, column: 38, scope: !43)
!190 = !DILocation(line: 51, column: 49, scope: !43)
!191 = !DILocation(line: 51, column: 29, scope: !43)
!192 = !DILocation(line: 51, column: 67, scope: !43)
!193 = !DILocation(line: 51, column: 13, scope: !43)
!194 = !DILocation(line: 51, column: 113, scope: !43)
!195 = !DILocation(line: 0, scope: !152)
!196 = !DILocation(line: 55, column: 9, scope: !197)
!197 = distinct !DILexicalBlock(scope: !152, file: !3, line: 55, column: 9)
!198 = !DILocation(line: 56, column: 18, scope: !199)
!199 = distinct !DILexicalBlock(scope: !200, file: !3, line: 56, column: 17)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 55, column: 45)
!201 = distinct !DILexicalBlock(scope: !197, file: !3, line: 55, column: 9)
!202 = !DILocation(line: 0, scope: !199)
!203 = !{!177, !177, i64 0}
!204 = !DILocation(line: 56, column: 17, scope: !200)
!205 = !DILocation(line: 57, column: 21, scope: !206)
!206 = distinct !DILexicalBlock(scope: !199, file: !3, line: 56, column: 25)
!207 = !DILocation(line: 59, column: 21, scope: !208)
