; ModuleID = 'cache.c'
source_filename = "cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cache_t = type { %union.pthread_mutex_t, i8*, %struct.cache_head, i64, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.cache_head = type { %struct.cache_free_s*, %struct.cache_free_s** }
%struct.cache_free_s = type { %struct.anon }
%struct.anon = type { %struct.cache_free_s* }
%union.pthread_mutexattr_t = type { i32 }

@redzone_pattern = dso_local constant i64 -2401053089206444307, align 8, !dbg !0
@cache_error = dso_local local_unnamed_addr global i32 0, align 4, !dbg !17
@.str = private unnamed_addr constant [44 x i8] c"ret->bufsize >= sizeof(struct cache_free_s)\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"cache.c\00", align 1
@__PRETTY_FUNCTION__.cache_create = private unnamed_addr constant [52 x i8] c"cache_t *cache_create(const char *, size_t, size_t)\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.cache_t* @cache_create(i8* noundef %name, i64 noundef %bufsize, i64 noundef %align) local_unnamed_addr #0 !dbg !31 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "redzone_pattern", scope: !2, file: !3, line: 14, type: !20, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "cache.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "60b1b5f6bc21bd27dd29da4cd54982da")
!4 = !{!5, !6, !8}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !10, line: 12, size: 64, elements: !11)
!10 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !9, file: !10, line: 13, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 13, size: 64, elements: !14)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !13, file: !10, line: 13, baseType: !8, size: 64)
!16 = !{!0, !17}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "cache_error", scope: !2, file: !3, line: 15, type: !19, isLocal: false, isDefinition: true)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 45, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!25 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!26 = !{i32 7, !"Dwarf Version", i32 5}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 1, !"wchar_size", i32 4}
!29 = !{i32 7, !"uwtable", i32 1}
!30 = !{!"clang version 14.0.0"}
!31 = distinct !DISubprogram(name: "cache_create", scope: !3, file: !3, line: 18, type: !32, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !86)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !84, !78, !78}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !10, line: 39, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 22, size: 704, elements: !37)
!37 = !{!38, !70, !71, !77, !80, !81, !82, !83}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !36, file: !10, line: 24, baseType: !39, size: 320)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !40, line: 72, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !40, line: 67, size: 320, elements: !42)
!42 = !{!43, !64, !68}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !41, file: !40, line: 69, baseType: !44, size: 320)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !45, line: 22, size: 320, elements: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!46 = !{!47, !48, !50, !51, !52, !53, !55, !56}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !44, file: !45, line: 24, baseType: !19, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !44, file: !45, line: 25, baseType: !49, size: 32, offset: 32)
!49 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !44, file: !45, line: 26, baseType: !19, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !44, file: !45, line: 28, baseType: !49, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !44, file: !45, line: 32, baseType: !19, size: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !44, file: !45, line: 34, baseType: !54, size: 16, offset: 160)
!54 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !44, file: !45, line: 35, baseType: !54, size: 16, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !44, file: !45, line: 36, baseType: !57, size: 128, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !58, line: 53, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !58, line: 49, size: 128, elements: !60)
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !59, file: !58, line: 51, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !59, file: !58, line: 52, baseType: !62, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !41, file: !40, line: 70, baseType: !65, size: 320)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 40)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !41, file: !40, line: 71, baseType: !69, size: 64)
!69 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !10, line: 26, baseType: !6, size: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !36, file: !10, line: 28, baseType: !72, size: 128, offset: 384)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !10, line: 28, size: 128, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !72, file: !10, line: 28, baseType: !8, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !72, file: !10, line: 28, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !36, file: !10, line: 30, baseType: !78, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !25)
!79 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !36, file: !10, line: 32, baseType: !19, size: 32, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !36, file: !10, line: 34, baseType: !19, size: 32, offset: 608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !36, file: !10, line: 36, baseType: !19, size: 32, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !36, file: !10, line: 38, baseType: !19, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DILocalVariable(name: "name", arg: 1, scope: !31, file: !3, line: 18, type: !84)
!88 = !DILocalVariable(name: "bufsize", arg: 2, scope: !31, file: !3, line: 18, type: !78)
!89 = !DILocalVariable(name: "align", arg: 3, scope: !31, file: !3, line: 18, type: !78)
!90 = !DILocalVariable(name: "ret", scope: !31, file: !3, line: 19, type: !34)
!91 = !DILocalVariable(name: "nm", scope: !31, file: !3, line: 20, type: !6)
!92 = !DILocation(line: 0, scope: !31)
!93 = !DILocation(line: 19, column: 20, scope: !31)
!94 = !DILocation(line: 20, column: 16, scope: !31)
!95 = !DILocation(line: 21, column: 13, scope: !96)
!96 = distinct !DILexicalBlock(scope: !31, file: !3, line: 21, column: 9)
!97 = !DILocation(line: 21, column: 21, scope: !96)
!98 = !DILocation(line: 22, column: 34, scope: !96)
!99 = !DILocation(line: 22, column: 9, scope: !96)
!100 = !DILocation(line: 22, column: 47, scope: !96)
!101 = !DILocation(line: 21, column: 9, scope: !31)
!102 = !DILocation(line: 23, column: 9, scope: !103)
!103 = distinct !DILexicalBlock(scope: !96, file: !3, line: 22, column: 54)
!104 = !DILocation(line: 24, column: 9, scope: !103)
!105 = !DILocation(line: 25, column: 9, scope: !103)
!106 = !DILocation(line: 28, column: 10, scope: !31)
!107 = !DILocation(line: 28, column: 15, scope: !31)
!108 = !{!109, !112, i64 40}
!109 = !{!"", !110, i64 0, !112, i64 40, !113, i64 48, !114, i64 64, !115, i64 72, !115, i64 76, !115, i64 80, !115, i64 84}
!110 = !{!"omnipotent char", !111, i64 0}
!111 = !{!"Simple C/C++ TBAA"}
!112 = !{!"any pointer", !110, i64 0}
!113 = !{!"cache_head", !112, i64 0, !112, i64 8}
!114 = !{!"long", !110, i64 0}
!115 = !{!"int", !110, i64 0}
!116 = !DILocation(line: 29, column: 5, scope: !117)
!117 = distinct !DILexicalBlock(scope: !31, file: !3, line: 29, column: 5)
!118 = !{!109, !112, i64 48}
!119 = !{!109, !112, i64 56}
!120 = !DILocation(line: 32, column: 28, scope: !31)
!121 = !DILocation(line: 32, column: 10, scope: !31)
!122 = !DILocation(line: 32, column: 18, scope: !31)
!123 = !{!109, !114, i64 64}
!124 = !DILocation(line: 36, column: 5, scope: !125)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 36, column: 5)
!126 = distinct !DILexicalBlock(scope: !31, file: !3, line: 36, column: 5)
!127 = !DILocation(line: 36, column: 5, scope: !126)
!128 = !DILocation(line: 39, column: 1, scope: !31)
!129 = !DISubprogram(name: "calloc", scope: !130, file: !130, line: 542, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!130 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!131 = !DISubroutineType(types: !132)
!132 = !{!5, !78, !78}
!133 = !{}
!134 = !DISubprogram(name: "strdup", scope: !135, file: !135, line: 167, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!135 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!136 = !DISubroutineType(types: !137)
!137 = !{!6, !84}
!138 = !DISubprogram(name: "pthread_mutex_init", scope: !139, file: !139, line: 725, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!139 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!140 = !DISubroutineType(types: !141)
!141 = !{!19, !142, !143}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
