; ModuleID = 'crawler.c'
source_filename = "crawler.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._crawler_module_t = type { i8*, %struct.crawler_client_t, %struct.crawler_module_reg_t* }
%struct.crawler_client_t = type { i8*, i32, %struct.bipbuf_t*, i8* }
%struct.bipbuf_t = type { i64, i32, i32, i32, i32, [0 x i8] }
%struct.crawler_module_reg_t = type { {}*, void (%struct._crawler_module_t*, %struct._stritem*, i32, i32)*, void (%struct._crawler_module_t*, i32)*, void (%struct._crawler_module_t*)*, i8, i8 }
%struct._stritem = type { %struct._stritem*, %struct._stritem*, %struct._stritem*, i32, i32, i32, i16, i16, i8, i8, [0 x %union.anon] }
%union.anon = type { i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon.0, %union.anon.1, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon.0 = type { i64 }
%union.anon.1 = type { i64 }

!15 = !DIEnumerator(name: "CRAWLER_OK", value: 0)
!16 = !DIEnumerator(name: "CRAWLER_RUNNING", value: 1)
!17 = !DIEnumerator(name: "CRAWLER_BADCLASS", value: 2)
!18 = !DIEnumerator(name: "CRAWLER_NOTSTARTED", value: 3)
!19 = !DIEnumerator(name: "CRAWLER_ERROR", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "conn_states", file: !6, line: 199, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!22 = !DIEnumerator(name: "conn_listening", value: 0)
!23 = !DIEnumerator(name: "conn_new_cmd", value: 1)
!24 = !DIEnumerator(name: "conn_waiting", value: 2)
!25 = !DIEnumerator(name: "conn_read", value: 3)
!26 = !DIEnumerator(name: "conn_parse_cmd", value: 4)
!27 = !DIEnumerator(name: "conn_write", value: 5)
!28 = !DIEnumerator(name: "conn_nread", value: 6)
!29 = !DIEnumerator(name: "conn_swallow", value: 7)
!30 = !DIEnumerator(name: "conn_closing", value: 8)
!31 = !DIEnumerator(name: "conn_mwrite", value: 9)
!32 = !DIEnumerator(name: "conn_closed", value: 10)
!33 = !DIEnumerator(name: "conn_watch", value: 11)
!34 = !DIEnumerator(name: "conn_io_queue", value: 12)
!35 = !DIEnumerator(name: "conn_max_state", value: 13)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bin_substates", file: !6, line: 216, baseType: !7, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "bin_no_state", value: 0)
!39 = !DIEnumerator(name: "bin_reading_set_header", value: 1)
!40 = !DIEnumerator(name: "bin_reading_cas_header", value: 2)
!41 = !DIEnumerator(name: "bin_read_set_value", value: 3)
!42 = !DIEnumerator(name: "bin_reading_get_key", value: 4)
!43 = !DIEnumerator(name: "bin_reading_stat", value: 5)
!44 = !DIEnumerator(name: "bin_reading_del_header", value: 6)
!45 = !DIEnumerator(name: "bin_reading_incr_header", value: 7)
!46 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!47 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!48 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!49 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_entry_type", file: !51, line: 16, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!53 = !DIEnumerator(name: "LOGGER_ASCII_CMD", value: 0)
!54 = !DIEnumerator(name: "LOGGER_EVICTION", value: 1)
!55 = !DIEnumerator(name: "LOGGER_ITEM_GET", value: 2)
!56 = !DIEnumerator(name: "LOGGER_ITEM_STORE", value: 3)
!57 = !DIEnumerator(name: "LOGGER_CRAWLER_STATUS", value: 4)
!58 = !DIEnumerator(name: "LOGGER_SLAB_MOVE", value: 5)
!59 = !DIEnumerator(name: "LOGGER_CONNECTION_NEW", value: 6)
!60 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!61 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!62 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!63 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!64 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!65 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!66 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!67 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !6, line: 231, baseType: !7, size: 32, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "ascii_prot", value: 3)
!71 = !DIEnumerator(name: "binary_prot", value: 4)
!72 = !DIEnumerator(name: "negotiating_prot", value: 5)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !6, line: 240, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "local_transport", value: 0)
!76 = !DIEnumerator(name: "tcp_transport", value: 1)
!77 = !DIEnumerator(name: "udp_transport", value: 2)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !6, line: 259, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!81 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!82 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!83 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!84 = !{!85, !86, !151, !121, !152, !129, !133, !153, !503}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crawler_expired_data", file: !13, line: 17, size: 1098176, elements: !88)
!88 = !{!89, !122, !147, !148, !149, !150}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !87, file: !13, line: 18, baseType: !90, size: 320)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !91, line: 72, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !91, line: 67, size: 320, elements: !93)
!93 = !{!94, !115, !120}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !92, file: !91, line: 69, baseType: !95, size: 320)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !96, line: 22, size: 320, elements: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!97 = !{!98, !100, !101, !102, !103, !104, !106, !107}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !95, file: !96, line: 24, baseType: !99, size: 32)
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !95, file: !96, line: 25, baseType: !7, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !95, file: !96, line: 26, baseType: !99, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !95, file: !96, line: 28, baseType: !7, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !95, file: !96, line: 32, baseType: !99, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !95, file: !96, line: 34, baseType: !105, size: 16, offset: 160)
!105 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !95, file: !96, line: 35, baseType: !105, size: 16, offset: 176)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !95, file: !96, line: 36, baseType: !108, size: 128, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !109, line: 53, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !109, line: 49, size: 128, elements: !111)
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !110, file: !109, line: 51, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !110, file: !109, line: 52, baseType: !113, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !92, file: !91, line: 70, baseType: !116, size: 320)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 320, elements: !118)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: 40)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !92, file: !91, line: 71, baseType: !121, size: 64)
!121 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "crawlerstats", scope: !87, file: !13, line: 19, baseType: !123, size: 1097728, offset: 320)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1097728, elements: !145)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawlerstats_t", file: !13, line: 15, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 6, size: 4288, elements: !126)
!126 = !{!127, !136, !137, !138, !139, !140, !142, !143}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !125, file: !13, line: 7, baseType: !128, size: 3904)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 3904, elements: !134)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !130, line: 27, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !132, line: 45, baseType: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!133 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!134 = !{!135}
!135 = !DISubrange(count: 61)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ttl_hourplus", scope: !125, file: !13, line: 8, baseType: !129, size: 64, offset: 3904)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "noexp", scope: !125, file: !13, line: 9, baseType: !129, size: 64, offset: 3968)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reclaimed", scope: !125, file: !13, line: 10, baseType: !129, size: 64, offset: 4032)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "seen", scope: !125, file: !13, line: 11, baseType: !129, size: 64, offset: 4096)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !125, file: !13, line: 12, baseType: !141, size: 32, offset: 4160)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !51, line: 14, baseType: !7)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "end_time", scope: !125, file: !13, line: 13, baseType: !141, size: 32, offset: 4192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "run_complete", scope: !125, file: !13, line: 14, baseType: !144, size: 8, offset: 4224)
!144 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!145 = !{!146}
!146 = !DISubrange(count: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !87, file: !13, line: 21, baseType: !141, size: 32, offset: 1098048)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "end_time", scope: !87, file: !13, line: 22, baseType: !141, size: 32, offset: 1098080)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "crawl_complete", scope: !87, file: !13, line: 23, baseType: !144, size: 8, offset: 1098112)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "is_external", scope: !87, file: !13, line: 24, baseType: !144, size: 8, offset: 1098120)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!152 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !6, line: 781, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 794, size: 3968, elements: !156)
!156 = !{!157, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !257, !258, !259, !260, !261, !262, !263, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !600, !621, !622, !623, !624, !625, !626, !627, !628, !632, !639, !654}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !155, file: !6, line: 795, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !160, line: 16, baseType: !85)
!160 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !155, file: !6, line: 796, baseType: !99, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !155, file: !6, line: 797, baseType: !144, size: 8, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !155, file: !6, line: 798, baseType: !144, size: 8, offset: 104)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !155, file: !6, line: 799, baseType: !144, size: 8, offset: 112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !155, file: !6, line: 800, baseType: !144, size: 8, offset: 120)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !155, file: !6, line: 801, baseType: !144, size: 8, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !155, file: !6, line: 802, baseType: !144, size: 8, offset: 136)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !155, file: !6, line: 803, baseType: !144, size: 8, offset: 144)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !6, line: 809, baseType: !20, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !155, file: !6, line: 810, baseType: !36, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !155, file: !6, line: 811, baseType: !141, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !155, file: !6, line: 812, baseType: !173, size: 1024, offset: 256)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !174, line: 123, size: 1024, elements: !175)
!174 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!175 = !{!176, !210, !220, !221, !224, !254, !255, !256}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !173, file: !174, line: 124, baseType: !177, size: 320)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !174, line: 107, size: 320, elements: !178)
!178 = !{!179, !186, !187, !191, !192, !209}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !177, file: !174, line: 108, baseType: !180, size: 128)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !174, line: 108, size: 128, elements: !181)
!181 = !{!182, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !180, file: !174, line: 108, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !180, file: !174, line: 108, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !177, file: !174, line: 109, baseType: !105, size: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !177, file: !174, line: 110, baseType: !188, size: 8, offset: 144)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !130, line: 24, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !132, line: 38, baseType: !190)
!190 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !177, file: !174, line: 111, baseType: !188, size: 8, offset: 152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !177, file: !174, line: 118, baseType: !193, size: 64, offset: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !177, file: !174, line: 113, size: 64, elements: !194)
!194 = !{!195, !199, !203, !208}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !193, file: !174, line: 114, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !99, !105, !85}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !193, file: !174, line: 115, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !183, !85}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !193, file: !174, line: 116, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207, !85}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !193, file: !174, line: 117, baseType: !200, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !177, file: !174, line: 119, baseType: !85, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !173, file: !174, line: 130, baseType: !211, size: 128, offset: 320)
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !174, line: 127, size: 128, elements: !212)
!212 = !{!213, !219}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !211, file: !174, line: 128, baseType: !214, size: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !174, line: 128, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !214, file: !174, line: 128, baseType: !207, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !214, file: !174, line: 128, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !211, file: !174, line: 129, baseType: !99, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !173, file: !174, line: 131, baseType: !99, size: 32, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !173, file: !174, line: 133, baseType: !222, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !174, line: 122, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !173, file: !174, line: 149, baseType: !225, size: 256, offset: 576)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !174, line: 135, size: 256, elements: !226)
!226 = !{!227, !243}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !225, file: !174, line: 140, baseType: !228, size: 256)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !174, line: 137, size: 256, elements: !229)
!229 = !{!230, !235}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !228, file: !174, line: 138, baseType: !231, size: 128)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !174, line: 138, size: 128, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !231, file: !174, line: 138, baseType: !207, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !231, file: !174, line: 138, baseType: !218, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !228, file: !174, line: 139, baseType: !236, size: 128, offset: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !237, line: 8, size: 128, elements: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !236, file: !237, line: 10, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !132, line: 160, baseType: !121)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !236, file: !237, line: 11, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !132, line: 162, baseType: !121)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !225, file: !174, line: 148, baseType: !244, size: 256)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !174, line: 143, size: 256, elements: !245)
!245 = !{!246, !251, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !244, file: !174, line: 144, baseType: !247, size: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !244, file: !174, line: 144, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !247, file: !174, line: 144, baseType: !207, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !247, file: !174, line: 144, baseType: !218, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !244, file: !174, line: 145, baseType: !105, size: 16, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !244, file: !174, line: 147, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !173, file: !174, line: 151, baseType: !105, size: 16, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !173, file: !174, line: 152, baseType: !105, size: 16, offset: 848)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !173, file: !174, line: 153, baseType: !236, size: 128, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !155, file: !6, line: 813, baseType: !105, size: 16, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !155, file: !6, line: 814, baseType: !105, size: 16, offset: 1296)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !155, file: !6, line: 816, baseType: !151, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !155, file: !6, line: 817, baseType: !151, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !155, file: !6, line: 818, baseType: !99, size: 32, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !155, file: !6, line: 819, baseType: !99, size: 32, offset: 1504)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !155, file: !6, line: 821, baseType: !264, size: 64, offset: 1536)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !6, line: 770, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !6, line: 743, size: 9472, elements: !267)
!267 = !{!268, !282, !284, !285, !286, !287, !502, !524, !533, !534, !535, !536, !537, !538, !539, !540, !541, !570, !574}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !266, file: !6, line: 744, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !6, line: 703, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !6, line: 773, size: 192, elements: !272)
!272 = !{!273, !274, !275, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !271, file: !6, line: 774, baseType: !188, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !271, file: !6, line: 775, baseType: !188, size: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !6, line: 776, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !6, line: 777, baseType: !276, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !271, file: !6, line: 778, baseType: !279, offset: 192)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: -1)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !6, line: 745, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !266, file: !6, line: 746, baseType: !99, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !266, file: !6, line: 747, baseType: !99, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !266, file: !6, line: 748, baseType: !85, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !266, file: !6, line: 749, baseType: !288, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !6, line: 668, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !6, line: 783, size: 1216, elements: !291)
!291 = !{!292, !293, !496, !497, !498}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !290, file: !6, line: 784, baseType: !99, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !290, file: !6, line: 785, baseType: !294, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !6, line: 737, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 704, size: 54464, elements: !297)
!297 = !{!298, !300, !301, !302, !303, !356, !385, !388, !416, !417, !418, !419, !494, !495}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !296, file: !6, line: 705, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !91, line: 27, baseType: !133)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !296, file: !6, line: 706, baseType: !222, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !296, file: !6, line: 707, baseType: !173, size: 1024, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !296, file: !6, line: 709, baseType: !99, size: 32, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !296, file: !6, line: 714, baseType: !304, size: 51584, offset: 1216)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !6, line: 356, size: 51584, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !351, !353, !354, !355}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !304, file: !6, line: 357, baseType: !90, size: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1280)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1600)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1664)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1728)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !304, file: !6, line: 359, baseType: !129, size: 64, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 1856)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 1920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 1984)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !304, file: !6, line: 361, baseType: !129, size: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !304, file: !6, line: 367, baseType: !338, size: 32768, offset: 2240)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 32768, elements: !349)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !6, line: 303, size: 512, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !339, file: !6, line: 305, baseType: !129, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !339, file: !6, line: 305, baseType: !129, size: 64, offset: 448)
!349 = !{!350}
!350 = !DISubrange(count: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !304, file: !6, line: 368, baseType: !352, size: 16384, offset: 35008)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 16384, elements: !145)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !304, file: !6, line: 369, baseType: !129, size: 64, offset: 51392)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !304, file: !6, line: 370, baseType: !129, size: 64, offset: 51456)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !304, file: !6, line: 371, baseType: !129, size: 64, offset: 51520)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !296, file: !6, line: 715, baseType: !357, size: 1152, offset: 52800)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 1152, elements: !383)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !6, line: 701, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !6, line: 694, size: 384, elements: !360)
!360 = !{!361, !362, !375, !376, !381, !382}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !359, file: !6, line: 695, baseType: !85, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !359, file: !6, line: 696, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !6, line: 670, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !6, line: 669, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !6, line: 687, size: 192, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !369, file: !6, line: 688, baseType: !85, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !369, file: !6, line: 689, baseType: !85, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !369, file: !6, line: 690, baseType: !99, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !6, line: 691, baseType: !99, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !359, file: !6, line: 697, baseType: !363, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !359, file: !6, line: 698, baseType: !377, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !6, line: 671, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !288}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !359, file: !6, line: 699, baseType: !377, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !6, line: 700, baseType: !99, size: 32, offset: 320)
!383 = !{!384}
!384 = !DISubrange(count: 3)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !296, file: !6, line: 716, baseType: !386, size: 64, offset: 53952)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !6, line: 716, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !296, file: !6, line: 717, baseType: !389, size: 64, offset: 54016)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !391, line: 39, baseType: !392)
!391 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 22, size: 704, elements: !393)
!393 = !{!394, !395, !396, !409, !412, !413, !414, !415}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !392, file: !391, line: 24, baseType: !90, size: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !392, file: !391, line: 26, baseType: !151, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !392, file: !391, line: 28, baseType: !397, size: 128, offset: 384)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !391, line: 28, size: 128, elements: !398)
!398 = !{!399, !407}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !397, file: !391, line: 28, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !391, line: 12, size: 64, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !401, file: !391, line: 13, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !401, file: !391, line: 13, size: 64, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !404, file: !391, line: 13, baseType: !400, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !397, file: !391, line: 28, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !392, file: !391, line: 30, baseType: !410, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !411, line: 46, baseType: !133)
!411 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !392, file: !391, line: 32, baseType: !99, size: 32, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !392, file: !391, line: 34, baseType: !99, size: 32, offset: 608)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !392, file: !391, line: 36, baseType: !99, size: 32, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !392, file: !391, line: 38, baseType: !99, size: 32, offset: 672)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !296, file: !6, line: 718, baseType: !269, size: 64, offset: 54080)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !296, file: !6, line: 719, baseType: !389, size: 64, offset: 54144)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !296, file: !6, line: 721, baseType: !85, size: 64, offset: 54208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !296, file: !6, line: 723, baseType: !420, size: 64, offset: 54272)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !51, line: 171, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !51, line: 159, size: 832, elements: !423)
!423 = !{!424, !426, !427, !428, !429, !430, !431, !435, !436, !437, !450}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !51, line: 160, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !51, line: 161, baseType: !425, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !422, file: !51, line: 162, baseType: !90, size: 320, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !422, file: !51, line: 163, baseType: !129, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !422, file: !51, line: 164, baseType: !129, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !422, file: !51, line: 165, baseType: !129, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !422, file: !51, line: 166, baseType: !432, size: 16, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !130, line: 25, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !132, line: 40, baseType: !434)
!434 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !422, file: !51, line: 167, baseType: !432, size: 16, offset: 656)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !422, file: !51, line: 168, baseType: !432, size: 16, offset: 672)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !422, file: !51, line: 169, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !440, line: 18, baseType: !441)
!440 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 4, size: 192, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !441, file: !440, line: 6, baseType: !133, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !441, file: !440, line: 9, baseType: !7, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !441, file: !440, line: 9, baseType: !7, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !441, file: !440, line: 12, baseType: !7, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !441, file: !440, line: 15, baseType: !99, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !440, line: 17, baseType: !449, offset: 192)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, elements: !280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !422, file: !51, line: 170, baseType: !451, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !51, line: 57, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !51, line: 62, size: 256, elements: !455)
!455 = !{!456, !457, !458, !488, !493}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !454, file: !51, line: 63, baseType: !99, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !454, file: !51, line: 64, baseType: !432, size: 16, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !454, file: !51, line: 65, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !51, line: 59, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !463, !451, !478, !480}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !51, line: 56, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !51, line: 135, size: 320, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !465, file: !51, line: 136, baseType: !50, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !51, line: 137, baseType: !188, size: 8, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !465, file: !51, line: 138, baseType: !432, size: 16, offset: 48)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !465, file: !51, line: 139, baseType: !129, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !465, file: !51, line: 140, baseType: !236, size: 128, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !465, file: !51, line: 141, baseType: !99, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !51, line: 144, baseType: !474, offset: 288)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, elements: !280)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !465, file: !51, line: 142, size: 8, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !475, file: !51, line: 143, baseType: !117, size: 8)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !482)
!482 = !{!483, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !481, file: !484, line: 295, baseType: !7, size: 32)
!484 = !DIFile(filename: "crawler.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !481, file: !484, line: 295, baseType: !7, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !481, file: !484, line: 295, baseType: !85, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !481, file: !484, line: 295, baseType: !85, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !454, file: !51, line: 66, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !51, line: 60, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!99, !463, !151}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !454, file: !51, line: 67, baseType: !151, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !296, file: !6, line: 724, baseType: !85, size: 64, offset: 54336)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !296, file: !6, line: 728, baseType: !99, size: 32, offset: 54400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !290, file: !6, line: 786, baseType: !153, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !290, file: !6, line: 787, baseType: !264, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !6, line: 788, baseType: !499, size: 960, offset: 256)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 960, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 120)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !266, file: !6, line: 751, baseType: !503, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !6, line: 598, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !6, line: 575, size: 384, elements: !506)
!506 = !{!507, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !6, line: 577, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !505, file: !6, line: 578, baseType: !508, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !505, file: !6, line: 580, baseType: !508, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !505, file: !6, line: 581, baseType: !141, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !505, file: !6, line: 582, baseType: !141, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !505, file: !6, line: 583, baseType: !99, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !505, file: !6, line: 584, baseType: !434, size: 16, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !505, file: !6, line: 585, baseType: !432, size: 16, offset: 304)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !505, file: !6, line: 586, baseType: !188, size: 8, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !505, file: !6, line: 587, baseType: !188, size: 8, offset: 328)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !505, file: !6, line: 593, baseType: !519, offset: 384)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, elements: !280)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !6, line: 590, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !520, file: !6, line: 591, baseType: !129, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !520, file: !6, line: 592, baseType: !117, size: 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !266, file: !6, line: 752, baseType: !525, size: 512, offset: 384)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 512, elements: !531)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !527, line: 26, size: 128, elements: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !526, file: !527, line: 28, baseType: !85, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !526, file: !527, line: 29, baseType: !410, size: 64, offset: 64)
!531 = !{!532}
!532 = !DISubrange(count: 4)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !266, file: !6, line: 753, baseType: !99, size: 32, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !266, file: !6, line: 754, baseType: !188, size: 8, offset: 928)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !266, file: !6, line: 755, baseType: !188, size: 8, offset: 936)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !266, file: !6, line: 760, baseType: !144, size: 8, offset: 944)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !266, file: !6, line: 761, baseType: !144, size: 8, offset: 952)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !266, file: !6, line: 763, baseType: !432, size: 16, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !266, file: !6, line: 764, baseType: !432, size: 16, offset: 976)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !266, file: !6, line: 765, baseType: !432, size: 16, offset: 992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !266, file: !6, line: 766, baseType: !542, size: 224, offset: 1024)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !543, line: 253, size: 224, elements: !544)
!543 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!544 = !{!545, !548, !550, !553, !569}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !542, file: !543, line: 255, baseType: !546, size: 16)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !547, line: 28, baseType: !434)
!547 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !542, file: !543, line: 256, baseType: !549, size: 16, offset: 16)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !543, line: 119, baseType: !432)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !542, file: !543, line: 257, baseType: !551, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !130, line: 26, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !132, line: 42, baseType: !7)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !542, file: !543, line: 258, baseType: !554, size: 128, offset: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !543, line: 212, size: 128, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !554, file: !543, line: 219, baseType: !557, size: 128)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !543, line: 214, size: 128, elements: !558)
!558 = !{!559, !563, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !557, file: !543, line: 216, baseType: !560, size: 128)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !557, file: !543, line: 217, baseType: !564, size: 128)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 128, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !557, file: !543, line: 218, baseType: !568, size: 128)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 128, elements: !531)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !542, file: !543, line: 259, baseType: !551, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !266, file: !6, line: 767, baseType: !571, size: 32, offset: 1248)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !572, line: 33, baseType: !573)
!572 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !132, line: 209, baseType: !7)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !266, file: !6, line: 769, baseType: !575, size: 8192, offset: 1280)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 8192, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1024)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !155, file: !6, line: 822, baseType: !264, size: 64, offset: 1600)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !155, file: !6, line: 823, baseType: !151, size: 64, offset: 1664)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !155, file: !6, line: 824, baseType: !99, size: 32, offset: 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !155, file: !6, line: 832, baseType: !85, size: 64, offset: 1792)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !155, file: !6, line: 835, baseType: !99, size: 32, offset: 1856)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !155, file: !6, line: 837, baseType: !99, size: 32, offset: 1888)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !155, file: !6, line: 838, baseType: !585, size: 576, offset: 1920)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 576, elements: !383)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !155, file: !6, line: 843, baseType: !7, size: 32, offset: 2496)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !155, file: !6, line: 845, baseType: !68, size: 32, offset: 2528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !155, file: !6, line: 846, baseType: !73, size: 32, offset: 2560)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !155, file: !6, line: 847, baseType: !78, size: 32, offset: 2592)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !155, file: !6, line: 850, baseType: !99, size: 32, offset: 2624)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !155, file: !6, line: 851, baseType: !542, size: 224, offset: 2656)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !155, file: !6, line: 852, baseType: !571, size: 32, offset: 2880)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !155, file: !6, line: 854, baseType: !144, size: 8, offset: 2912)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !155, file: !6, line: 860, baseType: !595, size: 192, offset: 2944)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !6, line: 856, size: 192, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !595, file: !6, line: 857, baseType: !151, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !595, file: !6, line: 858, baseType: !410, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !595, file: !6, line: 859, baseType: !410, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !155, file: !6, line: 864, baseType: !601, size: 192, offset: 3136)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !602, line: 164, baseType: !603)
!602 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !602, line: 151, size: 192, elements: !604)
!604 = !{!605, !617}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !603, file: !602, line: 162, baseType: !606, size: 192)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !602, line: 152, size: 192, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !606, file: !602, line: 153, baseType: !188, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !606, file: !602, line: 154, baseType: !188, size: 8, offset: 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !606, file: !602, line: 155, baseType: !432, size: 16, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !606, file: !602, line: 156, baseType: !188, size: 8, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !606, file: !602, line: 157, baseType: !188, size: 8, offset: 40)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !606, file: !602, line: 158, baseType: !432, size: 16, offset: 48)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !606, file: !602, line: 159, baseType: !551, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !606, file: !602, line: 160, baseType: !551, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !606, file: !602, line: 161, baseType: !129, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !603, file: !602, line: 163, baseType: !618, size: 192)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 192, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 24)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !155, file: !6, line: 865, baseType: !129, size: 64, offset: 3328)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !155, file: !6, line: 866, baseType: !129, size: 64, offset: 3392)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !155, file: !6, line: 867, baseType: !105, size: 16, offset: 3456)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !155, file: !6, line: 868, baseType: !99, size: 32, offset: 3488)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !155, file: !6, line: 869, baseType: !99, size: 32, offset: 3520)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !6, line: 870, baseType: !153, size: 64, offset: 3584)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !155, file: !6, line: 871, baseType: !294, size: 64, offset: 3648)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !155, file: !6, line: 872, baseType: !629, size: 64, offset: 3712)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!99, !153}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !155, file: !6, line: 873, baseType: !633, size: 64, offset: 3776)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !153, !85, !410}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !637, line: 108, baseType: !638)
!637 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !132, line: 193, baseType: !121)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !155, file: !6, line: 874, baseType: !640, size: 64, offset: 3840)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!636, !153, !643, !99}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !572, line: 257, size: 448, elements: !645)
!645 = !{!646, !647, !648, !650, !651, !652, !653}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !644, file: !572, line: 259, baseType: !85, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !644, file: !572, line: 260, baseType: !571, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !644, file: !572, line: 262, baseType: !649, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !644, file: !572, line: 263, baseType: !410, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !644, file: !572, line: 265, baseType: !85, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !644, file: !572, line: 266, baseType: !410, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !644, file: !572, line: 271, baseType: !99, size: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !155, file: !6, line: 875, baseType: !633, size: 64, offset: 3904)
!655 = !{!0, !656, !698, !701, !722, !724, !726, !728, !730, !750, !752, !755, !795, !797}
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "crawler_metadump_mod", scope: !2, file: !3, line: 74, type: !658, isLocal: false, isDefinition: true)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_module_reg_t", file: !3, line: 49, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 320, elements: !660)
!660 = !{!661, !681, !686, !691, !696, !697}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !659, file: !3, line: 43, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_init_func", file: !3, line: 37, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!99, !666, !85}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_module_t", file: !3, line: 34, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_crawler_module_t", file: !3, line: 51, size: 384, elements: !669)
!669 = !{!670, !671, !679}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !668, file: !3, line: 52, baseType: !85, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !668, file: !3, line: 53, baseType: !672, size: 256, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_client_t", file: !3, line: 32, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 256, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !673, file: !3, line: 28, baseType: !85, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !673, file: !3, line: 29, baseType: !99, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !673, file: !3, line: 30, baseType: !438, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cbuf", scope: !673, file: !3, line: 31, baseType: !151, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !668, file: !3, line: 54, baseType: !680, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !659, file: !3, line: 44, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_eval_func", file: !3, line: 36, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !666, !503, !551, !99}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "doneclass", scope: !659, file: !3, line: 45, baseType: !687, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_doneclass_func", file: !3, line: 39, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !666, !99}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !659, file: !3, line: 46, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler_finalize_func", file: !3, line: 40, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !666}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "needs_lock", scope: !659, file: !3, line: 47, baseType: !144, size: 8, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "needs_client", scope: !659, file: !3, line: 48, baseType: !144, size: 8, offset: 264)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "crawler_mod_regs", scope: !2, file: !3, line: 83, type: !700, isLocal: false, isDefinition: true)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 192, elements: !383)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "block_ae_until", scope: !703, file: !3, line: 640, type: !141, isLocal: true, isDefinition: true)
!703 = distinct !DISubprogram(name: "lru_crawler_start", scope: !3, file: !3, line: 635, type: !704, scopeLine: 637, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!704 = !DISubroutineType(types: !705)
!705 = !{!99, !706, !551, !707, !85, !85, !708}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718}
!710 = !DILocalVariable(name: "ids", arg: 1, scope: !703, file: !3, line: 635, type: !706)
!711 = !DILocalVariable(name: "remaining", arg: 2, scope: !703, file: !3, line: 635, type: !551)
!712 = !DILocalVariable(name: "type", arg: 3, scope: !703, file: !3, line: 636, type: !707)
!713 = !DILocalVariable(name: "data", arg: 4, scope: !703, file: !3, line: 636, type: !85)
!714 = !DILocalVariable(name: "c", arg: 5, scope: !703, file: !3, line: 637, type: !85)
!715 = !DILocalVariable(name: "sfd", arg: 6, scope: !703, file: !3, line: 637, type: !708)
!716 = !DILocalVariable(name: "starts", scope: !703, file: !3, line: 638, type: !99)
!717 = !DILocalVariable(name: "is_running", scope: !703, file: !3, line: 639, type: !144)
!718 = !DILocalVariable(name: "sid", scope: !719, file: !3, line: 697, type: !99)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 697, column: 9)
!720 = distinct !DILexicalBlock(scope: !721, file: !3, line: 695, column: 12)
!721 = distinct !DILexicalBlock(scope: !703, file: !3, line: 688, column: 9)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "active_crawler_mod", scope: !2, file: !3, line: 90, type: !667, isLocal: false, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "active_crawler_type", scope: !2, file: !3, line: 91, type: !5, isLocal: false, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "storage", scope: !2, file: !3, line: 102, type: !85, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "item_crawler_tid", scope: !2, file: !3, line: 528, type: !299, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "crawlers", scope: !2, file: !3, line: 93, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 147456, elements: !145)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "crawler", file: !6, line: 620, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 605, size: 576, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !6, line: 606, baseType: !508, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !734, file: !6, line: 607, baseType: !508, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !734, file: !6, line: 608, baseType: !508, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !734, file: !6, line: 609, baseType: !141, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !734, file: !6, line: 610, baseType: !141, size: 32, offset: 224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !734, file: !6, line: 611, baseType: !99, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !734, file: !6, line: 612, baseType: !434, size: 16, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !734, file: !6, line: 613, baseType: !432, size: 16, offset: 304)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !734, file: !6, line: 614, baseType: !188, size: 8, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !734, file: !6, line: 615, baseType: !188, size: 8, offset: 328)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !734, file: !6, line: 616, baseType: !551, size: 32, offset: 352)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reclaimed", scope: !734, file: !6, line: 617, baseType: !129, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "unfetched", scope: !734, file: !6, line: 618, baseType: !129, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !734, file: !6, line: 619, baseType: !129, size: 64, offset: 512)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "lru_crawler_lock", scope: !2, file: !3, line: 98, type: !90, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "do_run_lru_crawler_thread", scope: !2, file: !3, line: 96, type: !754, isLocal: true, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "lru_crawler_cond", scope: !2, file: !3, line: 99, type: !757, isLocal: true, isDefinition: true)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !91, line: 80, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !91, line: 75, size: 384, elements: !759)
!759 = !{!760, !789, !793}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !758, file: !91, line: 77, baseType: !761, size: 384)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !109, line: 92, size: 384, elements: !762)
!762 = !{!763, !772, !781, !785, !786, !787, !788}
!763 = !DIDerivedType(tag: DW_TAG_member, scope: !761, file: !109, line: 94, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !761, file: !109, line: 94, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !764, file: !109, line: 96, baseType: !152, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !764, file: !109, line: 101, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !764, file: !109, line: 97, size: 64, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !768, file: !109, line: 99, baseType: !7, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !768, file: !109, line: 100, baseType: !7, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, scope: !761, file: !109, line: 103, baseType: !773, size: 64, offset: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !761, file: !109, line: 103, size: 64, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !773, file: !109, line: 105, baseType: !152, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !773, file: !109, line: 110, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !773, file: !109, line: 106, size: 64, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !777, file: !109, line: 108, baseType: !7, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !777, file: !109, line: 109, baseType: !7, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !761, file: !109, line: 112, baseType: !782, size: 64, offset: 128)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 2)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !761, file: !109, line: 113, baseType: !782, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !761, file: !109, line: 114, baseType: !7, size: 32, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !761, file: !109, line: 115, baseType: !7, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !761, file: !109, line: 116, baseType: !782, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !758, file: !91, line: 78, baseType: !790, size: 384)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 384, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 48)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !758, file: !91, line: 79, baseType: !794, size: 64)
!794 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "crawler_count", scope: !2, file: !3, line: 95, type: !99, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "lru_crawler_initialized", scope: !2, file: !3, line: 97, type: !99, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!800 = !{i32 7, !"Dwarf Version", i32 5}
!801 = !{i32 2, !"Debug Info Version", i32 3}
!802 = !{i32 1, !"wchar_size", i32 4}
!803 = !{i32 7, !"uwtable", i32 1}
!804 = !{!"/home/xuheng/blackbox/llvm-test/memcached/crawler.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/crawler.gcda", !2}
!805 = !{!"clang version 14.0.0"}
!806 = distinct !DISubprogram(name: "crawler_expired_init", scope: !3, file: !3, line: 130, type: !664, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!807 = !{!808, !809, !810, !811}
!808 = !DILocalVariable(name: "cm", arg: 1, scope: !806, file: !3, line: 130, type: !666)
!809 = !DILocalVariable(name: "data", arg: 2, scope: !806, file: !3, line: 130, type: !85)
!810 = !DILocalVariable(name: "d", scope: !806, file: !3, line: 131, type: !86)
!811 = !DILocalVariable(name: "x", scope: !812, file: !3, line: 151, type: !99)
!812 = distinct !DILexicalBlock(scope: !806, file: !3, line: 151, column: 5)
!813 = !DILocation(line: 0, scope: !806)
!814 = !DILocation(line: 132, column: 14, scope: !815)
!815 = distinct !DILexicalBlock(scope: !806, file: !3, line: 132, column: 9)
!816 = !DILocation(line: 132, column: 9, scope: !806)
!817 = !DILocation(line: 133, column: 13, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !3, line: 132, column: 23)
!819 = !DILocation(line: 134, column: 12, scope: !818)
!820 = !DILocation(line: 134, column: 24, scope: !818)
!821 = !{!822, !826, i64 137265}
!822 = !{!"crawler_expired_data", !823, i64 0, !823, i64 40, !825, i64 137256, !825, i64 137260, !826, i64 137264, !826, i64 137265}
!823 = !{!"omnipotent char", !824, i64 0}
!824 = !{!"Simple C/C++ TBAA"}
!825 = !{!"int", !823, i64 0}
!826 = !{!"_Bool", !823, i64 0}
!827 = !DILocation(line: 136, column: 5, scope: !818)
!828 = !DILocation(line: 138, column: 13, scope: !829)
!829 = distinct !DILexicalBlock(scope: !815, file: !3, line: 136, column: 12)
!830 = !DILocation(line: 139, column: 15, scope: !831)
!831 = distinct !DILexicalBlock(scope: !829, file: !3, line: 139, column: 13)
!832 = !DILocation(line: 139, column: 13, scope: !829)
!833 = !DILocation(line: 140, column: 13, scope: !834)
!834 = distinct !DILexicalBlock(scope: !831, file: !3, line: 139, column: 24)
!835 = !DILocation(line: 143, column: 29, scope: !829)
!836 = !DILocation(line: 143, column: 32, scope: !829)
!837 = !DILocation(line: 143, column: 9, scope: !829)
!838 = !DILocation(line: 144, column: 12, scope: !829)
!839 = !DILocation(line: 144, column: 24, scope: !829)
!840 = !DILocation(line: 145, column: 25, scope: !829)
!841 = !{!825, !825, i64 0}
!842 = !DILocation(line: 145, column: 12, scope: !829)
!843 = !DILocation(line: 145, column: 23, scope: !829)
!844 = !{!822, !825, i64 137256}
!845 = !DILocation(line: 0, scope: !815)
!846 = !{!847, !848, i64 0}
!847 = !{!"_crawler_module_t", !848, i64 0, !849, i64 8, !848, i64 40}
!848 = !{!"any pointer", !823, i64 0}
!849 = !{!"", !848, i64 0, !825, i64 8, !848, i64 16, !848, i64 24}
!850 = !DILocation(line: 149, column: 28, scope: !806)
!851 = !DILocation(line: 149, column: 5, scope: !806)
!852 = !DILocation(line: 150, column: 16, scope: !806)
!853 = !DILocation(line: 150, column: 5, scope: !806)
!854 = !DILocation(line: 0, scope: !812)
!855 = !DILocation(line: 151, column: 5, scope: !812)
!856 = !DILocation(line: 155, column: 5, scope: !806)
!857 = !DILocation(line: 156, column: 5, scope: !806)
!858 = !DILocation(line: 152, column: 41, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !3, line: 151, column: 45)
!860 = distinct !DILexicalBlock(scope: !812, file: !3, line: 151, column: 5)
!861 = !DILocation(line: 152, column: 28, scope: !859)
!862 = !DILocation(line: 152, column: 39, scope: !859)
!863 = !{!864, !825, i64 520}
!864 = !{!"", !823, i64 0, !865, i64 488, !865, i64 496, !865, i64 504, !865, i64 512, !825, i64 520, !825, i64 524, !826, i64 528}
!865 = !{!"long", !823, i64 0}
!866 = !DILocation(line: 153, column: 28, scope: !859)
!867 = !DILocation(line: 153, column: 41, scope: !859)
!868 = !{!864, !826, i64 528}
!869 = !DILocation(line: 151, column: 41, scope: !860)
!870 = !DILocation(line: 151, column: 23, scope: !860)
!871 = distinct !{!871, !855, !872, !873}
!872 = !DILocation(line: 154, column: 5, scope: !812)
!873 = !{!"llvm.loop.mustprogress"}
!874 = !DILocation(line: 157, column: 1, scope: !806)
!875 = distinct !DISubprogram(name: "crawler_expired_eval", scope: !3, file: !3, line: 182, type: !684, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !884, !885, !886, !891, !892, !897}
!877 = !DILocalVariable(name: "cm", arg: 1, scope: !875, file: !3, line: 182, type: !666)
!878 = !DILocalVariable(name: "search", arg: 2, scope: !875, file: !3, line: 182, type: !503)
!879 = !DILocalVariable(name: "hv", arg: 3, scope: !875, file: !3, line: 182, type: !551)
!880 = !DILocalVariable(name: "i", arg: 4, scope: !875, file: !3, line: 182, type: !99)
!881 = !DILocalVariable(name: "d", scope: !875, file: !3, line: 183, type: !86)
!882 = !DILocalVariable(name: "s", scope: !875, file: !3, line: 185, type: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!884 = !DILocalVariable(name: "is_flushed", scope: !875, file: !3, line: 186, type: !99)
!885 = !DILocalVariable(name: "is_valid", scope: !875, file: !3, line: 188, type: !144)
!886 = !DILocalVariable(name: "ii", scope: !887, file: !3, line: 203, type: !99)
!887 = distinct !DILexicalBlock(scope: !888, file: !3, line: 202, column: 35)
!888 = distinct !DILexicalBlock(scope: !889, file: !3, line: 202, column: 13)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 198, column: 11)
!890 = distinct !DILexicalBlock(scope: !875, file: !3, line: 193, column: 9)
!891 = !DILocalVariable(name: "key", scope: !887, file: !3, line: 204, type: !151)
!892 = !DILocalVariable(name: "ttl_remain", scope: !893, file: !3, line: 228, type: !141)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 227, column: 16)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 225, column: 20)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 223, column: 13)
!896 = distinct !DILexicalBlock(scope: !890, file: !3, line: 220, column: 12)
!897 = !DILocalVariable(name: "bucket", scope: !893, file: !3, line: 229, type: !99)
!898 = !DILocation(line: 0, scope: !875)
!899 = !DILocation(line: 183, column: 74, scope: !875)
!900 = !DILocation(line: 184, column: 28, scope: !875)
!901 = !DILocation(line: 184, column: 5, scope: !875)
!902 = !DILocation(line: 185, column: 26, scope: !875)
!903 = !DILocation(line: 186, column: 22, scope: !875)
!904 = !DILocation(line: 189, column: 17, scope: !905)
!905 = distinct !DILexicalBlock(scope: !875, file: !3, line: 189, column: 9)
!906 = !{!907, !907, i64 0}
!907 = !{!"short", !823, i64 0}
!908 = !DILocation(line: 189, column: 26, scope: !905)
!909 = !DILocation(line: 189, column: 9, scope: !875)
!910 = !DILocation(line: 190, column: 42, scope: !911)
!911 = distinct !DILexicalBlock(scope: !905, file: !3, line: 189, column: 38)
!912 = !{!848, !848, i64 0}
!913 = !DILocation(line: 190, column: 20, scope: !911)
!914 = !DILocation(line: 191, column: 5, scope: !911)
!915 = !DILocation(line: 193, column: 18, scope: !890)
!916 = !DILocation(line: 193, column: 26, scope: !890)
!917 = !DILocation(line: 193, column: 31, scope: !890)
!918 = !DILocation(line: 193, column: 34, scope: !890)
!919 = !DILocation(line: 193, column: 52, scope: !890)
!920 = !DILocation(line: 193, column: 50, scope: !890)
!921 = !DILocation(line: 194, column: 9, scope: !890)
!922 = !DILocation(line: 194, column: 12, scope: !890)
!923 = !DILocation(line: 196, column: 9, scope: !890)
!924 = !DILocation(line: 196, column: 13, scope: !890)
!925 = !DILocation(line: 193, column: 9, scope: !875)
!926 = !DILocation(line: 199, column: 21, scope: !889)
!927 = !DILocation(line: 199, column: 30, scope: !889)
!928 = !{!929, !865, i64 48}
!929 = !{!"", !848, i64 0, !848, i64 8, !848, i64 16, !825, i64 24, !825, i64 28, !825, i64 32, !907, i64 36, !907, i64 38, !823, i64 40, !823, i64 41, !825, i64 44, !865, i64 48, !865, i64 56, !865, i64 64}
!930 = !DILocation(line: 200, column: 12, scope: !889)
!931 = !DILocation(line: 200, column: 21, scope: !889)
!932 = !{!864, !865, i64 504}
!933 = !DILocation(line: 202, column: 22, scope: !888)
!934 = !{!935, !825, i64 32}
!935 = !{!"settings", !865, i64 0, !825, i64 8, !825, i64 12, !825, i64 16, !848, i64 24, !825, i64 32, !825, i64 36, !865, i64 40, !825, i64 48, !848, i64 56, !848, i64 64, !825, i64 72, !936, i64 80, !825, i64 88, !825, i64 92, !825, i64 96, !823, i64 100, !825, i64 104, !825, i64 108, !826, i64 112, !823, i64 116, !825, i64 120, !825, i64 124, !825, i64 128, !825, i64 132, !825, i64 136, !826, i64 140, !826, i64 141, !826, i64 142, !826, i64 143, !826, i64 144, !826, i64 145, !825, i64 148, !936, i64 152, !825, i64 160, !825, i64 164, !826, i64 168, !825, i64 172, !826, i64 176, !826, i64 177, !848, i64 184, !825, i64 192, !825, i64 196, !825, i64 200, !825, i64 204, !936, i64 208, !936, i64 216, !825, i64 224, !826, i64 228, !825, i64 232, !825, i64 236, !825, i64 240, !825, i64 244, !825, i64 248, !826, i64 252, !826, i64 253, !826, i64 254, !826, i64 255, !825, i64 256, !825, i64 260, !825, i64 264, !825, i64 268, !825, i64 272, !825, i64 276, !825, i64 280, !825, i64 284, !825, i64 288, !825, i64 292, !936, i64 296, !936, i64 304, !826, i64 312, !825, i64 316, !825, i64 320, !848, i64 328, !825, i64 336}
!936 = !{!"double", !823, i64 0}
!937 = !DILocation(line: 202, column: 30, scope: !888)
!938 = !DILocation(line: 202, column: 13, scope: !889)
!939 = !DILocation(line: 204, column: 25, scope: !887)
!940 = !DILocation(line: 0, scope: !887)
!941 = !DILocation(line: 205, column: 21, scope: !887)
!942 = !DILocation(line: 206, column: 43, scope: !887)
!943 = !{!823, !823, i64 0}
!944 = !DILocation(line: 206, column: 35, scope: !887)
!945 = !DILocation(line: 205, column: 13, scope: !887)
!946 = !DILocation(line: 207, column: 39, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 207, column: 13)
!948 = distinct !DILexicalBlock(scope: !887, file: !3, line: 207, column: 13)
!949 = !DILocation(line: 207, column: 29, scope: !947)
!950 = !DILocation(line: 207, column: 13, scope: !948)
!951 = !DILocation(line: 208, column: 25, scope: !952)
!952 = distinct !DILexicalBlock(scope: !947, file: !3, line: 207, column: 51)
!953 = !DILocation(line: 208, column: 39, scope: !952)
!954 = !DILocation(line: 208, column: 17, scope: !952)
!955 = !DILocation(line: 207, column: 45, scope: !947)
!956 = distinct !{!956, !950, !957, !873}
!957 = !DILocation(line: 209, column: 13, scope: !948)
!958 = !DILocation(line: 210, column: 21, scope: !887)
!959 = !DILocation(line: 210, column: 13, scope: !887)
!960 = !DILocation(line: 211, column: 9, scope: !887)
!961 = !DILocation(line: 212, column: 22, scope: !962)
!962 = distinct !DILexicalBlock(scope: !889, file: !3, line: 212, column: 13)
!963 = !DILocation(line: 212, column: 31, scope: !962)
!964 = !DILocation(line: 212, column: 47, scope: !962)
!965 = !DILocation(line: 212, column: 52, scope: !962)
!966 = !DILocation(line: 212, column: 56, scope: !962)
!967 = !DILocation(line: 212, column: 13, scope: !889)
!968 = !DILocation(line: 213, column: 22, scope: !969)
!969 = distinct !DILexicalBlock(scope: !962, file: !3, line: 212, column: 68)
!970 = !DILocation(line: 213, column: 25, scope: !969)
!971 = !DILocation(line: 213, column: 34, scope: !969)
!972 = !{!929, !865, i64 56}
!973 = !DILocation(line: 214, column: 9, scope: !969)
!974 = !DILocation(line: 216, column: 9, scope: !975)
!975 = distinct !DILexicalBlock(scope: !889, file: !3, line: 216, column: 9)
!976 = !DILocation(line: 218, column: 31, scope: !889)
!977 = !DILocation(line: 218, column: 9, scope: !889)
!978 = !DILocation(line: 219, column: 9, scope: !889)
!979 = !DILocation(line: 220, column: 5, scope: !889)
!980 = !DILocation(line: 221, column: 12, scope: !896)
!981 = !DILocation(line: 221, column: 16, scope: !896)
!982 = !{!864, !865, i64 512}
!983 = !DILocation(line: 222, column: 9, scope: !896)
!984 = !DILocation(line: 223, column: 13, scope: !896)
!985 = !DILocation(line: 224, column: 13, scope: !986)
!986 = distinct !DILexicalBlock(scope: !895, file: !3, line: 223, column: 35)
!987 = !DILocation(line: 224, column: 16, scope: !986)
!988 = !DILocation(line: 224, column: 21, scope: !986)
!989 = !{!864, !865, i64 496}
!990 = !DILocation(line: 225, column: 9, scope: !986)
!991 = !DILocation(line: 225, column: 38, scope: !894)
!992 = !DILocation(line: 225, column: 36, scope: !894)
!993 = !DILocation(line: 225, column: 51, scope: !894)
!994 = !DILocation(line: 225, column: 20, scope: !895)
!995 = !DILocation(line: 226, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !894, file: !3, line: 225, column: 59)
!997 = !DILocation(line: 226, column: 16, scope: !996)
!998 = !DILocation(line: 226, column: 28, scope: !996)
!999 = !{!864, !865, i64 488}
!1000 = !DILocation(line: 227, column: 9, scope: !996)
!1001 = !DILocation(line: 228, column: 55, scope: !893)
!1002 = !DILocation(line: 228, column: 53, scope: !893)
!1003 = !DILocation(line: 0, scope: !893)
!1004 = !DILocation(line: 230, column: 24, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !893, file: !3, line: 230, column: 17)
!1006 = !DILocation(line: 230, column: 17, scope: !893)
!1007 = !DILocation(line: 229, column: 37, scope: !893)
!1008 = !DILocation(line: 231, column: 17, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 230, column: 31)
!1010 = !DILocation(line: 231, column: 33, scope: !1009)
!1011 = !{!865, !865, i64 0}
!1012 = !DILocation(line: 232, column: 13, scope: !1009)
!1013 = !DILocation(line: 233, column: 9, scope: !894)
!1014 = !DILocation(line: 235, column: 5, scope: !875)
!1015 = !DILocation(line: 236, column: 1, scope: !875)
!1016 = distinct !DISubprogram(name: "crawler_expired_doneclass", scope: !3, file: !3, line: 159, type: !689, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DILocalVariable(name: "cm", arg: 1, scope: !1016, file: !3, line: 159, type: !666)
!1019 = !DILocalVariable(name: "slab_cls", arg: 2, scope: !1016, file: !3, line: 159, type: !99)
!1020 = !DILocalVariable(name: "d", scope: !1016, file: !3, line: 160, type: !86)
!1021 = !DILocation(line: 0, scope: !1016)
!1022 = !DILocation(line: 160, column: 74, scope: !1016)
!1023 = !DILocation(line: 161, column: 28, scope: !1016)
!1024 = !DILocation(line: 161, column: 5, scope: !1016)
!1025 = !DILocation(line: 162, column: 42, scope: !1016)
!1026 = !DILocation(line: 162, column: 5, scope: !1016)
!1027 = !DILocation(line: 162, column: 31, scope: !1016)
!1028 = !DILocation(line: 162, column: 40, scope: !1016)
!1029 = !{!864, !825, i64 524}
!1030 = !DILocation(line: 163, column: 31, scope: !1016)
!1031 = !DILocation(line: 163, column: 44, scope: !1016)
!1032 = !DILocation(line: 164, column: 5, scope: !1016)
!1033 = !DILocation(line: 165, column: 1, scope: !1016)
!1034 = distinct !DISubprogram(name: "crawler_expired_finalize", scope: !3, file: !3, line: 167, type: !694, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1035)
!1035 = !{!1036, !1037}
!1036 = !DILocalVariable(name: "cm", arg: 1, scope: !1034, file: !3, line: 167, type: !666)
!1037 = !DILocalVariable(name: "d", scope: !1034, file: !3, line: 168, type: !86)
!1038 = !DILocation(line: 0, scope: !1034)
!1039 = !DILocation(line: 168, column: 74, scope: !1034)
!1040 = !DILocation(line: 169, column: 28, scope: !1034)
!1041 = !DILocation(line: 169, column: 5, scope: !1034)
!1042 = !DILocation(line: 170, column: 19, scope: !1034)
!1043 = !DILocation(line: 170, column: 8, scope: !1034)
!1044 = !DILocation(line: 170, column: 17, scope: !1034)
!1045 = !{!822, !825, i64 137260}
!1046 = !DILocation(line: 171, column: 8, scope: !1034)
!1047 = !DILocation(line: 171, column: 23, scope: !1034)
!1048 = !{!822, !826, i64 137264}
!1049 = !DILocation(line: 172, column: 5, scope: !1034)
!1050 = !DILocation(line: 174, column: 13, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 174, column: 9)
!1052 = !{i8 0, i8 2}
!1053 = !DILocation(line: 174, column: 9, scope: !1034)
!1054 = !DILocation(line: 175, column: 14, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 174, column: 26)
!1056 = !DILocation(line: 175, column: 9, scope: !1055)
!1057 = !DILocation(line: 176, column: 5, scope: !1055)
!1058 = !DILocation(line: 177, column: 1, scope: !1034)
!1059 = distinct !DISubprogram(name: "crawler_metadump_eval", scope: !3, file: !3, line: 238, type: !684, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1069, !1070}
!1061 = !DILocalVariable(name: "cm", arg: 1, scope: !1059, file: !3, line: 238, type: !666)
!1062 = !DILocalVariable(name: "it", arg: 2, scope: !1059, file: !3, line: 238, type: !503)
!1063 = !DILocalVariable(name: "hv", arg: 3, scope: !1059, file: !3, line: 238, type: !551)
!1064 = !DILocalVariable(name: "i", arg: 4, scope: !1059, file: !3, line: 238, type: !99)
!1065 = !DILocalVariable(name: "keybuf", scope: !1059, file: !3, line: 240, type: !1066)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 6008, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 751)
!1069 = !DILocalVariable(name: "is_flushed", scope: !1059, file: !3, line: 241, type: !99)
!1070 = !DILocalVariable(name: "total", scope: !1059, file: !3, line: 250, type: !99)
!1071 = !DILocation(line: 0, scope: !1059)
!1072 = !DILocation(line: 240, column: 5, scope: !1059)
!1073 = !DILocation(line: 240, column: 10, scope: !1059)
!1074 = !DILocation(line: 241, column: 22, scope: !1059)
!1075 = !DILocation(line: 243, column: 14, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 243, column: 9)
!1077 = !DILocation(line: 243, column: 22, scope: !1076)
!1078 = !DILocation(line: 243, column: 27, scope: !1076)
!1079 = !DILocation(line: 243, column: 30, scope: !1076)
