; ModuleID = 'extstore.c'
source_filename = "extstore.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%emit_function_args_ty = type { i32, i32, i32 }
%emit_arcs_args_ty = type { i32, i64* }
%struct.extstore_stats = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, %struct.extstore_page_data* }
%struct.extstore_page_data = type { i64, i64, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.store_io_thread = type { %union.pthread_mutex_t, %union.pthread_cond_t, %struct._obj_io*, %struct._obj_io*, %struct.store_engine*, i32 }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.0, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%struct._obj_io = type { i8*, %struct._obj_io*, i8*, %struct.iovec*, i32, i32, i32, i32, i16, i32, void (i8*, %struct._obj_io*, i32)* }
%struct.iovec = type { i8*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "extstore.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "e0a2fa7a9c9fbf71c06b5dc3bd4287f8")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "obj_io_mode", file: !4, line: 65, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./extstore.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "89218fefe8c4dc299a86fedbd8729747")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "OBJ_IO_READ", value: 0)
!8 = !DIEnumerator(name: "OBJ_IO_WRITE", value: 1)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "extstore_res", file: !4, line: 92, baseType: !5, size: 32, elements: !10)
!10 = !{!11, !12, !13, !14, !15, !16, !17, !18}
!11 = !DIEnumerator(name: "EXTSTORE_INIT_BAD_WBUF_SIZE", value: 1)
!12 = !DIEnumerator(name: "EXTSTORE_INIT_NEED_MORE_WBUF", value: 2)
!13 = !DIEnumerator(name: "EXTSTORE_INIT_NEED_MORE_BUCKETS", value: 3)
!14 = !DIEnumerator(name: "EXTSTORE_INIT_PAGE_WBUF_ALIGNMENT", value: 4)
!15 = !DIEnumerator(name: "EXTSTORE_INIT_TOO_MANY_PAGES", value: 5)
!16 = !DIEnumerator(name: "EXTSTORE_INIT_OOM", value: 6)
!17 = !DIEnumerator(name: "EXTSTORE_INIT_OPEN_FAIL", value: 7)
!18 = !DIEnumerator(name: "EXTSTORE_INIT_THREAD_FAIL", value: 8)
!19 = !{!20, !108, !85, !133, !183}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "store_engine", file: !1, line: 76, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "store_engine", file: !1, line: 92, size: 2624, elements: !23)
!23 = !{!24, !57, !101, !102, !132, !182, !190, !191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !22, file: !1, line: 93, baseType: !25, size: 320)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !26, line: 72, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 67, size: 320, elements: !28)
!28 = !{!29, !50, !55}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !27, file: !26, line: 69, baseType: !30, size: 320)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !31, line: 22, size: 320, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!32 = !{!33, !35, !36, !37, !38, !39, !41, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !30, file: !31, line: 24, baseType: !34, size: 32)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !30, file: !31, line: 25, baseType: !5, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !30, file: !31, line: 26, baseType: !34, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !30, file: !31, line: 28, baseType: !5, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !30, file: !31, line: 32, baseType: !34, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !30, file: !31, line: 34, baseType: !40, size: 16, offset: 160)
!40 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !30, file: !31, line: 35, baseType: !40, size: 16, offset: 176)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !30, file: !31, line: 36, baseType: !43, size: 128, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !44, line: 53, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !44, line: 49, size: 128, elements: !46)
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !45, file: !44, line: 51, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !45, file: !44, line: 52, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !27, file: !26, line: 70, baseType: !51, size: 320)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 320, elements: !53)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !{!54}
!54 = !DISubrange(count: 40)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !27, file: !26, line: 71, baseType: !56, size: 64)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !22, file: !1, line: 94, baseType: !58, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "store_page", file: !1, line: 74, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_store_page", file: !1, line: 56, size: 960, elements: !61)
!61 = !{!62, !63, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !80, !82, !83, !84, !99}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !60, file: !1, line: 57, baseType: !25, size: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "obj_count", scope: !60, file: !1, line: 58, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !65, line: 27, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !67, line: 45, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!68 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !60, file: !1, line: 59, baseType: !64, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !60, file: !1, line: 60, baseType: !64, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !60, file: !1, line: 61, baseType: !5, size: 32, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !60, file: !1, line: 62, baseType: !5, size: 32, offset: 544)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !60, file: !1, line: 63, baseType: !5, size: 32, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !60, file: !1, line: 64, baseType: !5, size: 32, offset: 608)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !60, file: !1, line: 65, baseType: !5, size: 32, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "free_bucket", scope: !60, file: !1, line: 66, baseType: !5, size: 32, offset: 672)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !60, file: !1, line: 67, baseType: !34, size: 32, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !1, line: 68, baseType: !79, size: 16, offset: 736)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !60, file: !1, line: 69, baseType: !81, size: 8, offset: 752)
!81 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !60, file: !1, line: 70, baseType: !81, size: 8, offset: 760)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !60, file: !1, line: 71, baseType: !81, size: 8, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !60, file: !1, line: 72, baseType: !85, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_store_wbuf", file: !1, line: 54, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__store_wbuf", file: !1, line: 45, size: 320, elements: !88)
!88 = !{!89, !91, !93, !94, !95, !96, !97, !98}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !1, line: 46, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !87, file: !1, line: 47, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !87, file: !1, line: 48, baseType: !92, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !87, file: !1, line: 49, baseType: !5, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !1, line: 50, baseType: !5, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !87, file: !1, line: 51, baseType: !5, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !87, file: !1, line: 52, baseType: !81, size: 8, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !87, file: !1, line: 53, baseType: !81, size: 8, offset: 296)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !1, line: 73, baseType: !100, size: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf_stack", scope: !22, file: !1, line: 95, baseType: !85, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "io_stack", scope: !22, file: !1, line: 96, baseType: !103, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "obj_io", file: !4, line: 70, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obj_io", file: !4, line: 77, size: 512, elements: !106)
!106 = !{!107, !109, !111, !112, !121, !122, !123, !124, !125, !126, !127}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !4, line: 78, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !4, line: 79, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !105, file: !4, line: 80, baseType: !92, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !105, file: !4, line: 81, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !115, line: 26, size: 128, elements: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !114, file: !115, line: 28, baseType: !108, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !114, file: !115, line: 29, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !68)
!120 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !105, file: !4, line: 82, baseType: !5, size: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "page_version", scope: !105, file: !4, line: 83, baseType: !5, size: 32, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !105, file: !4, line: 84, baseType: !5, size: 32, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !105, file: !4, line: 85, baseType: !5, size: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "page_id", scope: !105, file: !4, line: 86, baseType: !79, size: 16, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !4, line: 87, baseType: !3, size: 32, offset: 416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !105, file: !4, line: 89, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "obj_io_cb", file: !4, line: 71, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !108, !103, !34}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "io_threads", scope: !22, file: !1, line: 97, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "store_io_thread", file: !1, line: 84, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 77, size: 960, elements: !136)
!136 = !{!137, !138, !178, !179, !180, !181}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !135, file: !1, line: 78, baseType: !25, size: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !135, file: !1, line: 79, baseType: !139, size: 384, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !26, line: 80, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 75, size: 384, elements: !141)
!141 = !{!142, !172, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !140, file: !26, line: 77, baseType: !143, size: 384)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !44, line: 92, size: 384, elements: !144)
!144 = !{!145, !155, !164, !168, !169, !170, !171}
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !44, line: 94, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !44, line: 94, size: 64, elements: !147)
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !146, file: !44, line: 96, baseType: !149, size: 64)
!149 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !146, file: !44, line: 101, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !146, file: !44, line: 97, size: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !151, file: !44, line: 99, baseType: !5, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !151, file: !44, line: 100, baseType: !5, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !44, line: 103, baseType: !156, size: 64, offset: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !44, line: 103, size: 64, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !156, file: !44, line: 105, baseType: !149, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !156, file: !44, line: 110, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !44, line: 106, size: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !160, file: !44, line: 108, baseType: !5, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !160, file: !44, line: 109, baseType: !5, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !143, file: !44, line: 112, baseType: !165, size: 64, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 2)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !143, file: !44, line: 113, baseType: !165, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !143, file: !44, line: 114, baseType: !5, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !143, file: !44, line: 115, baseType: !5, size: 32, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !143, file: !44, line: 116, baseType: !165, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !140, file: !26, line: 78, baseType: !173, size: 384)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 384, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 48)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !140, file: !26, line: 79, baseType: !177, size: 64)
!177 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !135, file: !1, line: 80, baseType: !103, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "queue_tail", scope: !135, file: !1, line: 81, baseType: !103, size: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !135, file: !1, line: 82, baseType: !20, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !135, file: !1, line: 83, baseType: !5, size: 32, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "maint_thread", scope: !22, file: !1, line: 98, baseType: !183, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "store_maint_thread", file: !1, line: 90, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 86, size: 768, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !185, file: !1, line: 87, baseType: !25, size: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !185, file: !1, line: 88, baseType: !139, size: 384, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !185, file: !1, line: 89, baseType: !20, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "page_freelist", scope: !22, file: !1, line: 99, baseType: !58, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "page_buckets", scope: !22, file: !1, line: 100, baseType: !192, size: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "free_page_buckets", scope: !22, file: !1, line: 101, baseType: !192, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !22, file: !1, line: 102, baseType: !119, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !1, line: 103, baseType: !5, size: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_io_thread", scope: !22, file: !1, line: 104, baseType: !5, size: 32, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "io_threadcount", scope: !22, file: !1, line: 105, baseType: !5, size: 32, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "page_count", scope: !22, file: !1, line: 106, baseType: !5, size: 32, offset: 992)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "page_free", scope: !22, file: !1, line: 107, baseType: !5, size: 32, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "page_bucketcount", scope: !22, file: !1, line: 108, baseType: !5, size: 32, offset: 1056)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "free_page_bucketcount", scope: !22, file: !1, line: 109, baseType: !5, size: 32, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "io_depth", scope: !22, file: !1, line: 110, baseType: !5, size: 32, offset: 1120)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "stats_mutex", scope: !22, file: !1, line: 111, baseType: !25, size: 320, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !22, file: !1, line: 112, baseType: !205, size: 1152, offset: 1472)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_stats", file: !4, line: 20, size: 1152, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "page_allocs", scope: !205, file: !4, line: 21, baseType: !64, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "page_count", scope: !205, file: !4, line: 22, baseType: !64, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "page_evictions", scope: !205, file: !4, line: 23, baseType: !64, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "page_reclaims", scope: !205, file: !4, line: 24, baseType: !64, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !205, file: !4, line: 25, baseType: !64, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pages_free", scope: !205, file: !4, line: 26, baseType: !64, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pages_used", scope: !205, file: !4, line: 27, baseType: !64, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "objects_evicted", scope: !205, file: !4, line: 28, baseType: !64, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "objects_read", scope: !205, file: !4, line: 29, baseType: !64, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "objects_written", scope: !205, file: !4, line: 30, baseType: !64, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "objects_used", scope: !205, file: !4, line: 31, baseType: !64, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_evicted", scope: !205, file: !4, line: 32, baseType: !64, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !205, file: !4, line: 33, baseType: !64, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !205, file: !4, line: 34, baseType: !64, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !205, file: !4, line: 35, baseType: !64, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_fragmented", scope: !205, file: !4, line: 36, baseType: !64, size: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue", scope: !205, file: !4, line: 37, baseType: !64, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "page_data", scope: !205, file: !4, line: 38, baseType: !225, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_page_data", file: !4, line: 7, size: 192, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !226, file: !4, line: 8, baseType: !64, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !226, file: !4, line: 9, baseType: !64, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !226, file: !4, line: 10, baseType: !5, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "free_bucket", scope: !226, file: !4, line: 11, baseType: !5, size: 32, offset: 160)
!232 = !{i32 7, !"Dwarf Version", i32 5}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{i32 1, !"wchar_size", i32 4}
!235 = !{i32 7, !"uwtable", i32 1}
!236 = !{!"/home/xuheng/blackbox/llvm-test/memcached/extstore.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/extstore.gcda", !0}
!237 = !{!"clang version 14.0.0"}
!238 = distinct !DISubprogram(name: "extstore_get_stats", scope: !1, file: !1, line: 159, type: !239, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !242)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !108, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!242 = !{!243, !244, !245, !246}
!243 = !DILocalVariable(name: "ptr", arg: 1, scope: !238, file: !1, line: 159, type: !108)
!244 = !DILocalVariable(name: "st", arg: 2, scope: !238, file: !1, line: 159, type: !241)
!245 = !DILocalVariable(name: "e", scope: !238, file: !1, line: 160, type: !20)
!246 = !DILocalVariable(name: "x", scope: !247, file: !1, line: 171, type: !34)
!247 = distinct !DILexicalBlock(scope: !238, file: !1, line: 171, column: 5)
!248 = !DILocation(line: 0, scope: !238)
!249 = !DILocation(line: 161, column: 5, scope: !238)
!250 = !DILocation(line: 162, column: 12, scope: !238)
!251 = !DILocation(line: 162, column: 20, scope: !238)
!252 = !DILocation(line: 162, column: 5, scope: !238)
!253 = !DILocation(line: 163, column: 5, scope: !238)
!254 = !DILocation(line: 166, column: 28, scope: !238)
!255 = !DILocation(line: 166, column: 5, scope: !238)
!256 = !DILocation(line: 167, column: 25, scope: !238)
!257 = !{!258, !263, i64 128}
!258 = !{!"store_engine", !259, i64 0, !261, i64 40, !261, i64 48, !261, i64 56, !261, i64 64, !261, i64 72, !261, i64 80, !261, i64 88, !261, i64 96, !262, i64 104, !263, i64 112, !263, i64 116, !263, i64 120, !263, i64 124, !263, i64 128, !263, i64 132, !263, i64 136, !263, i64 140, !259, i64 144, !264, i64 184}
!259 = !{!"omnipotent char", !260, i64 0}
!260 = !{!"Simple C/C++ TBAA"}
!261 = !{!"any pointer", !259, i64 0}
!262 = !{!"long", !259, i64 0}
!263 = !{!"int", !259, i64 0}
!264 = !{!"extstore_stats", !262, i64 0, !262, i64 8, !262, i64 16, !262, i64 24, !262, i64 32, !262, i64 40, !262, i64 48, !262, i64 56, !262, i64 64, !262, i64 72, !262, i64 80, !262, i64 88, !262, i64 96, !262, i64 104, !262, i64 112, !262, i64 120, !262, i64 128, !261, i64 136}
!265 = !DILocation(line: 167, column: 22, scope: !238)
!266 = !DILocation(line: 167, column: 9, scope: !238)
!267 = !DILocation(line: 167, column: 20, scope: !238)
!268 = !{!264, !262, i64 40}
!269 = !DILocation(line: 168, column: 25, scope: !238)
!270 = !{!258, !263, i64 124}
!271 = !DILocation(line: 168, column: 36, scope: !238)
!272 = !DILocation(line: 168, column: 22, scope: !238)
!273 = !DILocation(line: 168, column: 9, scope: !238)
!274 = !DILocation(line: 168, column: 20, scope: !238)
!275 = !{!264, !262, i64 48}
!276 = !DILocation(line: 169, column: 5, scope: !238)
!277 = !DILocation(line: 170, column: 9, scope: !238)
!278 = !DILocation(line: 170, column: 18, scope: !238)
!279 = !{!264, !262, i64 128}
!280 = !DILocation(line: 0, scope: !247)
!281 = !DILocation(line: 171, column: 28, scope: !282)
!282 = distinct !DILexicalBlock(scope: !247, file: !1, line: 171, column: 5)
!283 = !{!258, !263, i64 120}
!284 = !DILocation(line: 171, column: 23, scope: !282)
!285 = !DILocation(line: 171, column: 5, scope: !247)
!286 = !DILocation(line: 171, column: 5, scope: !282)
!287 = !DILocation(line: 178, column: 32, scope: !238)
!288 = !DILocation(line: 178, column: 48, scope: !238)
!289 = !{!258, !262, i64 104}
!290 = !DILocation(line: 178, column: 43, scope: !238)
!291 = !DILocation(line: 179, column: 13, scope: !238)
!292 = !{!264, !262, i64 112}
!293 = !DILocation(line: 178, column: 58, scope: !238)
!294 = !DILocation(line: 178, column: 9, scope: !238)
!295 = !DILocation(line: 178, column: 26, scope: !238)
!296 = !{!264, !262, i64 120}
!297 = !DILocation(line: 180, column: 1, scope: !238)
!298 = !DILocation(line: 172, column: 32, scope: !299)
!299 = distinct !DILexicalBlock(scope: !282, file: !1, line: 171, column: 49)
!300 = !{!258, !261, i64 64}
!301 = !DILocation(line: 172, column: 46, scope: !299)
!302 = !DILocation(line: 172, column: 9, scope: !299)
!303 = !DILocation(line: 173, column: 28, scope: !299)
!304 = !DILocation(line: 173, column: 42, scope: !299)
!305 = !{!306, !263, i64 112}
!306 = !{!"", !259, i64 0, !259, i64 40, !261, i64 88, !261, i64 96, !261, i64 104, !263, i64 112}
!307 = !DILocation(line: 173, column: 25, scope: !299)
!308 = !DILocation(line: 173, column: 22, scope: !299)
!309 = !DILocation(line: 174, column: 48, scope: !299)
!310 = !DILocation(line: 174, column: 9, scope: !299)
!311 = !DILocation(line: 171, column: 45, scope: !282)
!312 = distinct !{!312, !285, !313, !314}
!313 = !DILocation(line: 175, column: 5, scope: !247)
!314 = !{!"llvm.loop.mustprogress"}
!315 = !DISubprogram(name: "pthread_mutex_lock", scope: !316, file: !316, line: 738, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !320)
!316 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!317 = !DISubroutineType(types: !318)
!318 = !{!34, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!320 = !{}
!321 = !DISubprogram(name: "memcpy", scope: !322, file: !322, line: 43, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !320)
!322 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!323 = !DISubroutineType(types: !324)
!324 = !{!108, !325, !326, !119}
!325 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!326 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!329 = !DISubprogram(name: "pthread_mutex_unlock", scope: !316, file: !316, line: 756, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !320)
!330 = distinct !DISubprogram(name: "extstore_get_page_data", scope: !1, file: !1, line: 182, type: !239, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !331)
!331 = !{!332, !333, !334}
!332 = !DILocalVariable(name: "ptr", arg: 1, scope: !330, file: !1, line: 182, type: !108)
!333 = !DILocalVariable(name: "st", arg: 2, scope: !330, file: !1, line: 182, type: !241)
!334 = !DILocalVariable(name: "e", scope: !330, file: !1, line: 183, type: !20)
!335 = !DILocation(line: 0, scope: !330)
!336 = !DILocation(line: 184, column: 5, scope: !330)
!337 = !DILocation(line: 185, column: 16, scope: !330)
!338 = !{!264, !261, i64 136}
!339 = !DILocation(line: 185, column: 36, scope: !330)
!340 = !{!258, !261, i64 320}
!341 = !DILocation(line: 186, column: 52, scope: !330)
!342 = !DILocation(line: 186, column: 49, scope: !330)
!343 = !DILocation(line: 186, column: 47, scope: !330)
!344 = !DILocation(line: 185, column: 5, scope: !330)
!345 = !DILocation(line: 187, column: 5, scope: !330)
!346 = !DILocation(line: 188, column: 1, scope: !330)
!347 = distinct !DISubprogram(name: "extstore_err", scope: !1, file: !1, line: 190, type: !348, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !352)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !9}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "res", arg: 1, scope: !347, file: !1, line: 190, type: !9)
!354 = !DILocalVariable(name: "rv", scope: !347, file: !1, line: 191, type: !350)
!355 = !DILocation(line: 0, scope: !347)
!356 = !DILocation(line: 192, column: 5, scope: !347)
!357 = !DILocation(line: 194, column: 16, scope: !358)
!358 = distinct !DILexicalBlock(scope: !347, file: !1, line: 192, column: 18)
!359 = !DILocation(line: 195, column: 13, scope: !358)
!360 = !DILocation(line: 197, column: 16, scope: !358)
!361 = !DILocation(line: 198, column: 13, scope: !358)
!362 = !DILocation(line: 200, column: 16, scope: !358)
!363 = !DILocation(line: 201, column: 13, scope: !358)
!364 = !DILocation(line: 203, column: 16, scope: !358)
!365 = !DILocation(line: 204, column: 13, scope: !358)
!366 = !DILocation(line: 206, column: 16, scope: !358)
!367 = !DILocation(line: 207, column: 13, scope: !358)
!368 = !DILocation(line: 209, column: 16, scope: !358)
!369 = !DILocation(line: 210, column: 13, scope: !358)
!370 = !DILocation(line: 212, column: 16, scope: !358)
!371 = !DILocation(line: 213, column: 13, scope: !358)
!372 = !DILocation(line: 217, column: 5, scope: !347)
!373 = distinct !DISubprogram(name: "extstore_init", scope: !1, file: !1, line: 221, type: !374, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !398)
!374 = !DISubroutineType(types: !375)
!375 = !{!108, !376, !386, !397}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_conf_file", file: !4, line: 55, size: 384, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "page_count", scope: !377, file: !4, line: 56, baseType: !5, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !377, file: !4, line: 57, baseType: !92, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !377, file: !4, line: 58, baseType: !34, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !377, file: !4, line: 59, baseType: !64, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !377, file: !4, line: 60, baseType: !5, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "free_bucket", scope: !377, file: !4, line: 61, baseType: !5, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !4, line: 62, baseType: !376, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_conf", file: !4, line: 44, size: 256, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !387, file: !4, line: 45, baseType: !5, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "page_count", scope: !387, file: !4, line: 46, baseType: !5, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "page_buckets", scope: !387, file: !4, line: 47, baseType: !5, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "free_page_buckets", scope: !387, file: !4, line: 48, baseType: !5, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf_size", scope: !387, file: !4, line: 49, baseType: !5, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf_count", scope: !387, file: !4, line: 50, baseType: !5, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "io_threadcount", scope: !387, file: !4, line: 51, baseType: !5, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "io_depth", scope: !387, file: !4, line: 52, baseType: !5, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!398 = !{!399, !400, !401, !402, !403, !404, !406, !407, !408, !422, !428, !432}
!399 = !DILocalVariable(name: "fh", arg: 1, scope: !373, file: !1, line: 221, type: !376)
!400 = !DILocalVariable(name: "cf", arg: 2, scope: !373, file: !1, line: 221, type: !386)
!401 = !DILocalVariable(name: "res", arg: 3, scope: !373, file: !1, line: 222, type: !397)
!402 = !DILocalVariable(name: "i", scope: !373, file: !1, line: 223, type: !34)
!403 = !DILocalVariable(name: "f", scope: !373, file: !1, line: 224, type: !376)
!404 = !DILocalVariable(name: "thread", scope: !373, file: !1, line: 225, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !26, line: 27, baseType: !68)
!406 = !DILocalVariable(name: "e", scope: !373, file: !1, line: 248, type: !20)
!407 = !DILocalVariable(name: "temp_page_count", scope: !373, file: !1, line: 255, type: !64)
!408 = !DILocalVariable(name: "lock", scope: !409, file: !1, line: 267, type: !412)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 256, column: 42)
!410 = distinct !DILexicalBlock(scope: !411, file: !1, line: 256, column: 5)
!411 = distinct !DILexicalBlock(scope: !373, file: !1, line: 256, column: 5)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flock", file: !413, line: 35, size: 256, elements: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "de7230bc4c2eecad91b473306f6d8225")
!414 = !{!415, !416, !417, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !412, file: !413, line: 37, baseType: !40, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "l_whence", scope: !412, file: !413, line: 38, baseType: !40, size: 16, offset: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_start", scope: !412, file: !413, line: 40, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 152, baseType: !56)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_len", scope: !412, file: !413, line: 41, baseType: !418, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "l_pid", scope: !412, file: !413, line: 46, baseType: !421, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !67, line: 154, baseType: !34)
!422 = !DILocalVariable(name: "fb", scope: !423, file: !1, line: 337, type: !34)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 336, column: 16)
!424 = distinct !DILexicalBlock(scope: !425, file: !1, line: 333, column: 13)
!425 = distinct !DILexicalBlock(scope: !426, file: !1, line: 331, column: 43)
!426 = distinct !DILexicalBlock(scope: !427, file: !1, line: 331, column: 5)
!427 = distinct !DILexicalBlock(scope: !373, file: !1, line: 331, column: 5)
!428 = !DILocalVariable(name: "w", scope: !429, file: !1, line: 359, type: !85)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 358, column: 42)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 358, column: 5)
!431 = distinct !DILexicalBlock(scope: !373, file: !1, line: 358, column: 5)
!432 = !DILocalVariable(name: "io", scope: !429, file: !1, line: 360, type: !103)
!433 = !DILocation(line: 0, scope: !373)
!434 = !DILocation(line: 225, column: 5, scope: !373)
!435 = !DILocation(line: 227, column: 13, scope: !436)
!436 = distinct !DILexicalBlock(scope: !373, file: !1, line: 227, column: 9)
!437 = !{!438, !263, i64 0}
!438 = !{!"extstore_conf", !263, i64 0, !263, i64 4, !263, i64 8, !263, i64 12, !263, i64 16, !263, i64 20, !263, i64 24, !263, i64 28}
!439 = !DILocation(line: 227, column: 29, scope: !436)
!440 = !{!438, !263, i64 16}
!441 = !DILocation(line: 227, column: 23, scope: !436)
!442 = !DILocation(line: 227, column: 39, scope: !436)
!443 = !DILocation(line: 227, column: 9, scope: !373)
!444 = !DILocation(line: 228, column: 10, scope: !445)
!445 = distinct !DILexicalBlock(scope: !436, file: !1, line: 227, column: 45)
!446 = !DILocation(line: 228, column: 14, scope: !445)
!447 = !{!259, !259, i64 0}
!448 = !DILocation(line: 229, column: 9, scope: !445)
!449 = !DILocation(line: 232, column: 13, scope: !450)
!450 = distinct !DILexicalBlock(scope: !373, file: !1, line: 232, column: 9)
!451 = !{!438, !263, i64 8}
!452 = !DILocation(line: 232, column: 32, scope: !450)
!453 = !{!438, !263, i64 20}
!454 = !DILocation(line: 232, column: 26, scope: !450)
!455 = !DILocation(line: 232, column: 9, scope: !373)
!456 = !DILocation(line: 233, column: 10, scope: !457)
!457 = distinct !DILexicalBlock(scope: !450, file: !1, line: 232, column: 44)
!458 = !DILocation(line: 233, column: 14, scope: !457)
!459 = !DILocation(line: 234, column: 9, scope: !457)
!460 = !DILocation(line: 236, column: 26, scope: !461)
!461 = distinct !DILexicalBlock(scope: !373, file: !1, line: 236, column: 9)
!462 = !DILocation(line: 236, column: 9, scope: !373)
!463 = !DILocation(line: 237, column: 10, scope: !464)
!464 = distinct !DILexicalBlock(scope: !461, file: !1, line: 236, column: 31)
!465 = !DILocation(line: 237, column: 14, scope: !464)
!466 = !DILocation(line: 238, column: 9, scope: !464)
!467 = !DILocation(line: 242, column: 23, scope: !468)
!468 = distinct !DILexicalBlock(scope: !373, file: !1, line: 242, column: 9)
!469 = !DILocation(line: 242, column: 43, scope: !468)
!470 = !DILocation(line: 242, column: 48, scope: !468)
!471 = !DILocation(line: 243, column: 9, scope: !468)
!472 = !DILocation(line: 243, column: 13, scope: !468)
!473 = !DILocation(line: 243, column: 23, scope: !468)
!474 = !DILocation(line: 243, column: 43, scope: !468)
!475 = !DILocation(line: 242, column: 9, scope: !373)
!476 = !DILocation(line: 244, column: 10, scope: !477)
!477 = distinct !DILexicalBlock(scope: !468, file: !1, line: 243, column: 49)
!478 = !DILocation(line: 244, column: 14, scope: !477)
!479 = !DILocation(line: 245, column: 9, scope: !477)
!480 = !DILocation(line: 248, column: 23, scope: !373)
!481 = !DILocation(line: 249, column: 11, scope: !482)
!482 = distinct !DILexicalBlock(scope: !373, file: !1, line: 249, column: 9)
!483 = !DILocation(line: 249, column: 9, scope: !373)
