; ModuleID = 'logger.c'
source_filename = "logger.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.0, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%struct._logger = type { %struct._logger*, %struct._logger*, %union.pthread_mutex_t, i64, i64, i64, i16, i16, i16, %struct.bipbuf_t*, %struct._entry_details* }
%struct.bipbuf_t = type { i64, i32, i32, i32, i32, [0 x i8] }
%struct._entry_details = type { i32, i16, void (%struct._logentry*, %struct._entry_details*, i8*, %struct.__va_list_tag*)*, i32 (%struct._logentry*, i8*)*, i8* }
%struct._logentry = type { i32, i8, i16, i64, %struct.timeval, i32, [0 x %union.anon.2] }
%struct.timeval = type { i64, i64 }
%union.anon.2 = type { i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!16 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!17 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!18 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!19 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!20 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!21 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!22 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!23 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_ret_type", file: !6, line: 44, baseType: !7, size: 32, elements: !25)
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "LOGGER_RET_OK", value: 0)
!27 = !DIEnumerator(name: "LOGGER_RET_NOSPACE", value: 1)
!28 = !DIEnumerator(name: "LOGGER_RET_ERR", value: 2)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_add_watcher_ret", file: !6, line: 218, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_TOO_MANY", value: 0)
!32 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_OK", value: 1)
!33 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_FAILED", value: 2)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_watcher_type", file: !6, line: 173, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "LOGGER_WATCHER_STDERR", value: 0)
!37 = !DIEnumerator(name: "LOGGER_WATCHER_CLIENT", value: 1)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_parse_entry_ret", file: !6, line: 50, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "LOGGER_PARSE_ENTRY_OK", value: 0)
!41 = !DIEnumerator(name: "LOGGER_PARSE_ENTRY_FULLBUF", value: 1)
!42 = !DIEnumerator(name: "LOGGER_PARSE_ENTRY_FAILED", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "conn_states", file: !44, line: 199, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!46 = !DIEnumerator(name: "conn_listening", value: 0)
!47 = !DIEnumerator(name: "conn_new_cmd", value: 1)
!48 = !DIEnumerator(name: "conn_waiting", value: 2)
!49 = !DIEnumerator(name: "conn_read", value: 3)
!50 = !DIEnumerator(name: "conn_parse_cmd", value: 4)
!51 = !DIEnumerator(name: "conn_write", value: 5)
!52 = !DIEnumerator(name: "conn_nread", value: 6)
!53 = !DIEnumerator(name: "conn_swallow", value: 7)
!54 = !DIEnumerator(name: "conn_closing", value: 8)
!55 = !DIEnumerator(name: "conn_mwrite", value: 9)
!56 = !DIEnumerator(name: "conn_closed", value: 10)
!57 = !DIEnumerator(name: "conn_watch", value: 11)
!58 = !DIEnumerator(name: "conn_io_queue", value: 12)
!59 = !DIEnumerator(name: "conn_max_state", value: 13)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bin_substates", file: !44, line: 216, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!62 = !DIEnumerator(name: "bin_no_state", value: 0)
!63 = !DIEnumerator(name: "bin_reading_set_header", value: 1)
!64 = !DIEnumerator(name: "bin_reading_cas_header", value: 2)
!65 = !DIEnumerator(name: "bin_read_set_value", value: 3)
!66 = !DIEnumerator(name: "bin_reading_get_key", value: 4)
!67 = !DIEnumerator(name: "bin_reading_stat", value: 5)
!68 = !DIEnumerator(name: "bin_reading_del_header", value: 6)
!69 = !DIEnumerator(name: "bin_reading_incr_header", value: 7)
!70 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!71 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!72 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!73 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !44, line: 231, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "ascii_prot", value: 3)
!77 = !DIEnumerator(name: "binary_prot", value: 4)
!78 = !DIEnumerator(name: "negotiating_prot", value: 5)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !44, line: 240, baseType: !7, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "local_transport", value: 0)
!82 = !DIEnumerator(name: "tcp_transport", value: 1)
!83 = !DIEnumerator(name: "udp_transport", value: 2)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !44, line: 259, baseType: !7, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!87 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!88 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!89 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "store_item_type", file: !44, line: 276, baseType: !7, size: 32, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DIEnumerator(name: "NOT_STORED", value: 0)
!93 = !DIEnumerator(name: "STORED", value: 1)
!94 = !DIEnumerator(name: "EXISTS", value: 2)
!95 = !DIEnumerator(name: "NOT_FOUND", value: 3)
!96 = !DIEnumerator(name: "TOO_LARGE", value: 4)
!97 = !DIEnumerator(name: "NO_MEMORY", value: 5)
!98 = !{!99, !100, !138, !139, !140, !141, !129, !494, !646, !650, !658, !667, !678, !685, !697, !113, !698, !106}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !6, line: 56, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !6, line: 135, size: 320, elements: !103)
!103 = !{!104, !105, !111, !115, !119, !128, !130}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !102, file: !6, line: 136, baseType: !5, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !102, file: !6, line: 137, baseType: !106, size: 8, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !107, line: 24, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !109, line: 38, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!110 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !102, file: !6, line: 138, baseType: !112, size: 16, offset: 48)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !107, line: 25, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !109, line: 40, baseType: !114)
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !102, file: !6, line: 139, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !107, line: 27, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !109, line: 45, baseType: !118)
!118 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !102, file: !6, line: 140, baseType: !120, size: 128, offset: 128)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !121, line: 8, size: 128, elements: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!122 = !{!123, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !120, file: !121, line: 10, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !109, line: 160, baseType: !125)
!125 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !120, file: !121, line: 11, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !109, line: 162, baseType: !125)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !6, line: 141, baseType: !129, size: 32, offset: 256)
!129 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !6, line: 144, baseType: !131, offset: 288)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, elements: !136)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !6, line: 142, size: 8, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !132, file: !6, line: 143, baseType: !135, size: 8)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!136 = !{!137}
!137 = !DISubrange(count: -1)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!140 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !44, line: 781, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !44, line: 794, size: 3968, elements: !144)
!144 = !{!145, !149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !162, !238, !239, !240, !241, !242, !243, !244, !569, !570, !571, !572, !573, !574, !575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !591, !612, !613, !614, !615, !616, !617, !618, !619, !623, !630, !645}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !143, file: !44, line: 795, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !148, line: 16, baseType: !99)
!148 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !143, file: !44, line: 796, baseType: !129, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !143, file: !44, line: 797, baseType: !151, size: 8, offset: 96)
!151 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !143, file: !44, line: 798, baseType: !151, size: 8, offset: 104)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !143, file: !44, line: 799, baseType: !151, size: 8, offset: 112)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !143, file: !44, line: 800, baseType: !151, size: 8, offset: 120)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !143, file: !44, line: 801, baseType: !151, size: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !143, file: !44, line: 802, baseType: !151, size: 8, offset: 136)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !143, file: !44, line: 803, baseType: !151, size: 8, offset: 144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !143, file: !44, line: 809, baseType: !43, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !143, file: !44, line: 810, baseType: !60, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !143, file: !44, line: 811, baseType: !161, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !6, line: 14, baseType: !7)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !143, file: !44, line: 812, baseType: !163, size: 1024, offset: 256)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !164, line: 123, size: 1024, elements: !165)
!164 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!165 = !{!166, !198, !208, !209, !212, !235, !236, !237}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !163, file: !164, line: 124, baseType: !167, size: 320)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !164, line: 107, size: 320, elements: !168)
!168 = !{!169, !176, !178, !179, !180, !197}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !167, file: !164, line: 108, baseType: !170, size: 128)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !167, file: !164, line: 108, size: 128, elements: !171)
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !170, file: !164, line: 108, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !170, file: !164, line: 108, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !167, file: !164, line: 109, baseType: !177, size: 16, offset: 128)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !167, file: !164, line: 110, baseType: !106, size: 8, offset: 144)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !167, file: !164, line: 111, baseType: !106, size: 8, offset: 152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !167, file: !164, line: 118, baseType: !181, size: 64, offset: 192)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !167, file: !164, line: 113, size: 64, elements: !182)
!182 = !{!183, !187, !191, !196}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !181, file: !164, line: 114, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !129, !177, !99}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !181, file: !164, line: 115, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !173, !99}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !181, file: !164, line: 116, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195, !99}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !181, file: !164, line: 117, baseType: !188, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !167, file: !164, line: 119, baseType: !99, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !163, file: !164, line: 130, baseType: !199, size: 128, offset: 320)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 127, size: 128, elements: !200)
!200 = !{!201, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !199, file: !164, line: 128, baseType: !202, size: 128)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !164, line: 128, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !202, file: !164, line: 128, baseType: !195, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !202, file: !164, line: 128, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !199, file: !164, line: 129, baseType: !129, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !163, file: !164, line: 131, baseType: !129, size: 32, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !163, file: !164, line: 133, baseType: !210, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !164, line: 122, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !163, file: !164, line: 149, baseType: !213, size: 256, offset: 576)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 135, size: 256, elements: !214)
!214 = !{!215, !224}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !213, file: !164, line: 140, baseType: !216, size: 256)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !164, line: 137, size: 256, elements: !217)
!217 = !{!218, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !216, file: !164, line: 138, baseType: !219, size: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !164, line: 138, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !219, file: !164, line: 138, baseType: !195, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !219, file: !164, line: 138, baseType: !206, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !216, file: !164, line: 139, baseType: !120, size: 128, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !213, file: !164, line: 148, baseType: !225, size: 256)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !164, line: 143, size: 256, elements: !226)
!226 = !{!227, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !225, file: !164, line: 144, baseType: !228, size: 128)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !164, line: 144, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !228, file: !164, line: 144, baseType: !195, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !228, file: !164, line: 144, baseType: !206, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !225, file: !164, line: 145, baseType: !177, size: 16, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !225, file: !164, line: 147, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !163, file: !164, line: 151, baseType: !177, size: 16, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !163, file: !164, line: 152, baseType: !177, size: 16, offset: 848)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !163, file: !164, line: 153, baseType: !120, size: 128, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !143, file: !44, line: 813, baseType: !177, size: 16, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !143, file: !44, line: 814, baseType: !177, size: 16, offset: 1296)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !143, file: !44, line: 816, baseType: !139, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !143, file: !44, line: 817, baseType: !139, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !143, file: !44, line: 818, baseType: !129, size: 32, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !143, file: !44, line: 819, baseType: !129, size: 32, offset: 1504)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !143, file: !44, line: 821, baseType: !245, size: 64, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !44, line: 770, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !44, line: 743, size: 9472, elements: !248)
!248 = !{!249, !261, !263, !264, !265, !266, !493, !515, !524, !525, !526, !527, !528, !529, !530, !531, !532, !561, !565}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !247, file: !44, line: 744, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !44, line: 703, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !44, line: 773, size: 192, elements: !253)
!253 = !{!254, !255, !256, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !252, file: !44, line: 774, baseType: !106, size: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !252, file: !44, line: 775, baseType: !106, size: 8, offset: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !44, line: 776, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !252, file: !44, line: 777, baseType: !257, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !252, file: !44, line: 778, baseType: !260, offset: 192)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, elements: !136)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !44, line: 745, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !247, file: !44, line: 746, baseType: !129, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !247, file: !44, line: 747, baseType: !129, size: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !247, file: !44, line: 748, baseType: !99, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !247, file: !44, line: 749, baseType: !267, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !44, line: 668, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !44, line: 783, size: 1216, elements: !270)
!270 = !{!271, !272, !487, !488, !489}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !269, file: !44, line: 784, baseType: !129, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !269, file: !44, line: 785, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !44, line: 737, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 704, size: 54464, elements: !276)
!276 = !{!277, !280, !281, !282, !283, !365, !394, !397, !425, !426, !427, !428, !485, !486}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !275, file: !44, line: 705, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !279, line: 27, baseType: !118)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !275, file: !44, line: 706, baseType: !210, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !275, file: !44, line: 707, baseType: !163, size: 1024, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !275, file: !44, line: 709, baseType: !129, size: 32, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !275, file: !44, line: 714, baseType: !284, size: 51584, offset: 1216)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !44, line: 356, size: 51584, elements: !285)
!285 = !{!286, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !358, !362, !363, !364}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !284, file: !44, line: 357, baseType: !287, size: 320)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !279, line: 72, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 67, size: 320, elements: !289)
!289 = !{!290, !309, !313}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !288, file: !279, line: 69, baseType: !291, size: 320)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !292, line: 22, size: 320, elements: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !291, file: !292, line: 24, baseType: !129, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !291, file: !292, line: 25, baseType: !7, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !291, file: !292, line: 26, baseType: !129, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !291, file: !292, line: 28, baseType: !7, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !291, file: !292, line: 32, baseType: !129, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !291, file: !292, line: 34, baseType: !177, size: 16, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !291, file: !292, line: 35, baseType: !177, size: 16, offset: 176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !291, file: !292, line: 36, baseType: !302, size: 128, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !303, line: 53, baseType: !304)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !303, line: 49, size: 128, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !304, file: !303, line: 51, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !304, file: !303, line: 52, baseType: !307, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !288, file: !279, line: 70, baseType: !310, size: 320)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 320, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 40)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !288, file: !279, line: 71, baseType: !125, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1600)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1664)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !284, file: !44, line: 359, baseType: !116, size: 64, offset: 1792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 1920)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 1984)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 2112)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !284, file: !44, line: 361, baseType: !116, size: 64, offset: 2176)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !284, file: !44, line: 367, baseType: !345, size: 32768, offset: 2240)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 32768, elements: !356)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !44, line: 303, size: 512, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !346, file: !44, line: 305, baseType: !116, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !346, file: !44, line: 305, baseType: !116, size: 64, offset: 448)
!356 = !{!357}
!357 = !DISubrange(count: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !284, file: !44, line: 368, baseType: !359, size: 16384, offset: 35008)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 16384, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !284, file: !44, line: 369, baseType: !116, size: 64, offset: 51392)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !284, file: !44, line: 370, baseType: !116, size: 64, offset: 51456)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !284, file: !44, line: 371, baseType: !116, size: 64, offset: 51520)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !275, file: !44, line: 715, baseType: !366, size: 1152, offset: 52800)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 1152, elements: !392)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !44, line: 701, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !44, line: 694, size: 384, elements: !369)
!369 = !{!370, !371, !384, !385, !390, !391}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !368, file: !44, line: 695, baseType: !99, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !368, file: !44, line: 696, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !44, line: 670, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !44, line: 669, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !44, line: 687, size: 192, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !378, file: !44, line: 688, baseType: !99, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !378, file: !44, line: 689, baseType: !99, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !378, file: !44, line: 690, baseType: !129, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !44, line: 691, baseType: !129, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !368, file: !44, line: 697, baseType: !372, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !368, file: !44, line: 698, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !44, line: 671, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !267}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !368, file: !44, line: 699, baseType: !386, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !44, line: 700, baseType: !129, size: 32, offset: 320)
!392 = !{!393}
!393 = !DISubrange(count: 3)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !275, file: !44, line: 716, baseType: !395, size: 64, offset: 53952)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !44, line: 716, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !275, file: !44, line: 717, baseType: !398, size: 64, offset: 54016)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !400, line: 39, baseType: !401)
!400 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 22, size: 704, elements: !402)
!402 = !{!403, !404, !405, !418, !421, !422, !423, !424}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !401, file: !400, line: 24, baseType: !287, size: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !400, line: 26, baseType: !139, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !401, file: !400, line: 28, baseType: !406, size: 128, offset: 384)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !400, line: 28, size: 128, elements: !407)
!407 = !{!408, !416}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !406, file: !400, line: 28, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !400, line: 12, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !410, file: !400, line: 13, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !400, line: 13, size: 64, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !413, file: !400, line: 13, baseType: !409, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !406, file: !400, line: 28, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !401, file: !400, line: 30, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !420, line: 46, baseType: !118)
!420 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !401, file: !400, line: 32, baseType: !129, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !401, file: !400, line: 34, baseType: !129, size: 32, offset: 608)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !401, file: !400, line: 36, baseType: !129, size: 32, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !401, file: !400, line: 38, baseType: !129, size: 32, offset: 672)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !275, file: !44, line: 718, baseType: !250, size: 64, offset: 54080)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !275, file: !44, line: 719, baseType: !398, size: 64, offset: 54144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !275, file: !44, line: 721, baseType: !99, size: 64, offset: 54208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !275, file: !44, line: 723, baseType: !429, size: 64, offset: 54272)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !6, line: 171, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !6, line: 159, size: 832, elements: !432)
!432 = !{!433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !456}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !431, file: !6, line: 160, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !6, line: 161, baseType: !434, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !431, file: !6, line: 162, baseType: !287, size: 320, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !431, file: !6, line: 163, baseType: !116, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !431, file: !6, line: 164, baseType: !116, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !431, file: !6, line: 165, baseType: !116, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !431, file: !6, line: 166, baseType: !112, size: 16, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !431, file: !6, line: 167, baseType: !112, size: 16, offset: 656)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !431, file: !6, line: 168, baseType: !112, size: 16, offset: 672)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !431, file: !6, line: 169, baseType: !444, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !446, line: 18, baseType: !447)
!446 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 4, size: 192, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !446, line: 6, baseType: !118, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !447, file: !446, line: 9, baseType: !7, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !447, file: !446, line: 9, baseType: !7, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !447, file: !446, line: 12, baseType: !7, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !447, file: !446, line: 15, baseType: !129, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !447, file: !446, line: 17, baseType: !455, offset: 192)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, elements: !136)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !431, file: !6, line: 170, baseType: !457, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !6, line: 57, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !6, line: 62, size: 256, elements: !461)
!461 = !{!462, !463, !464, !479, !484}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !460, file: !6, line: 63, baseType: !129, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !460, file: !6, line: 64, baseType: !112, size: 16, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !460, file: !6, line: 65, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !6, line: 59, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !100, !457, !469, !471}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !473)
!473 = !{!474, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !472, file: !475, line: 865, baseType: !7, size: 32)
!475 = !DIFile(filename: "logger.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !472, file: !475, line: 865, baseType: !7, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !472, file: !475, line: 865, baseType: !99, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !472, file: !475, line: 865, baseType: !99, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !460, file: !6, line: 66, baseType: !480, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !6, line: 60, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!129, !100, !139}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !460, file: !6, line: 67, baseType: !139, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !275, file: !44, line: 724, baseType: !99, size: 64, offset: 54336)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !275, file: !44, line: 728, baseType: !129, size: 32, offset: 54400)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !269, file: !44, line: 786, baseType: !141, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !269, file: !44, line: 787, baseType: !245, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !44, line: 788, baseType: !490, size: 960, offset: 256)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 960, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 120)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !247, file: !44, line: 751, baseType: !494, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !44, line: 598, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !44, line: 575, size: 384, elements: !497)
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !44, line: 577, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !44, line: 578, baseType: !499, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !496, file: !44, line: 580, baseType: !499, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !44, line: 581, baseType: !161, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !496, file: !44, line: 582, baseType: !161, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !496, file: !44, line: 583, baseType: !129, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !496, file: !44, line: 584, baseType: !114, size: 16, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !496, file: !44, line: 585, baseType: !112, size: 16, offset: 304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !496, file: !44, line: 586, baseType: !106, size: 8, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !496, file: !44, line: 587, baseType: !106, size: 8, offset: 328)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !44, line: 593, baseType: !510, offset: 384)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, elements: !136)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !44, line: 590, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !511, file: !44, line: 591, baseType: !116, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !511, file: !44, line: 592, baseType: !135, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !247, file: !44, line: 752, baseType: !516, size: 512, offset: 384)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 512, elements: !522)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !518, line: 26, size: 128, elements: !519)
!518 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !517, file: !518, line: 28, baseType: !99, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !517, file: !518, line: 29, baseType: !419, size: 64, offset: 64)
!522 = !{!523}
!523 = !DISubrange(count: 4)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !247, file: !44, line: 753, baseType: !129, size: 32, offset: 896)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !247, file: !44, line: 754, baseType: !106, size: 8, offset: 928)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !247, file: !44, line: 755, baseType: !106, size: 8, offset: 936)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !247, file: !44, line: 760, baseType: !151, size: 8, offset: 944)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !247, file: !44, line: 761, baseType: !151, size: 8, offset: 952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !247, file: !44, line: 763, baseType: !112, size: 16, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !247, file: !44, line: 764, baseType: !112, size: 16, offset: 976)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !247, file: !44, line: 765, baseType: !112, size: 16, offset: 992)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !247, file: !44, line: 766, baseType: !533, size: 224, offset: 1024)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !534, line: 253, size: 224, elements: !535)
!534 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!535 = !{!536, !539, !541, !544, !560}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !533, file: !534, line: 255, baseType: !537, size: 16)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !538, line: 28, baseType: !114)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !533, file: !534, line: 256, baseType: !540, size: 16, offset: 16)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !534, line: 119, baseType: !112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !533, file: !534, line: 257, baseType: !542, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !107, line: 26, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !109, line: 42, baseType: !7)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !533, file: !534, line: 258, baseType: !545, size: 128, offset: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !534, line: 212, size: 128, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !545, file: !534, line: 219, baseType: !548, size: 128)
!548 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !534, line: 214, size: 128, elements: !549)
!549 = !{!550, !554, !558}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !548, file: !534, line: 216, baseType: !551, size: 128)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !548, file: !534, line: 217, baseType: !555, size: 128)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !548, file: !534, line: 218, baseType: !559, size: 128)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 128, elements: !522)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !533, file: !534, line: 259, baseType: !542, size: 32, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !247, file: !44, line: 767, baseType: !562, size: 32, offset: 1248)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !563, line: 33, baseType: !564)
!563 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !109, line: 209, baseType: !7)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !247, file: !44, line: 769, baseType: !566, size: 8192, offset: 1280)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 1024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !143, file: !44, line: 822, baseType: !245, size: 64, offset: 1600)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !143, file: !44, line: 823, baseType: !139, size: 64, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !143, file: !44, line: 824, baseType: !129, size: 32, offset: 1728)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !143, file: !44, line: 832, baseType: !99, size: 64, offset: 1792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !143, file: !44, line: 835, baseType: !129, size: 32, offset: 1856)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !143, file: !44, line: 837, baseType: !129, size: 32, offset: 1888)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !143, file: !44, line: 838, baseType: !576, size: 576, offset: 1920)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 576, elements: !392)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !143, file: !44, line: 843, baseType: !7, size: 32, offset: 2496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !143, file: !44, line: 845, baseType: !74, size: 32, offset: 2528)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !143, file: !44, line: 846, baseType: !79, size: 32, offset: 2560)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !143, file: !44, line: 847, baseType: !84, size: 32, offset: 2592)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !143, file: !44, line: 850, baseType: !129, size: 32, offset: 2624)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !143, file: !44, line: 851, baseType: !533, size: 224, offset: 2656)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !143, file: !44, line: 852, baseType: !562, size: 32, offset: 2880)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !143, file: !44, line: 854, baseType: !151, size: 8, offset: 2912)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !143, file: !44, line: 860, baseType: !586, size: 192, offset: 2944)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !44, line: 856, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !586, file: !44, line: 857, baseType: !139, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !44, line: 858, baseType: !419, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !586, file: !44, line: 859, baseType: !419, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !143, file: !44, line: 864, baseType: !592, size: 192, offset: 3136)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !593, line: 164, baseType: !594)
!593 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !593, line: 151, size: 192, elements: !595)
!595 = !{!596, !608}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !594, file: !593, line: 162, baseType: !597, size: 192)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !593, line: 152, size: 192, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !597, file: !593, line: 153, baseType: !106, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !597, file: !593, line: 154, baseType: !106, size: 8, offset: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !597, file: !593, line: 155, baseType: !112, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !597, file: !593, line: 156, baseType: !106, size: 8, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !597, file: !593, line: 157, baseType: !106, size: 8, offset: 40)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !597, file: !593, line: 158, baseType: !112, size: 16, offset: 48)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !597, file: !593, line: 159, baseType: !542, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !597, file: !593, line: 160, baseType: !542, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !597, file: !593, line: 161, baseType: !116, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !594, file: !593, line: 163, baseType: !609, size: 192)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !143, file: !44, line: 865, baseType: !116, size: 64, offset: 3328)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !143, file: !44, line: 866, baseType: !116, size: 64, offset: 3392)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !143, file: !44, line: 867, baseType: !177, size: 16, offset: 3456)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !143, file: !44, line: 868, baseType: !129, size: 32, offset: 3488)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !143, file: !44, line: 869, baseType: !129, size: 32, offset: 3520)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !44, line: 870, baseType: !141, size: 64, offset: 3584)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !143, file: !44, line: 871, baseType: !273, size: 64, offset: 3648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !143, file: !44, line: 872, baseType: !620, size: 64, offset: 3712)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!129, !141}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !143, file: !44, line: 873, baseType: !624, size: 64, offset: 3776)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !141, !99, !419}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !628, line: 108, baseType: !629)
!628 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !109, line: 193, baseType: !125)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !143, file: !44, line: 874, baseType: !631, size: 64, offset: 3840)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!627, !141, !634, !129}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !563, line: 257, size: 448, elements: !636)
!636 = !{!637, !638, !639, !641, !642, !643, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !635, file: !563, line: 259, baseType: !99, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !635, file: !563, line: 260, baseType: !562, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !635, file: !563, line: 262, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !635, file: !563, line: 263, baseType: !419, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !635, file: !563, line: 265, baseType: !99, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !635, file: !563, line: 266, baseType: !419, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !635, file: !563, line: 271, baseType: !129, size: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !143, file: !44, line: 875, baseType: !624, size: 64, offset: 3904)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logentry_eviction", file: !6, line: 71, size: 192, elements: !648)
!648 = !{!649, !651, !652, !653, !654, !655, !656}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !647, file: !6, line: 72, baseType: !650, size: 64)
!650 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !647, file: !6, line: 73, baseType: !129, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "latime", scope: !647, file: !6, line: 74, baseType: !542, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !647, file: !6, line: 75, baseType: !112, size: 16, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !647, file: !6, line: 76, baseType: !106, size: 8, offset: 144)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "clsid", scope: !647, file: !6, line: 77, baseType: !106, size: 8, offset: 152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !647, file: !6, line: 78, baseType: !657, offset: 160)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, elements: !136)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logentry_item_get", file: !6, line: 91, size: 96, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "was_found", scope: !659, file: !6, line: 92, baseType: !106, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !659, file: !6, line: 93, baseType: !106, size: 8, offset: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "clsid", scope: !659, file: !6, line: 94, baseType: !106, size: 8, offset: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !659, file: !6, line: 95, baseType: !129, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !659, file: !6, line: 96, baseType: !129, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !659, file: !6, line: 97, baseType: !657, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logentry_item_store", file: !6, line: 100, size: 192, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !668, file: !6, line: 101, baseType: !129, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !668, file: !6, line: 102, baseType: !129, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !668, file: !6, line: 103, baseType: !161, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !668, file: !6, line: 104, baseType: !106, size: 8, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "clsid", scope: !668, file: !6, line: 105, baseType: !106, size: 8, offset: 104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !668, file: !6, line: 106, baseType: !129, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !668, file: !6, line: 107, baseType: !129, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !668, file: !6, line: 108, baseType: !657, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logentry_conn_event", file: !6, line: 111, size: 320, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !679, file: !6, line: 112, baseType: !129, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !679, file: !6, line: 113, baseType: !129, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !679, file: !6, line: 114, baseType: !129, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !679, file: !6, line: 115, baseType: !533, size: 224, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !534, line: 238, size: 128, elements: !687)
!687 = !{!688, !689, !690, !695}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !686, file: !534, line: 240, baseType: !537, size: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !686, file: !534, line: 241, baseType: !540, size: 16, offset: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !686, file: !534, line: 242, baseType: !691, size: 32, offset: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !534, line: 31, size: 32, elements: !692)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !691, file: !534, line: 33, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !534, line: 30, baseType: !542)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !686, file: !534, line: 245, baseType: !696, size: 64, offset: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !556)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logentry_ext_write", file: !6, line: 81, size: 192, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !699, file: !6, line: 82, baseType: !650, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "latime", scope: !699, file: !6, line: 83, baseType: !542, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !699, file: !6, line: 84, baseType: !112, size: 16, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !699, file: !6, line: 85, baseType: !106, size: 8, offset: 112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "clsid", scope: !699, file: !6, line: 86, baseType: !106, size: 8, offset: 120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !699, file: !6, line: 87, baseType: !106, size: 8, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !699, file: !6, line: 88, baseType: !657, offset: 136)
!708 = !{!0, !709, !748, !750, !753, !771, !780, !782, !784, !786, !789, !791, !796}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "logger_stack_cond", scope: !2, file: !3, line: 36, type: !711, isLocal: false, isDefinition: true)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !279, line: 80, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 75, size: 384, elements: !713)
!713 = !{!714, !743, !747}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !712, file: !279, line: 77, baseType: !715, size: 384)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !303, line: 92, size: 384, elements: !716)
!716 = !{!717, !726, !735, !739, !740, !741, !742}
!717 = !DIDerivedType(tag: DW_TAG_member, scope: !715, file: !303, line: 94, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !303, line: 94, size: 64, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !718, file: !303, line: 96, baseType: !140, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !718, file: !303, line: 101, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !303, line: 97, size: 64, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !722, file: !303, line: 99, baseType: !7, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !722, file: !303, line: 100, baseType: !7, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, scope: !715, file: !303, line: 103, baseType: !727, size: 64, offset: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !303, line: 103, size: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !727, file: !303, line: 105, baseType: !140, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !727, file: !303, line: 110, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !303, line: 106, size: 64, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !731, file: !303, line: 108, baseType: !7, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !731, file: !303, line: 109, baseType: !7, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !715, file: !303, line: 112, baseType: !736, size: 64, offset: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 2)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !715, file: !303, line: 113, baseType: !736, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !715, file: !303, line: 114, baseType: !7, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !715, file: !303, line: 115, baseType: !7, size: 32, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !715, file: !303, line: 116, baseType: !736, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !712, file: !279, line: 78, baseType: !744, size: 384)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 384, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 48)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !712, file: !279, line: 79, baseType: !650, size: 64)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "watcher_count", scope: !2, file: !3, line: 47, type: !129, isLocal: false, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "logger_key", scope: !2, file: !3, line: 38, type: !752, isLocal: false, isDefinition: true)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !279, line: 49, baseType: !7)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "watchers", scope: !2, file: !3, line: 45, type: !755, isLocal: false, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 1280, elements: !769)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger_watcher", file: !6, line: 188, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 178, size: 448, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !758, file: !6, line: 179, baseType: !99, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !758, file: !6, line: 180, baseType: !129, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !758, file: !6, line: 181, baseType: !129, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !758, file: !6, line: 182, baseType: !116, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "min_gid", scope: !758, file: !6, line: 183, baseType: !116, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "failed_flush", scope: !758, file: !6, line: 184, baseType: !151, size: 8, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !758, file: !6, line: 185, baseType: !34, size: 32, offset: 288)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !758, file: !6, line: 186, baseType: !112, size: 16, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !758, file: !6, line: 187, baseType: !444, size: 64, offset: 384)
!769 = !{!770}
!770 = !DISubrange(count: 20)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "watchers_pollfds", scope: !2, file: !3, line: 46, type: !773, isLocal: false, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 1280, elements: !769)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !775, line: 36, size: 64, elements: !776)
!775 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "97f0939227b389ddf6ce22c8962ba359")
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !774, file: !775, line: 38, baseType: !129, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !774, file: !775, line: 39, baseType: !177, size: 16, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !774, file: !775, line: 40, baseType: !177, size: 16, offset: 48)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "logger_gid", scope: !2, file: !3, line: 430, type: !116, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "logger_stack_head", scope: !2, file: !3, line: 30, type: !429, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "logger_stack_tail", scope: !2, file: !3, line: 31, type: !429, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "do_run_logger_thread", scope: !2, file: !3, line: 33, type: !788, isLocal: true, isDefinition: true)
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !129)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "logger_tid", scope: !2, file: !3, line: 34, type: !278, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "default_entries", scope: !2, file: !3, line: 372, type: !793, isLocal: true, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 3840, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 15)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "logger_count", scope: !2, file: !3, line: 32, type: !7, isLocal: true, isDefinition: true)
!798 = !{i32 7, !"Dwarf Version", i32 5}
!799 = !{i32 2, !"Debug Info Version", i32 3}
!800 = !{i32 1, !"wchar_size", i32 4}
!801 = !{i32 7, !"uwtable", i32 1}
!802 = !{!"/home/xuheng/blackbox/llvm-test/memcached/logger.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/logger.gcda", !2}
!803 = !{!"clang version 14.0.0"}
!804 = distinct !DISubprogram(name: "logger_get_gid", scope: !3, file: !3, line: 431, type: !805, scopeLine: 431, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{!116}
!807 = !{}
!808 = !DILocation(line: 433, column: 12, scope: !804)
!809 = !DILocation(line: 433, column: 5, scope: !804)
!810 = distinct !DISubprogram(name: "logger_set_gid", scope: !3, file: !3, line: 444, type: !811, scopeLine: 444, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !116}
!813 = !{!814}
!814 = !DILocalVariable(name: "gid", arg: 1, scope: !810, file: !3, line: 444, type: !116)
!815 = !DILocation(line: 0, scope: !810)
!816 = !DILocation(line: 446, column: 5, scope: !810)
!817 = !DILocation(line: 454, column: 1, scope: !810)
!818 = distinct !DISubprogram(name: "logger_init", scope: !3, file: !3, line: 844, type: !819, scopeLine: 844, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!819 = !DISubroutineType(types: !820)
!820 = !{null}
!821 = !DILocation(line: 849, column: 23, scope: !818)
!822 = !{!823, !823, i64 0}
!823 = !{!"any pointer", !824, i64 0}
!824 = !{!"omnipotent char", !825, i64 0}
!825 = !{!"Simple C/C++ TBAA"}
!826 = !DILocation(line: 850, column: 23, scope: !818)
!827 = !DILocation(line: 851, column: 5, scope: !818)
!828 = !DILocation(line: 853, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !818, file: !3, line: 853, column: 9)
!830 = !DILocation(line: 853, column: 31, scope: !829)
!831 = !DILocation(line: 853, column: 9, scope: !818)
!832 = !DILocation(line: 854, column: 9, scope: !833)
!833 = distinct !DILexicalBlock(scope: !829, file: !3, line: 853, column: 37)
!834 = !DILocation(line: 860, column: 5, scope: !818)
!835 = !DISubprogram(name: "pthread_key_create", scope: !836, file: !836, line: 1123, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!836 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!837 = !DISubroutineType(types: !838)
!838 = !{!129, !839, !840}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !99}
!843 = distinct !DISubprogram(name: "start_logger_thread", scope: !3, file: !3, line: 817, type: !844, scopeLine: 817, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!129}
!846 = !{!847}
!847 = !DILocalVariable(name: "ret", scope: !843, file: !3, line: 818, type: !129)
!848 = !DILocation(line: 819, column: 26, scope: !843)
!849 = !{!850, !850, i64 0}
!850 = !{!"int", !824, i64 0}
!851 = !DILocation(line: 820, column: 16, scope: !852)
!852 = distinct !DILexicalBlock(scope: !843, file: !3, line: 820, column: 9)
!853 = !DILocation(line: 0, scope: !843)
!854 = !DILocation(line: 821, column: 53, scope: !852)
!855 = !DILocation(line: 820, column: 9, scope: !843)
!856 = !DILocation(line: 822, column: 17, scope: !857)
!857 = distinct !DILexicalBlock(scope: !852, file: !3, line: 821, column: 59)
!858 = !DILocation(line: 822, column: 60, scope: !857)
!859 = !DILocation(line: 822, column: 9, scope: !857)
!860 = !DILocation(line: 823, column: 9, scope: !857)
!861 = !DILocation(line: 825, column: 5, scope: !843)
!862 = !DILocation(line: 826, column: 1, scope: !843)
!863 = !DISubprogram(name: "abort", scope: !864, file: !864, line: 591, type: !819, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !807)
!864 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!865 = distinct !DISubprogram(name: "logger_stop", scope: !3, file: !3, line: 863, type: !819, scopeLine: 863, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!866 = !DILocation(line: 864, column: 5, scope: !865)
!867 = !DILocation(line: 865, column: 1, scope: !865)
!868 = distinct !DISubprogram(name: "stop_logger_thread", scope: !3, file: !3, line: 828, type: !844, scopeLine: 828, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!869 = !DILocation(line: 831, column: 5, scope: !868)
!870 = !DILocation(line: 832, column: 26, scope: !868)
!871 = !DILocation(line: 833, column: 5, scope: !868)
!872 = !DILocation(line: 834, column: 5, scope: !868)
!873 = !DILocation(line: 835, column: 18, scope: !868)
!874 = !{!875, !875, i64 0}
!875 = !{!"long", !824, i64 0}
!876 = !DILocation(line: 835, column: 5, scope: !868)
!877 = !DILocation(line: 836, column: 5, scope: !868)
!878 = distinct !DISubprogram(name: "logger_create", scope: !3, file: !3, line: 870, type: !879, scopeLine: 870, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!429}
!881 = !{!882}
!882 = !DILocalVariable(name: "l", scope: !878, file: !3, line: 872, type: !429)
!883 = !DILocation(line: 872, column: 17, scope: !878)
!884 = !DILocation(line: 0, scope: !878)
!885 = !DILocation(line: 873, column: 11, scope: !886)
!886 = distinct !DILexicalBlock(scope: !878, file: !3, line: 873, column: 9)
!887 = !DILocation(line: 873, column: 9, scope: !878)
!888 = !DILocation(line: 874, column: 9, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !3, line: 873, column: 20)
!890 = !DILocation(line: 877, column: 34, scope: !878)
!891 = !{!892, !850, i64 244}
!892 = !{!"settings", !875, i64 0, !850, i64 8, !850, i64 12, !850, i64 16, !823, i64 24, !850, i64 32, !850, i64 36, !875, i64 40, !850, i64 48, !823, i64 56, !823, i64 64, !850, i64 72, !893, i64 80, !850, i64 88, !850, i64 92, !850, i64 96, !824, i64 100, !850, i64 104, !850, i64 108, !894, i64 112, !824, i64 116, !850, i64 120, !850, i64 124, !850, i64 128, !850, i64 132, !850, i64 136, !894, i64 140, !894, i64 141, !894, i64 142, !894, i64 143, !894, i64 144, !894, i64 145, !850, i64 148, !893, i64 152, !850, i64 160, !850, i64 164, !894, i64 168, !850, i64 172, !894, i64 176, !894, i64 177, !823, i64 184, !850, i64 192, !850, i64 196, !850, i64 200, !850, i64 204, !893, i64 208, !893, i64 216, !850, i64 224, !894, i64 228, !850, i64 232, !850, i64 236, !850, i64 240, !850, i64 244, !850, i64 248, !894, i64 252, !894, i64 253, !894, i64 254, !894, i64 255, !850, i64 256, !850, i64 260, !850, i64 264, !850, i64 268, !850, i64 272, !850, i64 276, !850, i64 280, !850, i64 284, !850, i64 288, !850, i64 292, !893, i64 296, !893, i64 304, !894, i64 312, !850, i64 316, !850, i64 320, !823, i64 328, !850, i64 336}
!893 = !{!"double", !824, i64 0}
!894 = !{!"_Bool", !824, i64 0}
!895 = !DILocation(line: 877, column: 14, scope: !878)
!896 = !DILocation(line: 877, column: 8, scope: !878)
!897 = !DILocation(line: 877, column: 12, scope: !878)
!898 = !{!899, !823, i64 88}
!899 = !{!"_logger", !823, i64 0, !823, i64 8, !824, i64 16, !875, i64 56, !875, i64 64, !875, i64 72, !900, i64 80, !900, i64 82, !900, i64 84, !823, i64 88, !823, i64 96}
!900 = !{!"short", !824, i64 0}
!901 = !DILocation(line: 878, column: 16, scope: !902)
!902 = distinct !DILexicalBlock(scope: !878, file: !3, line: 878, column: 9)
!903 = !DILocation(line: 878, column: 9, scope: !878)
!904 = !DILocation(line: 879, column: 14, scope: !905)
!905 = distinct !DILexicalBlock(scope: !902, file: !3, line: 878, column: 25)
!906 = !DILocation(line: 879, column: 9, scope: !905)
!907 = !DILocation(line: 880, column: 9, scope: !905)
!908 = !DILocation(line: 883, column: 5, scope: !878)
!909 = !DILocation(line: 883, column: 8, scope: !878)
!910 = !DILocation(line: 883, column: 18, scope: !878)
!911 = !{!899, !823, i64 96}
!912 = !DILocation(line: 885, column: 28, scope: !878)
!913 = !DILocation(line: 885, column: 5, scope: !878)
!914 = !DILocation(line: 886, column: 25, scope: !878)
!915 = !DILocation(line: 886, column: 5, scope: !878)
!916 = !DILocation(line: 889, column: 5, scope: !878)
!917 = !DILocation(line: 890, column: 5, scope: !878)
!918 = !DILocation(line: 891, column: 1, scope: !878)
!919 = !DISubprogram(name: "calloc", scope: !864, file: !864, line: 542, type: !920, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!920 = !DISubroutineType(types: !921)
!921 = !{!99, !419, !419}
!922 = !DISubprogram(name: "bipbuf_new", scope: !446, file: !446, line: 26, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!923 = !DISubroutineType(types: !924)
!924 = !{!444, !925}
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!926 = !DISubprogram(name: "free", scope: !864, file: !864, line: 565, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!927 = !DISubprogram(name: "pthread_mutex_init", scope: !836, file: !836, line: 725, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!928 = !DISubroutineType(types: !929)
!929 = !{!129, !930, !931}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutexattr_t", file: !279, line: 36, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 32, size: 32, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !934, file: !279, line: 34, baseType: !937, size: 32)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 32, elements: !522)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !934, file: !279, line: 35, baseType: !129, size: 32)
!939 = !DISubprogram(name: "pthread_setspecific", scope: !836, file: !836, line: 1134, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !807)
!940 = !DISubroutineType(types: !941)
!941 = !{!129, !752, !469}
!942 = distinct !DISubprogram(name: "logger_link_q", scope: !3, file: !3, line: 460, type: !943, scopeLine: 460, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !945)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !429}
!945 = !{!946}
!946 = !DILocalVariable(name: "l", arg: 1, scope: !942, file: !3, line: 460, type: !429)
!947 = !DILocation(line: 0, scope: !942)
!948 = !DILocation(line: 461, column: 5, scope: !942)
!949 = !DILocation(line: 462, column: 5, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 462, column: 5)
!951 = distinct !DILexicalBlock(scope: !942, file: !3, line: 462, column: 5)
!952 = !DILocation(line: 462, column: 5, scope: !951)
!953 = !DILocation(line: 464, column: 8, scope: !942)
!954 = !DILocation(line: 464, column: 13, scope: !942)
!955 = !{!899, !823, i64 0}
!956 = !DILocation(line: 465, column: 15, scope: !942)
!957 = !DILocation(line: 465, column: 8, scope: !942)
!958 = !DILocation(line: 465, column: 13, scope: !942)
!959 = !{!899, !823, i64 8}
!960 = !DILocation(line: 466, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !942, file: !3, line: 466, column: 9)
!962 = !DILocation(line: 466, column: 9, scope: !942)
!963 = !DILocation(line: 466, column: 34, scope: !961)
!964 = !DILocation(line: 466, column: 21, scope: !961)
!965 = !DILocation(line: 466, column: 27, scope: !961)
!966 = !DILocation(line: 466, column: 32, scope: !961)
!967 = !DILocation(line: 466, column: 18, scope: !961)
!968 = !DILocation(line: 467, column: 23, scope: !942)
!969 = !DILocation(line: 468, column: 9, scope: !970)
!970 = distinct !DILexicalBlock(scope: !942, file: !3, line: 468, column: 9)
!971 = !DILocation(line: 468, column: 27, scope: !970)
!972 = !DILocation(line: 468, column: 9, scope: !942)
!973 = !DILocation(line: 468, column: 53, scope: !970)
!974 = !DILocation(line: 468, column: 51, scope: !970)
!975 = !DILocation(line: 468, column: 33, scope: !970)
!976 = !DILocation(line: 469, column: 17, scope: !942)
!977 = !DILocation(line: 470, column: 5, scope: !942)
!978 = !DILocation(line: 471, column: 5, scope: !942)
!979 = distinct !DISubprogram(name: "logger_log", scope: !3, file: !3, line: 897, type: !980, scopeLine: 897, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !983)
!980 = !DISubroutineType(types: !981)
!981 = !{!24, !429, !982, !469, null}
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!983 = !{!984, !985, !986, !987, !988, !989, !998, !999, !1000}
!984 = !DILocalVariable(name: "l", arg: 1, scope: !979, file: !3, line: 897, type: !429)
!985 = !DILocalVariable(name: "event", arg: 2, scope: !979, file: !3, line: 897, type: !982)
!986 = !DILocalVariable(name: "entry", arg: 3, scope: !979, file: !3, line: 897, type: !469)
!987 = !DILocalVariable(name: "buf", scope: !979, file: !3, line: 898, type: !444)
!988 = !DILocalVariable(name: "nospace", scope: !979, file: !3, line: 899, type: !151)
!989 = !DILocalVariable(name: "ap", scope: !979, file: !3, line: 900, type: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !991, line: 52, baseType: !992)
!991 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !993, line: 32, baseType: !994)
!993 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stdarg.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !475, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 192, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 1)
!998 = !DILocalVariable(name: "e", scope: !979, file: !3, line: 901, type: !100)
!999 = !DILocalVariable(name: "d", scope: !979, file: !3, line: 903, type: !457)
!1000 = !DILocalVariable(name: "reqlen", scope: !979, file: !3, line: 904, type: !129)
!1001 = !DILocation(line: 0, scope: !979)
!1002 = !DILocation(line: 898, column: 24, scope: !979)
!1003 = !DILocation(line: 900, column: 5, scope: !979)
!1004 = !DILocation(line: 900, column: 13, scope: !979)
!1005 = !DILocation(line: 903, column: 34, scope: !979)
!1006 = !DILocation(line: 903, column: 31, scope: !979)
!1007 = !DILocation(line: 904, column: 21, scope: !979)
!1008 = !{!1009, !850, i64 0}
!1009 = !{!"_entry_details", !850, i64 0, !900, i64 4, !823, i64 8, !823, i64 16, !823, i64 24}
!1010 = !DILocation(line: 906, column: 28, scope: !979)
!1011 = !DILocation(line: 906, column: 5, scope: !979)
!1012 = !DILocation(line: 908, column: 60, scope: !979)
!1013 = !DILocation(line: 908, column: 22, scope: !979)
!1014 = !DILocation(line: 909, column: 11, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !979, file: !3, line: 909, column: 9)
!1016 = !DILocation(line: 909, column: 9, scope: !979)
!1017 = !DILocation(line: 910, column: 31, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 909, column: 20)
!1019 = !DILocation(line: 910, column: 9, scope: !1018)
!1020 = !DILocation(line: 911, column: 12, scope: !1018)
!1021 = !DILocation(line: 911, column: 19, scope: !1018)
!1022 = !{!899, !875, i64 64}
!1023 = !DILocation(line: 912, column: 9, scope: !1018)
!1024 = !DILocation(line: 908, column: 9, scope: !979)
!1025 = !DILocation(line: 914, column: 8, scope: !979)
!1026 = !DILocation(line: 914, column: 14, scope: !979)
!1027 = !{!824, !824, i64 0}
!1028 = !DILocation(line: 915, column: 8, scope: !979)
!1029 = !DILocation(line: 915, column: 12, scope: !979)
!1030 = !DILocation(line: 916, column: 14, scope: !979)
!1031 = !DILocation(line: 916, column: 8, scope: !979)
!1032 = !DILocation(line: 916, column: 12, scope: !979)
!1033 = !DILocation(line: 920, column: 20, scope: !979)
!1034 = !{!1009, !900, i64 4}
!1035 = !DILocation(line: 920, column: 8, scope: !979)
!1036 = !DILocation(line: 920, column: 15, scope: !979)
!1037 = !{!900, !900, i64 0}
!1038 = !DILocation(line: 924, column: 22, scope: !979)
!1039 = !DILocation(line: 924, column: 5, scope: !979)
!1040 = !DILocation(line: 926, column: 5, scope: !979)
!1041 = !DILocation(line: 927, column: 8, scope: !979)
!1042 = !{!1009, !823, i64 8}
!1043 = !DILocation(line: 927, column: 5, scope: !979)
!1044 = !DILocation(line: 928, column: 5, scope: !979)
!1045 = !DILocation(line: 938, column: 49, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !979, file: !3, line: 938, column: 9)
!1047 = !DILocation(line: 938, column: 44, scope: !1046)
!1048 = !DILocation(line: 938, column: 59, scope: !1046)
!1049 = !DILocation(line: 938, column: 56, scope: !1046)
!1050 = !DILocation(line: 938, column: 54, scope: !1046)
!1051 = !DILocation(line: 938, column: 9, scope: !1046)
!1052 = !DILocation(line: 938, column: 65, scope: !1046)
!1053 = !DILocation(line: 938, column: 9, scope: !979)
!1054 = !DILocation(line: 939, column: 17, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 938, column: 71)
!1056 = !DILocation(line: 939, column: 9, scope: !1055)
!1057 = !DILocation(line: 940, column: 9, scope: !1055)
!1058 = !DILocation(line: 941, column: 9, scope: !1055)
!1059 = !DILocation(line: 943, column: 8, scope: !979)
!1060 = !DILocation(line: 943, column: 15, scope: !979)
!1061 = !{!899, !875, i64 56}
!1062 = !DILocation(line: 947, column: 5, scope: !979)
!1063 = !DILocation(line: 952, column: 9, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 951, column: 12)
