; ModuleID = 'memcached.c'
source_filename = "memcached.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stats = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, %struct.timeval, i64, i64 }
%struct.timeval = type { i64, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.anon, %union.anon.0, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }

!25 = !DIEnumerator(name: "bin_no_state", value: 0)
!26 = !DIEnumerator(name: "bin_reading_set_header", value: 1)
!27 = !DIEnumerator(name: "bin_reading_cas_header", value: 2)
!28 = !DIEnumerator(name: "bin_read_set_value", value: 3)
!29 = !DIEnumerator(name: "bin_reading_get_key", value: 4)
!30 = !DIEnumerator(name: "bin_reading_stat", value: 5)
!31 = !DIEnumerator(name: "bin_reading_del_header", value: 6)
!32 = !DIEnumerator(name: "bin_reading_incr_header", value: 7)
!33 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!34 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!35 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!36 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_entry_type", file: !38, line: 16, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!40 = !DIEnumerator(name: "LOGGER_ASCII_CMD", value: 0)
!41 = !DIEnumerator(name: "LOGGER_EVICTION", value: 1)
!42 = !DIEnumerator(name: "LOGGER_ITEM_GET", value: 2)
!43 = !DIEnumerator(name: "LOGGER_ITEM_STORE", value: 3)
!44 = !DIEnumerator(name: "LOGGER_CRAWLER_STATUS", value: 4)
!45 = !DIEnumerator(name: "LOGGER_SLAB_MOVE", value: 5)
!46 = !DIEnumerator(name: "LOGGER_CONNECTION_NEW", value: 6)
!47 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!48 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!49 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!50 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!51 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!52 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!53 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!54 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !6, line: 231, baseType: !7, size: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "ascii_prot", value: 3)
!58 = !DIEnumerator(name: "binary_prot", value: 4)
!59 = !DIEnumerator(name: "negotiating_prot", value: 5)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !6, line: 240, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "local_transport", value: 0)
!63 = !DIEnumerator(name: "tcp_transport", value: 1)
!64 = !DIEnumerator(name: "udp_transport", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !6, line: 259, baseType: !7, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!68 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!69 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!70 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_ret_type", file: !38, line: 44, baseType: !7, size: 32, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "LOGGER_RET_OK", value: 0)
!74 = !DIEnumerator(name: "LOGGER_RET_NOSPACE", value: 1)
!75 = !DIEnumerator(name: "LOGGER_RET_ERR", value: 2)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 62, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!79 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_SUCCESS", value: 0)
!80 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_ENOENT", value: 1)
!81 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_EEXISTS", value: 2)
!82 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_E2BIG", value: 3)
!83 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_EINVAL", value: 4)
!84 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_NOT_STORED", value: 5)
!85 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_DELTA_BADVAL", value: 6)
!86 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_ERROR", value: 32)
!87 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_CONTINUE", value: 33)
!88 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_UNKNOWN_COMMAND", value: 129)
!89 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_ENOMEM", value: 130)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "store_item_type", file: !6, line: 276, baseType: !7, size: 32, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97}
!92 = !DIEnumerator(name: "NOT_STORED", value: 0)
!93 = !DIEnumerator(name: "STORED", value: 1)
!94 = !DIEnumerator(name: "EXISTS", value: 2)
!95 = !DIEnumerator(name: "NOT_FOUND", value: 3)
!96 = !DIEnumerator(name: "TOO_LARGE", value: 4)
!97 = !DIEnumerator(name: "NO_MEMORY", value: 5)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cas_result", scope: !99, file: !3, line: 1572, baseType: !7, size: 32, elements: !665)
!99 = distinct !DISubprogram(name: "do_store_item", scope: !3, file: !3, line: 1567, type: !100, scopeLine: 1567, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !647)
!100 = !DISubroutineType(types: !101)
!101 = !{!90, !102, !114, !139, !646}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !6, line: 598, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !6, line: 575, size: 384, elements: !105)
!105 = !{!106, !108, !109, !110, !112, !113, !115, !117, !122, !126, !127}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !6, line: 577, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !6, line: 578, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !104, file: !6, line: 580, baseType: !107, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !104, file: !6, line: 581, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !38, line: 14, baseType: !7)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !104, file: !6, line: 582, baseType: !111, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !104, file: !6, line: 583, baseType: !114, size: 32, offset: 256)
!114 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !104, file: !6, line: 584, baseType: !116, size: 16, offset: 288)
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !104, file: !6, line: 585, baseType: !118, size: 16, offset: 304)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !119, line: 25, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !121, line: 40, baseType: !116)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !104, file: !6, line: 586, baseType: !123, size: 8, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 24, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !121, line: 38, baseType: !125)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !104, file: !6, line: 587, baseType: !123, size: 8, offset: 328)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !6, line: 593, baseType: !128, offset: 384)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, elements: !137)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !104, file: !6, line: 590, size: 64, elements: !130)
!130 = !{!131, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !129, file: !6, line: 591, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !119, line: 27, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !121, line: 45, baseType: !134)
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !129, file: !6, line: 592, baseType: !136, size: 8)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !{!138}
!138 = !DISubrange(count: -1)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !6, line: 781, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 794, size: 3968, elements: !142)
!142 = !{!143, !148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !244, !245, !246, !248, !249, !250, !251, !570, !571, !572, !573, !574, !575, !576, !578, !579, !580, !581, !582, !583, !584, !585, !586, !592, !612, !613, !614, !615, !616, !617, !618, !619, !623, !630, !645}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !141, file: !6, line: 795, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !146, line: 16, baseType: !147)
!146 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !141, file: !6, line: 796, baseType: !114, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !141, file: !6, line: 797, baseType: !150, size: 8, offset: 96)
!150 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !141, file: !6, line: 798, baseType: !150, size: 8, offset: 104)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !141, file: !6, line: 799, baseType: !150, size: 8, offset: 112)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !141, file: !6, line: 800, baseType: !150, size: 8, offset: 120)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !141, file: !6, line: 801, baseType: !150, size: 8, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !141, file: !6, line: 802, baseType: !150, size: 8, offset: 136)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !141, file: !6, line: 803, baseType: !150, size: 8, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !141, file: !6, line: 809, baseType: !5, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !141, file: !6, line: 810, baseType: !23, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !141, file: !6, line: 811, baseType: !111, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !141, file: !6, line: 812, baseType: !161, size: 1024, offset: 256)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !162, line: 123, size: 1024, elements: !163)
!162 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!163 = !{!164, !196, !206, !207, !210, !241, !242, !243}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !161, file: !162, line: 124, baseType: !165, size: 320)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !162, line: 107, size: 320, elements: !166)
!166 = !{!167, !174, !176, !177, !178, !195}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !165, file: !162, line: 108, baseType: !168, size: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !162, line: 108, size: 128, elements: !169)
!169 = !{!170, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !168, file: !162, line: 108, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !168, file: !162, line: 108, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !165, file: !162, line: 109, baseType: !175, size: 16, offset: 128)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !165, file: !162, line: 110, baseType: !123, size: 8, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !165, file: !162, line: 111, baseType: !123, size: 8, offset: 152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !165, file: !162, line: 118, baseType: !179, size: 64, offset: 192)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !162, line: 113, size: 64, elements: !180)
!180 = !{!181, !185, !189, !194}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !179, file: !162, line: 114, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !114, !175, !147}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !179, file: !162, line: 115, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !171, !147}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !179, file: !162, line: 116, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193, !147}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !179, file: !162, line: 117, baseType: !186, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !165, file: !162, line: 119, baseType: !147, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !161, file: !162, line: 130, baseType: !197, size: 128, offset: 320)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !162, line: 127, size: 128, elements: !198)
!198 = !{!199, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !197, file: !162, line: 128, baseType: !200, size: 128)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !162, line: 128, size: 128, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !200, file: !162, line: 128, baseType: !193, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !200, file: !162, line: 128, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !197, file: !162, line: 129, baseType: !114, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !161, file: !162, line: 131, baseType: !114, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !161, file: !162, line: 133, baseType: !208, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !162, line: 122, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !161, file: !162, line: 149, baseType: !211, size: 256, offset: 576)
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !162, line: 135, size: 256, elements: !212)
!212 = !{!213, !230}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !211, file: !162, line: 140, baseType: !214, size: 256)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !162, line: 137, size: 256, elements: !215)
!215 = !{!216, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !214, file: !162, line: 138, baseType: !217, size: 128)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !162, line: 138, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !217, file: !162, line: 138, baseType: !193, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !217, file: !162, line: 138, baseType: !204, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !214, file: !162, line: 139, baseType: !222, size: 128, offset: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !223, line: 8, size: 128, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!224 = !{!225, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !222, file: !223, line: 10, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !121, line: 160, baseType: !227)
!227 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !222, file: !223, line: 11, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !121, line: 162, baseType: !227)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !211, file: !162, line: 148, baseType: !231, size: 256)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !162, line: 143, size: 256, elements: !232)
!232 = !{!233, !238, !239}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !231, file: !162, line: 144, baseType: !234, size: 128)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !162, line: 144, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !234, file: !162, line: 144, baseType: !193, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !234, file: !162, line: 144, baseType: !204, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !231, file: !162, line: 145, baseType: !175, size: 16, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !231, file: !162, line: 147, baseType: !240, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !161, file: !162, line: 151, baseType: !175, size: 16, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !161, file: !162, line: 152, baseType: !175, size: 16, offset: 848)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !161, file: !162, line: 153, baseType: !222, size: 128, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !141, file: !6, line: 813, baseType: !175, size: 16, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !141, file: !6, line: 814, baseType: !175, size: 16, offset: 1296)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !141, file: !6, line: 816, baseType: !247, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !141, file: !6, line: 817, baseType: !247, size: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !141, file: !6, line: 818, baseType: !114, size: 32, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !141, file: !6, line: 819, baseType: !114, size: 32, offset: 1504)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !141, file: !6, line: 821, baseType: !252, size: 64, offset: 1536)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !6, line: 770, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !6, line: 743, size: 9472, elements: !255)
!255 = !{!256, !268, !270, !271, !272, !273, !515, !516, !525, !526, !527, !528, !529, !530, !531, !532, !533, !562, !566}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !254, file: !6, line: 744, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !6, line: 703, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !6, line: 773, size: 192, elements: !260)
!260 = !{!261, !262, !263, !265, !266}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !259, file: !6, line: 774, baseType: !123, size: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !259, file: !6, line: 775, baseType: !123, size: 8, offset: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !6, line: 776, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !259, file: !6, line: 777, baseType: !264, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !259, file: !6, line: 778, baseType: !267, offset: 192)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, elements: !137)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !6, line: 745, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !254, file: !6, line: 746, baseType: !114, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !254, file: !6, line: 747, baseType: !114, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !254, file: !6, line: 748, baseType: !147, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !254, file: !6, line: 749, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !6, line: 668, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !6, line: 783, size: 1216, elements: !277)
!277 = !{!278, !279, !509, !510, !511}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !276, file: !6, line: 784, baseType: !114, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !276, file: !6, line: 785, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !6, line: 737, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 704, size: 54464, elements: !283)
!283 = !{!284, !287, !288, !289, !290, !372, !401, !404, !432, !433, !434, !435, !507, !508}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !282, file: !6, line: 705, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !286, line: 27, baseType: !134)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !282, file: !6, line: 706, baseType: !208, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !282, file: !6, line: 707, baseType: !161, size: 1024, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !282, file: !6, line: 709, baseType: !114, size: 32, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !282, file: !6, line: 714, baseType: !291, size: 51584, offset: 1216)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !6, line: 356, size: 51584, elements: !292)
!292 = !{!293, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !365, !369, !370, !371}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !291, file: !6, line: 357, baseType: !294, size: 320)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !286, line: 72, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !286, line: 67, size: 320, elements: !296)
!296 = !{!297, !316, !320}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !295, file: !286, line: 69, baseType: !298, size: 320)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !299, line: 22, size: 320, elements: !300)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !298, file: !299, line: 24, baseType: !114, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !298, file: !299, line: 25, baseType: !7, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !298, file: !299, line: 26, baseType: !114, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !298, file: !299, line: 28, baseType: !7, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !298, file: !299, line: 32, baseType: !114, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !298, file: !299, line: 34, baseType: !175, size: 16, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !298, file: !299, line: 35, baseType: !175, size: 16, offset: 176)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !298, file: !299, line: 36, baseType: !309, size: 128, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !310, line: 53, baseType: !311)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !310, line: 49, size: 128, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !311, file: !310, line: 51, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !311, file: !310, line: 52, baseType: !314, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !295, file: !286, line: 70, baseType: !317, size: 320)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 320, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 40)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !295, file: !286, line: 71, baseType: !227, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1280)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1408)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1472)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1600)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1728)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !291, file: !6, line: 359, baseType: !132, size: 64, offset: 1792)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 1920)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 1984)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !291, file: !6, line: 361, baseType: !132, size: 64, offset: 2176)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !291, file: !6, line: 367, baseType: !352, size: 32768, offset: 2240)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 32768, elements: !363)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !6, line: 303, size: 512, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !353, file: !6, line: 305, baseType: !132, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !353, file: !6, line: 305, baseType: !132, size: 64, offset: 448)
!363 = !{!364}
!364 = !DISubrange(count: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !291, file: !6, line: 368, baseType: !366, size: 16384, offset: 35008)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16384, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !291, file: !6, line: 369, baseType: !132, size: 64, offset: 51392)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !291, file: !6, line: 370, baseType: !132, size: 64, offset: 51456)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !291, file: !6, line: 371, baseType: !132, size: 64, offset: 51520)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !282, file: !6, line: 715, baseType: !373, size: 1152, offset: 52800)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 1152, elements: !399)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !6, line: 701, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !6, line: 694, size: 384, elements: !376)
!376 = !{!377, !378, !391, !392, !397, !398}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !375, file: !6, line: 695, baseType: !147, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !375, file: !6, line: 696, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !6, line: 670, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !6, line: 669, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !6, line: 687, size: 192, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !385, file: !6, line: 688, baseType: !147, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !385, file: !6, line: 689, baseType: !147, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !385, file: !6, line: 690, baseType: !114, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !6, line: 691, baseType: !114, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !375, file: !6, line: 697, baseType: !379, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !375, file: !6, line: 698, baseType: !393, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !6, line: 671, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !274}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !375, file: !6, line: 699, baseType: !393, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !6, line: 700, baseType: !114, size: 32, offset: 320)
!399 = !{!400}
!400 = !DISubrange(count: 3)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !282, file: !6, line: 716, baseType: !402, size: 64, offset: 53952)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !6, line: 716, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !282, file: !6, line: 717, baseType: !405, size: 64, offset: 54016)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !407, line: 39, baseType: !408)
!407 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 22, size: 704, elements: !409)
!409 = !{!410, !411, !412, !425, !428, !429, !430, !431}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !408, file: !407, line: 24, baseType: !294, size: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !407, line: 26, baseType: !247, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !408, file: !407, line: 28, baseType: !413, size: 128, offset: 384)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !407, line: 28, size: 128, elements: !414)
!414 = !{!415, !423}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !413, file: !407, line: 28, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !407, line: 12, size: 64, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !417, file: !407, line: 13, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !407, line: 13, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !420, file: !407, line: 13, baseType: !416, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !413, file: !407, line: 28, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !408, file: !407, line: 30, baseType: !426, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 46, baseType: !134)
!427 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !408, file: !407, line: 32, baseType: !114, size: 32, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !408, file: !407, line: 34, baseType: !114, size: 32, offset: 608)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !408, file: !407, line: 36, baseType: !114, size: 32, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !408, file: !407, line: 38, baseType: !114, size: 32, offset: 672)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !282, file: !6, line: 718, baseType: !257, size: 64, offset: 54080)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !282, file: !6, line: 719, baseType: !405, size: 64, offset: 54144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !282, file: !6, line: 721, baseType: !147, size: 64, offset: 54208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !282, file: !6, line: 723, baseType: !436, size: 64, offset: 54272)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !38, line: 171, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !38, line: 159, size: 832, elements: !439)
!439 = !{!440, !442, !443, !444, !445, !446, !447, !448, !449, !450, !463}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !38, line: 160, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !38, line: 161, baseType: !441, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !438, file: !38, line: 162, baseType: !294, size: 320, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !438, file: !38, line: 163, baseType: !132, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !438, file: !38, line: 164, baseType: !132, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !438, file: !38, line: 165, baseType: !132, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !438, file: !38, line: 166, baseType: !118, size: 16, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !438, file: !38, line: 167, baseType: !118, size: 16, offset: 656)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !438, file: !38, line: 168, baseType: !118, size: 16, offset: 672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !438, file: !38, line: 169, baseType: !451, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !453, line: 18, baseType: !454)
!453 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 4, size: 192, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !454, file: !453, line: 6, baseType: !134, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !454, file: !453, line: 9, baseType: !7, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !454, file: !453, line: 9, baseType: !7, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !454, file: !453, line: 12, baseType: !7, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !454, file: !453, line: 15, baseType: !114, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !453, line: 17, baseType: !462, offset: 192)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, elements: !137)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !438, file: !38, line: 170, baseType: !464, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !38, line: 57, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !38, line: 62, size: 256, elements: !468)
!468 = !{!469, !470, !471, !501, !506}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !467, file: !38, line: 63, baseType: !114, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !467, file: !38, line: 64, baseType: !118, size: 16, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !467, file: !38, line: 65, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !38, line: 59, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !476, !464, !491, !493}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !38, line: 56, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !38, line: 135, size: 320, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !478, file: !38, line: 136, baseType: !37, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !478, file: !38, line: 137, baseType: !123, size: 8, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !478, file: !38, line: 138, baseType: !118, size: 16, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !478, file: !38, line: 139, baseType: !132, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !478, file: !38, line: 140, baseType: !222, size: 128, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !478, file: !38, line: 141, baseType: !114, size: 32, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !478, file: !38, line: 144, baseType: !487, offset: 288)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, elements: !137)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !478, file: !38, line: 142, size: 8, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !488, file: !38, line: 143, baseType: !136, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !495)
!495 = !{!496, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !494, file: !497, line: 403, baseType: !7, size: 32)
!497 = !DIFile(filename: "memcached.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !494, file: !497, line: 403, baseType: !7, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !494, file: !497, line: 403, baseType: !147, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !494, file: !497, line: 403, baseType: !147, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !467, file: !38, line: 66, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !38, line: 60, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!114, !476, !247}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !467, file: !38, line: 67, baseType: !247, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !282, file: !6, line: 724, baseType: !147, size: 64, offset: 54336)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !282, file: !6, line: 728, baseType: !114, size: 32, offset: 54400)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !276, file: !6, line: 786, baseType: !139, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !276, file: !6, line: 787, baseType: !252, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !6, line: 788, baseType: !512, size: 960, offset: 256)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 960, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !254, file: !6, line: 751, baseType: !102, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !254, file: !6, line: 752, baseType: !517, size: 512, offset: 384)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 512, elements: !523)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !519, line: 26, size: 128, elements: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !518, file: !519, line: 28, baseType: !147, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !518, file: !519, line: 29, baseType: !426, size: 64, offset: 64)
!523 = !{!524}
!524 = !DISubrange(count: 4)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !254, file: !6, line: 753, baseType: !114, size: 32, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !254, file: !6, line: 754, baseType: !123, size: 8, offset: 928)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !254, file: !6, line: 755, baseType: !123, size: 8, offset: 936)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !254, file: !6, line: 760, baseType: !150, size: 8, offset: 944)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !254, file: !6, line: 761, baseType: !150, size: 8, offset: 952)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !254, file: !6, line: 763, baseType: !118, size: 16, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !254, file: !6, line: 764, baseType: !118, size: 16, offset: 976)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !254, file: !6, line: 765, baseType: !118, size: 16, offset: 992)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !254, file: !6, line: 766, baseType: !534, size: 224, offset: 1024)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !535, line: 253, size: 224, elements: !536)
!535 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!536 = !{!537, !540, !542, !545, !561}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !534, file: !535, line: 255, baseType: !538, size: 16)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !539, line: 28, baseType: !116)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !534, file: !535, line: 256, baseType: !541, size: 16, offset: 16)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !535, line: 119, baseType: !118)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !534, file: !535, line: 257, baseType: !543, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 26, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !121, line: 42, baseType: !7)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !534, file: !535, line: 258, baseType: !546, size: 128, offset: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !535, line: 212, size: 128, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !546, file: !535, line: 219, baseType: !549, size: 128)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !546, file: !535, line: 214, size: 128, elements: !550)
!550 = !{!551, !555, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !549, file: !535, line: 216, baseType: !552, size: 128)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 16)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !549, file: !535, line: 217, baseType: !556, size: 128)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 8)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !549, file: !535, line: 218, baseType: !560, size: 128)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !523)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !534, file: !535, line: 259, baseType: !543, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !254, file: !6, line: 767, baseType: !563, size: 32, offset: 1248)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !564, line: 33, baseType: !565)
!564 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !121, line: 209, baseType: !7)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !254, file: !6, line: 769, baseType: !567, size: 8192, offset: 1280)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 1024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !141, file: !6, line: 822, baseType: !252, size: 64, offset: 1600)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !141, file: !6, line: 823, baseType: !247, size: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !141, file: !6, line: 824, baseType: !114, size: 32, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !141, file: !6, line: 832, baseType: !147, size: 64, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !141, file: !6, line: 835, baseType: !114, size: 32, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !141, file: !6, line: 837, baseType: !114, size: 32, offset: 1888)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !141, file: !6, line: 838, baseType: !577, size: 576, offset: 1920)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 576, elements: !399)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !141, file: !6, line: 843, baseType: !7, size: 32, offset: 2496)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !141, file: !6, line: 845, baseType: !55, size: 32, offset: 2528)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !141, file: !6, line: 846, baseType: !60, size: 32, offset: 2560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !141, file: !6, line: 847, baseType: !65, size: 32, offset: 2592)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !141, file: !6, line: 850, baseType: !114, size: 32, offset: 2624)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !141, file: !6, line: 851, baseType: !534, size: 224, offset: 2656)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !141, file: !6, line: 852, baseType: !563, size: 32, offset: 2880)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !141, file: !6, line: 854, baseType: !150, size: 8, offset: 2912)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !141, file: !6, line: 860, baseType: !587, size: 192, offset: 2944)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !6, line: 856, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !587, file: !6, line: 857, baseType: !247, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !6, line: 858, baseType: !426, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !587, file: !6, line: 859, baseType: !426, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !141, file: !6, line: 864, baseType: !593, size: 192, offset: 3136)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !77, line: 164, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !77, line: 151, size: 192, elements: !595)
!595 = !{!596, !608}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !594, file: !77, line: 162, baseType: !597, size: 192)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !77, line: 152, size: 192, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !597, file: !77, line: 153, baseType: !123, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !597, file: !77, line: 154, baseType: !123, size: 8, offset: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !597, file: !77, line: 155, baseType: !118, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !597, file: !77, line: 156, baseType: !123, size: 8, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !597, file: !77, line: 157, baseType: !123, size: 8, offset: 40)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !597, file: !77, line: 158, baseType: !118, size: 16, offset: 48)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !597, file: !77, line: 159, baseType: !543, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !597, file: !77, line: 160, baseType: !543, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !597, file: !77, line: 161, baseType: !132, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !594, file: !77, line: 163, baseType: !609, size: 192)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 192, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !141, file: !6, line: 865, baseType: !132, size: 64, offset: 3328)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !141, file: !6, line: 866, baseType: !132, size: 64, offset: 3392)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !141, file: !6, line: 867, baseType: !175, size: 16, offset: 3456)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !141, file: !6, line: 868, baseType: !114, size: 32, offset: 3488)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !141, file: !6, line: 869, baseType: !114, size: 32, offset: 3520)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !6, line: 870, baseType: !139, size: 64, offset: 3584)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !141, file: !6, line: 871, baseType: !280, size: 64, offset: 3648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !141, file: !6, line: 872, baseType: !620, size: 64, offset: 3712)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!114, !139}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !141, file: !6, line: 873, baseType: !624, size: 64, offset: 3776)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !139, !147, !426}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !628, line: 108, baseType: !629)
!628 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !121, line: 193, baseType: !227)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !141, file: !6, line: 874, baseType: !631, size: 64, offset: 3840)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!627, !139, !634, !114}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !564, line: 257, size: 448, elements: !636)
!636 = !{!637, !638, !639, !641, !642, !643, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !635, file: !564, line: 259, baseType: !147, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !635, file: !564, line: 260, baseType: !563, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !635, file: !564, line: 262, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !635, file: !564, line: 263, baseType: !426, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !635, file: !564, line: 265, baseType: !147, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !635, file: !564, line: 266, baseType: !426, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !635, file: !564, line: 271, baseType: !114, size: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !141, file: !6, line: 875, baseType: !624, size: 64, offset: 3904)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !662, !663}
!648 = !DILocalVariable(name: "it", arg: 1, scope: !99, file: !3, line: 1567, type: !102)
!649 = !DILocalVariable(name: "comm", arg: 2, scope: !99, file: !3, line: 1567, type: !114)
!650 = !DILocalVariable(name: "c", arg: 3, scope: !99, file: !3, line: 1567, type: !139)
!651 = !DILocalVariable(name: "hv", arg: 4, scope: !99, file: !3, line: 1567, type: !646)
!652 = !DILocalVariable(name: "key", scope: !99, file: !3, line: 1568, type: !247)
!653 = !DILocalVariable(name: "old_it", scope: !99, file: !3, line: 1569, type: !102)
!654 = !DILocalVariable(name: "stored", scope: !99, file: !3, line: 1570, type: !90)
!655 = !DILocalVariable(name: "new_it", scope: !99, file: !3, line: 1574, type: !102)
!656 = !DILocalVariable(name: "flags", scope: !99, file: !3, line: 1575, type: !543)
!657 = !DILocalVariable(name: "cas_res", scope: !99, file: !3, line: 1578, type: !98)
!658 = !DILocalVariable(name: "do_store", scope: !99, file: !3, line: 1580, type: !150)
!659 = !DILocalVariable(name: "it_cas", scope: !660, file: !3, line: 1583, type: !132)
!660 = distinct !DILexicalBlock(scope: !661, file: !3, line: 1581, column: 25)
!661 = distinct !DILexicalBlock(scope: !99, file: !3, line: 1581, column: 9)
!662 = !DILocalVariable(name: "old_cas", scope: !660, file: !3, line: 1584, type: !132)
!663 = !DILocalVariable(name: "myl", scope: !664, file: !3, line: 1721, type: !436)
!664 = distinct !DILexicalBlock(scope: !99, file: !3, line: 1721, column: 5)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DIEnumerator(name: "CAS_NONE", value: 0)
!667 = !DIEnumerator(name: "CAS_MATCH", value: 1)
!668 = !DIEnumerator(name: "CAS_BADVAL", value: 2)
!669 = !DIEnumerator(name: "CAS_STALE", value: 3)
!670 = !DIEnumerator(name: "CAS_MISS", value: 4)
!671 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rusage_who", file: !672, line: 158, baseType: !114, size: 32, elements: !673)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "f46d42ca5fb626298a4c607cecb13cce")
!673 = !{!674, !675, !676}
!674 = !DIEnumerator(name: "RUSAGE_SELF", value: 0)
!675 = !DIEnumerator(name: "RUSAGE_CHILDREN", value: -1)
!676 = !DIEnumerator(name: "RUSAGE_THREAD", value: 1)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "delta_result_type", file: !6, line: 280, baseType: !7, size: 32, elements: !678)
!678 = !{!679, !680, !681, !682, !683}
!679 = !DIEnumerator(name: "OK", value: 0)
!680 = !DIEnumerator(name: "NON_NUMERIC", value: 1)
!681 = !DIEnumerator(name: "EOM", value: 2)
!682 = !DIEnumerator(name: "DELTA_ITEM_NOT_FOUND", value: 3)
!683 = !DIEnumerator(name: "DELTA_ITEM_CAS_MISMATCH", value: 4)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hashfunc_type", file: !685, line: 7, baseType: !7, size: 32, elements: !686)
!685 = !DIFile(filename: "./hash.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7bf64ed462fb4e5d2a6ceb2b3243c634")
!686 = !{!687, !688, !689}
!687 = !DIEnumerator(name: "JENKINS_HASH", value: 0)
!688 = !DIEnumerator(name: "MURMUR3_HASH", value: 1)
!689 = !DIEnumerator(name: "XXH3_HASH", value: 2)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !672, line: 31, baseType: !7, size: 32, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!692 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!693 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!694 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!695 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!696 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!697 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!698 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!699 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!700 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!701 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!702 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!703 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!704 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!705 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!706 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!707 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!708 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!709 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!710 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event_base_config_flag", file: !712, line: 529, baseType: !7, size: 32, elements: !713)
!712 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!713 = !{!714, !715, !716, !717, !718, !719}
!714 = !DIEnumerator(name: "EVENT_BASE_FLAG_NOLOCK", value: 1)
!715 = !DIEnumerator(name: "EVENT_BASE_FLAG_IGNORE_ENV", value: 2)
!716 = !DIEnumerator(name: "EVENT_BASE_FLAG_STARTUP_IOCP", value: 4)
!717 = !DIEnumerator(name: "EVENT_BASE_FLAG_NO_CACHE_TIME", value: 8)
!718 = !DIEnumerator(name: "EVENT_BASE_FLAG_EPOLL_USE_CHANGELIST", value: 16)
!719 = !DIEnumerator(name: "EVENT_BASE_FLAG_PRECISE_TIMER", value: 32)
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "authfile_ret", file: !721, line: 4, baseType: !7, size: 32, elements: !722)
!721 = !DIFile(filename: "./authfile.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "0dde135e0a78cac5fa53ca0c0171cf2a")
!722 = !{!723, !724, !725, !726, !727}
!723 = !DIEnumerator(name: "AUTHFILE_OK", value: 0)
!724 = !DIEnumerator(name: "AUTHFILE_OOM", value: 1)
!725 = !DIEnumerator(name: "AUTHFILE_STATFAIL", value: 2)
!726 = !DIEnumerator(name: "AUTHFILE_OPENFAIL", value: 3)
!727 = !DIEnumerator(name: "AUTHFILE_MALFORMED", value: 4)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stop_reasons", file: !6, line: 253, baseType: !7, size: 32, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIEnumerator(name: "NOT_STOP", value: 0)
!731 = !DIEnumerator(name: "GRACE_STOP", value: 1)
!732 = !DIEnumerator(name: "EXIT_NORMALLY", value: 2)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 53, baseType: !7, size: 32, elements: !734)
!734 = !{!735, !736}
!735 = !DIEnumerator(name: "PROTOCOL_BINARY_REQ", value: 128)
!736 = !DIEnumerator(name: "PROTOCOL_BINARY_RES", value: 129)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 80, baseType: !7, size: 32, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!739 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GET", value: 0)
!740 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SET", value: 1)
!741 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADD", value: 2)
!742 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACE", value: 3)
!743 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETE", value: 4)
!744 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENT", value: 5)
!745 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENT", value: 6)
!746 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUIT", value: 7)
!747 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSH", value: 8)
!748 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETQ", value: 9)
!749 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_NOOP", value: 10)
!750 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_VERSION", value: 11)
!751 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETK", value: 12)
!752 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETKQ", value: 13)
!753 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPEND", value: 14)
!754 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPEND", value: 15)
!755 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_STAT", value: 16)
!756 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SETQ", value: 17)
!757 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADDQ", value: 18)
!758 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACEQ", value: 19)
!759 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETEQ", value: 20)
!760 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENTQ", value: 21)
!761 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENTQ", value: 22)
!762 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUITQ", value: 23)
!763 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSHQ", value: 24)
!764 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPENDQ", value: 25)
!765 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPENDQ", value: 26)
!766 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_TOUCH", value: 28)
!767 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GAT", value: 29)
!768 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATQ", value: 30)
!769 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATK", value: 35)
!770 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATKQ", value: 36)
!771 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_LIST_MECHS", value: 32)
!772 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_AUTH", value: 33)
!773 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_STEP", value: 34)
!774 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RGET", value: 48)
!775 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSET", value: 49)
!776 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSETQ", value: 50)
!777 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPEND", value: 51)
!778 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPENDQ", value: 52)
!779 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPEND", value: 53)
!780 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPENDQ", value: 54)
!781 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETE", value: 55)
!782 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETEQ", value: 56)
!783 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCR", value: 57)
!784 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCRQ", value: 58)
!785 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECR", value: 59)
!786 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECRQ", value: 60)
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 143, baseType: !7, size: 32, elements: !788)
!788 = !{!789}
!789 = !DIEnumerator(name: "PROTOCOL_BINARY_RAW_BYTES", value: 0)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !791, line: 24, baseType: !7, size: 32, elements: !792)
!791 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "630d972ab4324a8e936ce28b39a40b01")
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801}
!793 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!794 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!795 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!796 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!797 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!798 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!799 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!800 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!801 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "try_read_result", file: !3, line: 74, baseType: !7, size: 32, elements: !803)
!803 = !{!804, !805, !806, !807}
!804 = !DIEnumerator(name: "READ_DATA_RECEIVED", value: 0)
!805 = !DIEnumerator(name: "READ_NO_DATA_RECEIVED", value: 1)
!806 = !DIEnumerator(name: "READ_ERROR", value: 2)
!807 = !DIEnumerator(name: "READ_MEMORY_ERROR", value: 3)
!808 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "transmit_result", file: !3, line: 125, baseType: !7, size: 32, elements: !809)
!809 = !{!810, !811, !812, !813}
!810 = !DIEnumerator(name: "TRANSMIT_COMPLETE", value: 0)
!811 = !DIEnumerator(name: "TRANSMIT_INCOMPLETE", value: 1)
!812 = !DIEnumerator(name: "TRANSMIT_SOFT_ERROR", value: 2)
!813 = !DIEnumerator(name: "TRANSMIT_HARD_ERROR", value: 3)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "restart_get_kv_ret", file: !815, line: 13, baseType: !7, size: 32, elements: !816)
!815 = !DIFile(filename: "./restart.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "34d98453d5bea5bc37d52cb816cff5f2")
!816 = !{!817, !818, !819, !820}
!817 = !DIEnumerator(name: "RESTART_OK", value: 0)
!818 = !DIEnumerator(name: "RESTART_NOTAG", value: 1)
!819 = !DIEnumerator(name: "RESTART_BADLINE", value: 2)
!820 = !DIEnumerator(name: "RESTART_DONE", value: 3)
!821 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !535, line: 40, baseType: !7, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!823 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!824 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!825 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!826 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!827 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!828 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!829 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!830 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!831 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!832 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!833 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!834 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!835 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!836 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!837 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!838 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!839 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!840 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!841 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!842 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!843 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!844 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!845 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!846 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!847 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!848 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!849 = !{!111, !147, !139, !247, !426, !850, !436, !132, !858, !859, !227, !114, !134, !860, !861, !123, !118, !120, !866, !883, !895, !896, !125, !102, !905, !906, !907, !7, !919}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !564, line: 178, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !851, file: !564, line: 180, baseType: !538, size: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !851, file: !564, line: 181, baseType: !855, size: 112, offset: 16)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 112, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 14)
!858 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !121, line: 157, baseType: !134)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !862, line: 72, baseType: !863)
!862 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ccc98b488c777571beae1a47763d91")
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !114}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !6, line: 635, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !6, line: 623, size: 384, elements: !869)
!869 = !{!870, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !6, line: 624, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !868, file: !6, line: 625, baseType: !871, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !868, file: !6, line: 626, baseType: !107, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !868, file: !6, line: 627, baseType: !114, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !868, file: !6, line: 628, baseType: !114, size: 32, offset: 224)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !868, file: !6, line: 629, baseType: !114, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !868, file: !6, line: 630, baseType: !116, size: 16, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !868, file: !6, line: 631, baseType: !118, size: 16, offset: 304)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !868, file: !6, line: 632, baseType: !123, size: 8, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !868, file: !6, line: 633, baseType: !123, size: 8, offset: 328)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !868, file: !6, line: 634, baseType: !882, offset: 336)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, elements: !137)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !535, line: 238, size: 128, elements: !885)
!885 = !{!886, !887, !888, !893}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !884, file: !535, line: 240, baseType: !538, size: 16)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !884, file: !535, line: 241, baseType: !541, size: 16, offset: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !884, file: !535, line: 242, baseType: !889, size: 32, offset: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !535, line: 31, size: 32, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !889, file: !535, line: 33, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !535, line: 30, baseType: !543)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !884, file: !535, line: 245, baseType: !894, size: 64, offset: 64)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !557)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !898, line: 29, size: 880, elements: !899)
!898 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "b6a3ed283e62d2b191f1e957b6985e2a")
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !897, file: !898, line: 31, baseType: !538, size: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !897, file: !898, line: 32, baseType: !902, size: 864, offset: 16)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 864, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 108)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_meta_data", file: !3, line: 4472, size: 384, elements: !909)
!909 = !{!910, !911, !912, !913, !917, !918}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !908, file: !3, line: 4473, baseType: !147, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "old_base", scope: !908, file: !3, line: 4474, baseType: !132, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "slab_config", scope: !908, file: !3, line: 4475, baseType: !247, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "time_delta", scope: !908, file: !3, line: 4476, baseType: !914, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !915, line: 27, baseType: !916)
!915 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !121, line: 44, baseType: !227)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "process_started", scope: !908, file: !3, line: 4477, baseType: !132, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "current_time", scope: !908, file: !3, line: 4478, baseType: !543, size: 32, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !628, line: 97, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !121, line: 154, baseType: !114)
!921 = !{!0, !922, !932, !935, !964, !980, !1064, !1068, !1071, !1090, !1093, !1095, !1097, !1099, !1101, !1104, !1107, !1110, !1112, !1114, !1154, !1156, !1158, !1160, !1205, !1221, !1223, !1245, !1247}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "error_prefix", scope: !924, file: !3, line: 1296, type: !930, isLocal: true, isDefinition: true)
!924 = distinct !DISubprogram(name: "out_of_memory", scope: !3, file: !3, line: 1295, type: !925, scopeLine: 1295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !139, !247}
!927 = !{!928, !929}
!928 = !DILocalVariable(name: "c", arg: 1, scope: !924, file: !3, line: 1295, type: !139)
!929 = !DILocalVariable(name: "ascii_error", arg: 2, scope: !924, file: !3, line: 1295, type: !247)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 112, elements: !856)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "error_prefix_len", scope: !924, file: !3, line: 1297, type: !934, isLocal: true, isDefinition: true)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !3, line: 106, type: !937, isLocal: false, isDefinition: true)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats", file: !6, line: 377, size: 1664, elements: !938)
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "total_items", scope: !937, file: !6, line: 378, baseType: !132, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "total_conns", scope: !937, file: !6, line: 379, baseType: !132, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rejected_conns", scope: !937, file: !6, line: 380, baseType: !132, size: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fails", scope: !937, file: !6, line: 381, baseType: !132, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "listen_disabled_num", scope: !937, file: !6, line: 382, baseType: !132, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_moved", scope: !937, file: !6, line: 383, baseType: !132, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_rescues", scope: !937, file: !6, line: 384, baseType: !132, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_evictions_nomem", scope: !937, file: !6, line: 385, baseType: !132, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_inline_reclaim", scope: !937, file: !6, line: 386, baseType: !132, size: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_chunk_rescues", scope: !937, file: !6, line: 387, baseType: !132, size: 64, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_busy_items", scope: !937, file: !6, line: 388, baseType: !132, size: 64, offset: 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_busy_deletes", scope: !937, file: !6, line: 389, baseType: !132, size: 64, offset: 704)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_starts", scope: !937, file: !6, line: 390, baseType: !132, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lru_maintainer_juggles", scope: !937, file: !6, line: 391, baseType: !132, size: 64, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "time_in_listen_disabled_us", scope: !937, file: !6, line: 392, baseType: !132, size: 64, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "log_worker_dropped", scope: !937, file: !6, line: 393, baseType: !132, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "log_worker_written", scope: !937, file: !6, line: 394, baseType: !132, size: 64, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "log_watcher_skipped", scope: !937, file: !6, line: 395, baseType: !132, size: 64, offset: 1088)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "log_watcher_sent", scope: !937, file: !6, line: 396, baseType: !132, size: 64, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "extstore_compact_lost", scope: !937, file: !6, line: 398, baseType: !132, size: 64, offset: 1216)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "extstore_compact_rescues", scope: !937, file: !6, line: 399, baseType: !132, size: 64, offset: 1280)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "extstore_compact_skipped", scope: !937, file: !6, line: 400, baseType: !132, size: 64, offset: 1344)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns_entered", scope: !937, file: !6, line: 406, baseType: !222, size: 128, offset: 1408)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "unexpected_napi_ids", scope: !937, file: !6, line: 407, baseType: !132, size: 64, offset: 1536)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "round_robin_fallback", scope: !937, file: !6, line: 408, baseType: !132, size: 64, offset: 1600)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "stats_state", scope: !2, file: !3, line: 107, type: !966, isLocal: false, isDefinition: true)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_state", file: !6, line: 415, size: 448, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "curr_items", scope: !966, file: !6, line: 416, baseType: !132, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "curr_bytes", scope: !966, file: !6, line: 417, baseType: !132, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "curr_conns", scope: !966, file: !6, line: 418, baseType: !132, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bytes", scope: !966, file: !6, line: 419, baseType: !132, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "conn_structs", scope: !966, file: !6, line: 420, baseType: !7, size: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_fds", scope: !966, file: !6, line: 421, baseType: !7, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "hash_power_level", scope: !966, file: !6, line: 422, baseType: !7, size: 32, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "log_watchers", scope: !966, file: !6, line: 423, baseType: !7, size: 32, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "hash_is_expanding", scope: !966, file: !6, line: 424, baseType: !150, size: 8, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "accepting_conns", scope: !966, file: !6, line: 425, baseType: !150, size: 8, offset: 392)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign_running", scope: !966, file: !6, line: 426, baseType: !150, size: 8, offset: 400)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_running", scope: !966, file: !6, line: 427, baseType: !150, size: 8, offset: 408)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "settings", scope: !2, file: !3, line: 108, type: !982, isLocal: false, isDefinition: true)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings", file: !6, line: 436, size: 2752, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "maxbytes", scope: !982, file: !6, line: 437, baseType: !426, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns", scope: !982, file: !6, line: 438, baseType: !114, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !982, file: !6, line: 439, baseType: !114, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "udpport", scope: !982, file: !6, line: 440, baseType: !114, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !982, file: !6, line: 441, baseType: !247, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !982, file: !6, line: 442, baseType: !114, size: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_live", scope: !982, file: !6, line: 443, baseType: !111, size: 32, offset: 288)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_cas", scope: !982, file: !6, line: 444, baseType: !132, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "evict_to_free", scope: !982, file: !6, line: 445, baseType: !114, size: 32, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "socketpath", scope: !982, file: !6, line: 446, baseType: !247, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "auth_file", scope: !982, file: !6, line: 447, baseType: !247, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !982, file: !6, line: 448, baseType: !114, size: 32, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !982, file: !6, line: 449, baseType: !997, size: 64, offset: 640)
!997 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !982, file: !6, line: 450, baseType: !114, size: 32, offset: 704)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !982, file: !6, line: 451, baseType: !114, size: 32, offset: 736)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads_per_udp", scope: !982, file: !6, line: 452, baseType: !114, size: 32, offset: 768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_delimiter", scope: !982, file: !6, line: 453, baseType: !136, size: 8, offset: 800)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "detail_enabled", scope: !982, file: !6, line: 454, baseType: !114, size: 32, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "reqs_per_event", scope: !982, file: !6, line: 455, baseType: !114, size: 32, offset: 864)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "use_cas", scope: !982, file: !6, line: 457, baseType: !150, size: 8, offset: 896)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "binding_protocol", scope: !982, file: !6, line: 458, baseType: !55, size: 32, offset: 928)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !982, file: !6, line: 459, baseType: !114, size: 32, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "item_size_max", scope: !982, file: !6, line: 460, baseType: !114, size: 32, offset: 992)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "slab_chunk_size_max", scope: !982, file: !6, line: 461, baseType: !114, size: 32, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "slab_page_size", scope: !982, file: !6, line: 462, baseType: !114, size: 32, offset: 1056)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "sig_hup", scope: !982, file: !6, line: 463, baseType: !1011, size: 32, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !1013, line: 8, baseType: !1014)
!1013 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !121, line: 214, baseType: !114)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sasl", scope: !982, file: !6, line: 464, baseType: !150, size: 8, offset: 1120)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns_fast", scope: !982, file: !6, line: 465, baseType: !150, size: 8, offset: 1128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler", scope: !982, file: !6, line: 466, baseType: !150, size: 8, offset: 1136)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lru_maintainer_thread", scope: !982, file: !6, line: 467, baseType: !150, size: 8, offset: 1144)
