; ModuleID = 'proto_bin.c'
source_filename = "proto_bin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%emit_function_args_ty = type { i32, i32, i32 }
%emit_arcs_args_ty = type { i32, i64* }

!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!100 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GET", value: 0)
!101 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SET", value: 1)
!102 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADD", value: 2)
!103 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACE", value: 3)
!104 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETE", value: 4)
!105 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENT", value: 5)
!106 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENT", value: 6)
!107 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUIT", value: 7)
!108 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSH", value: 8)
!109 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETQ", value: 9)
!110 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_NOOP", value: 10)
!111 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_VERSION", value: 11)
!112 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETK", value: 12)
!113 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETKQ", value: 13)
!114 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPEND", value: 14)
!115 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPEND", value: 15)
!116 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_STAT", value: 16)
!117 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SETQ", value: 17)
!118 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADDQ", value: 18)
!119 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACEQ", value: 19)
!120 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETEQ", value: 20)
!121 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENTQ", value: 21)
!122 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENTQ", value: 22)
!123 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUITQ", value: 23)
!124 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSHQ", value: 24)
!125 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPENDQ", value: 25)
!126 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPENDQ", value: 26)
!127 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_TOUCH", value: 28)
!128 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GAT", value: 29)
!129 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATQ", value: 30)
!130 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATK", value: 35)
!131 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATKQ", value: 36)
!132 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_LIST_MECHS", value: 32)
!133 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_AUTH", value: 33)
!134 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_STEP", value: 34)
!135 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RGET", value: 48)
!136 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSET", value: 49)
!137 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSETQ", value: 50)
!138 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPEND", value: 51)
!139 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPENDQ", value: 52)
!140 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPEND", value: 53)
!141 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPENDQ", value: 54)
!142 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETE", value: 55)
!143 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETEQ", value: 56)
!144 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCR", value: 57)
!145 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCRQ", value: 58)
!146 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECR", value: 59)
!147 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECRQ", value: 60)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_ret_type", file: !36, line: 44, baseType: !5, size: 32, elements: !149)
!149 = !{!150, !151, !152}
!150 = !DIEnumerator(name: "LOGGER_RET_OK", value: 0)
!151 = !DIEnumerator(name: "LOGGER_RET_NOSPACE", value: 1)
!152 = !DIEnumerator(name: "LOGGER_RET_ERR", value: 2)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "delta_result_type", file: !4, line: 280, baseType: !5, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159}
!155 = !DIEnumerator(name: "OK", value: 0)
!156 = !DIEnumerator(name: "NON_NUMERIC", value: 1)
!157 = !DIEnumerator(name: "EOM", value: 2)
!158 = !DIEnumerator(name: "DELTA_ITEM_NOT_FOUND", value: 3)
!159 = !DIEnumerator(name: "DELTA_ITEM_CAS_MISMATCH", value: 4)
!160 = !{!161, !162, !165, !173, !179, !195, !197, !237, !239, !188, !347, !363, !364, !380, !381}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !163, line: 40, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!164 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_response_header", file: !70, line: 183, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !70, line: 170, size: 192, elements: !168)
!168 = !{!169, !191}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !167, file: !70, line: 181, baseType: !170, size: 192)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !167, file: !70, line: 171, size: 192, elements: !171)
!171 = !{!172, !177, !178, !180, !181, !182, !183, !186, !187}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !170, file: !70, line: 172, baseType: !173, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !174, line: 24, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !163, line: 38, baseType: !176)
!176 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !170, file: !70, line: 173, baseType: !173, size: 8, offset: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !170, file: !70, line: 174, baseType: !179, size: 16, offset: 16)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !174, line: 25, baseType: !162)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !170, file: !70, line: 175, baseType: !173, size: 8, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !170, file: !70, line: 176, baseType: !173, size: 8, offset: 40)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !170, file: !70, line: 177, baseType: !179, size: 16, offset: 48)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !170, file: !70, line: 178, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !174, line: 26, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !163, line: 42, baseType: !5)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !170, file: !70, line: 179, baseType: !184, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !170, file: !70, line: 180, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !174, line: 27, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !163, line: 45, baseType: !190)
!190 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !167, file: !70, line: 182, baseType: !192, size: 192)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 192, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 24)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !4, line: 635, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !4, line: 623, size: 384, elements: !200)
!200 = !{!201, !203, !204, !228, !229, !230, !231, !232, !233, !234, !235}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !4, line: 624, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !4, line: 625, baseType: !202, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !199, file: !4, line: 626, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !4, line: 575, size: 384, elements: !207)
!207 = !{!208, !209, !210, !211, !213, !214, !216, !217, !218, !219, !220}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !4, line: 577, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !4, line: 578, baseType: !205, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !206, file: !4, line: 580, baseType: !205, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !206, file: !4, line: 581, baseType: !212, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !36, line: 14, baseType: !5)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !206, file: !4, line: 582, baseType: !212, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !206, file: !4, line: 583, baseType: !215, size: 32, offset: 256)
!215 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !206, file: !4, line: 584, baseType: !164, size: 16, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !206, file: !4, line: 585, baseType: !179, size: 16, offset: 304)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !206, file: !4, line: 586, baseType: !173, size: 8, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !206, file: !4, line: 587, baseType: !173, size: 8, offset: 328)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !4, line: 593, baseType: !221, offset: 384)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, elements: !226)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !4, line: 590, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !222, file: !4, line: 591, baseType: !188, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !222, file: !4, line: 592, baseType: !196, size: 8)
!226 = !{!227}
!227 = !DISubrange(count: -1)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !199, file: !4, line: 627, baseType: !215, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !199, file: !4, line: 628, baseType: !215, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !199, file: !4, line: 629, baseType: !215, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !199, file: !4, line: 630, baseType: !164, size: 16, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !199, file: !4, line: 631, baseType: !179, size: 16, offset: 304)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !199, file: !4, line: 632, baseType: !173, size: 8, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !199, file: !4, line: 633, baseType: !173, size: 8, offset: 328)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !4, line: 634, baseType: !236, offset: 336)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, elements: !226)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !4, line: 598, baseType: !206)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !36, line: 171, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !36, line: 159, size: 832, elements: !242)
!242 = !{!243, !245, !246, !277, !278, !279, !280, !281, !282, !283, !296}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !241, file: !36, line: 160, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !36, line: 161, baseType: !244, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !241, file: !36, line: 162, baseType: !247, size: 320, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !248, line: 72, baseType: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !248, line: 67, size: 320, elements: !250)
!250 = !{!251, !271, !275}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !249, file: !248, line: 69, baseType: !252, size: 320)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !253, line: 22, size: 320, elements: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!254 = !{!255, !256, !257, !258, !259, !260, !262, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !252, file: !253, line: 24, baseType: !215, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !252, file: !253, line: 25, baseType: !5, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !252, file: !253, line: 26, baseType: !215, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !252, file: !253, line: 28, baseType: !5, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !252, file: !253, line: 32, baseType: !215, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !252, file: !253, line: 34, baseType: !261, size: 16, offset: 160)
!261 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !252, file: !253, line: 35, baseType: !261, size: 16, offset: 176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !252, file: !253, line: 36, baseType: !264, size: 128, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !265, line: 53, baseType: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !265, line: 49, size: 128, elements: !267)
!267 = !{!268, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !266, file: !265, line: 51, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !266, file: !265, line: 52, baseType: !269, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !249, file: !248, line: 70, baseType: !272, size: 320)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !249, file: !248, line: 71, baseType: !276, size: 64)
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !241, file: !36, line: 163, baseType: !188, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !241, file: !36, line: 164, baseType: !188, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !241, file: !36, line: 165, baseType: !188, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !241, file: !36, line: 166, baseType: !179, size: 16, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !241, file: !36, line: 167, baseType: !179, size: 16, offset: 656)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !241, file: !36, line: 168, baseType: !179, size: 16, offset: 672)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !241, file: !36, line: 169, baseType: !284, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !286, line: 18, baseType: !287)
!286 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !286, line: 4, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !287, file: !286, line: 6, baseType: !190, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !287, file: !286, line: 9, baseType: !5, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !287, file: !286, line: 9, baseType: !5, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !287, file: !286, line: 12, baseType: !5, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !287, file: !286, line: 15, baseType: !215, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !286, line: 17, baseType: !295, offset: 192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, elements: !226)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !241, file: !36, line: 170, baseType: !297, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !36, line: 57, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !36, line: 62, size: 256, elements: !301)
!301 = !{!302, !303, !304, !341, !346}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !300, file: !36, line: 63, baseType: !215, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !300, file: !36, line: 64, baseType: !179, size: 16, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !300, file: !36, line: 65, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !36, line: 59, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309, !297, !331, !333}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !36, line: 56, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !36, line: 135, size: 320, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !325, !326}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !311, file: !36, line: 136, baseType: !35, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !311, file: !36, line: 137, baseType: !173, size: 8, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !311, file: !36, line: 138, baseType: !179, size: 16, offset: 48)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !311, file: !36, line: 139, baseType: !188, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !311, file: !36, line: 140, baseType: !318, size: 128, offset: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !319, line: 8, size: 128, elements: !320)
!319 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !318, file: !319, line: 10, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !163, line: 160, baseType: !276)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !318, file: !319, line: 11, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !163, line: 162, baseType: !276)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !311, file: !36, line: 141, baseType: !215, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !36, line: 144, baseType: !327, offset: 288)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, elements: !226)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !36, line: 142, size: 8, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !328, file: !36, line: 143, baseType: !196, size: 8)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !335)
!335 = !{!336, !338, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !334, file: !337, baseType: !5, size: 32)
!337 = !DIFile(filename: "proto_bin.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !334, file: !337, baseType: !5, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !334, file: !337, baseType: !161, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !334, file: !337, baseType: !161, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !300, file: !36, line: 66, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !36, line: 60, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!215, !309, !195}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !300, file: !36, line: 67, baseType: !195, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_response_get", file: !70, line: 227, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !70, line: 219, size: 256, elements: !350)
!350 = !{!351, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !349, file: !70, line: 225, baseType: !352, size: 256)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !70, line: 220, size: 256, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !352, file: !70, line: 221, baseType: !166, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !352, file: !70, line: 224, baseType: !356, size: 32, offset: 192)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !70, line: 222, size: 32, elements: !357)
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !70, line: 223, baseType: !184, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !349, file: !70, line: 226, baseType: !360, size: 224)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 224, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 28)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_response_incr", file: !70, line: 335, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !70, line: 327, size: 256, elements: !367)
!367 = !{!368, !376}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !366, file: !70, line: 333, baseType: !369, size: 256)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !70, line: 328, size: 256, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !369, file: !70, line: 329, baseType: !166, size: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !369, file: !70, line: 332, baseType: !373, size: 64, offset: 192)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !70, line: 330, size: 64, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !373, file: !70, line: 331, baseType: !188, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !366, file: !70, line: 334, baseType: !377, size: 256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 256, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 32)
!380 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!381 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!382 = !{i32 7, !"Dwarf Version", i32 5}
!383 = !{i32 2, !"Debug Info Version", i32 3}
!384 = !{i32 1, !"wchar_size", i32 4}
!385 = !{i32 7, !"uwtable", i32 1}
!386 = !{!"/home/xuheng/blackbox/llvm-test/memcached/proto_bin.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/proto_bin.gcda", !0}
!387 = !{!"clang version 14.0.0"}
!388 = distinct !DISubprogram(name: "complete_nread_binary", scope: !1, file: !1, line: 31, type: !389, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !783)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !4, line: 781, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !4, line: 794, size: 3968, elements: !394)
!394 = !{!395, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !486, !487, !488, !489, !490, !491, !492, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !722, !723, !724, !725, !726, !732, !749, !750, !751, !752, !753, !754, !755, !756, !760, !767, !782}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !393, file: !4, line: 795, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !398, line: 16, baseType: !161)
!398 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !393, file: !4, line: 796, baseType: !215, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !393, file: !4, line: 797, baseType: !401, size: 8, offset: 96)
!401 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !393, file: !4, line: 798, baseType: !401, size: 8, offset: 104)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !393, file: !4, line: 799, baseType: !401, size: 8, offset: 112)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !393, file: !4, line: 800, baseType: !401, size: 8, offset: 120)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !393, file: !4, line: 801, baseType: !401, size: 8, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !393, file: !4, line: 802, baseType: !401, size: 8, offset: 136)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !393, file: !4, line: 803, baseType: !401, size: 8, offset: 144)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !4, line: 809, baseType: !3, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !393, file: !4, line: 810, baseType: !21, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !393, file: !4, line: 811, baseType: !212, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !393, file: !4, line: 812, baseType: !412, size: 1024, offset: 256)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !413, line: 123, size: 1024, elements: !414)
!413 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!414 = !{!415, !446, !456, !457, !460, !483, !484, !485}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !412, file: !413, line: 124, baseType: !416, size: 320)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !413, line: 107, size: 320, elements: !417)
!417 = !{!418, !425, !426, !427, !428, !445}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !416, file: !413, line: 108, baseType: !419, size: 128)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !416, file: !413, line: 108, size: 128, elements: !420)
!420 = !{!421, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !419, file: !413, line: 108, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !419, file: !413, line: 108, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !416, file: !413, line: 109, baseType: !261, size: 16, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !416, file: !413, line: 110, baseType: !173, size: 8, offset: 144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !416, file: !413, line: 111, baseType: !173, size: 8, offset: 152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !416, file: !413, line: 118, baseType: !429, size: 64, offset: 192)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !413, line: 113, size: 64, elements: !430)
!430 = !{!431, !435, !439, !444}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !429, file: !413, line: 114, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !215, !261, !161}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !429, file: !413, line: 115, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !422, !161}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !429, file: !413, line: 116, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443, !161}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !429, file: !413, line: 117, baseType: !436, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !416, file: !413, line: 119, baseType: !161, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !412, file: !413, line: 130, baseType: !447, size: 128, offset: 320)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !412, file: !413, line: 127, size: 128, elements: !448)
!448 = !{!449, !455}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !447, file: !413, line: 128, baseType: !450, size: 128)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !413, line: 128, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !450, file: !413, line: 128, baseType: !443, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !450, file: !413, line: 128, baseType: !454, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !447, file: !413, line: 129, baseType: !215, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !412, file: !413, line: 131, baseType: !215, size: 32, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !412, file: !413, line: 133, baseType: !458, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !413, line: 122, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !412, file: !413, line: 149, baseType: !461, size: 256, offset: 576)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !412, file: !413, line: 135, size: 256, elements: !462)
!462 = !{!463, !472}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !461, file: !413, line: 140, baseType: !464, size: 256)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !413, line: 137, size: 256, elements: !465)
!465 = !{!466, !471}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !464, file: !413, line: 138, baseType: !467, size: 128)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !413, line: 138, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !467, file: !413, line: 138, baseType: !443, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !467, file: !413, line: 138, baseType: !454, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !464, file: !413, line: 139, baseType: !318, size: 128, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !461, file: !413, line: 148, baseType: !473, size: 256)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !413, line: 143, size: 256, elements: !474)
!474 = !{!475, !480, !481}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !473, file: !413, line: 144, baseType: !476, size: 128)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !413, line: 144, size: 128, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !476, file: !413, line: 144, baseType: !443, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !476, file: !413, line: 144, baseType: !454, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !473, file: !413, line: 145, baseType: !261, size: 16, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !473, file: !413, line: 147, baseType: !482, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !412, file: !413, line: 151, baseType: !261, size: 16, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !412, file: !413, line: 152, baseType: !261, size: 16, offset: 848)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !412, file: !413, line: 153, baseType: !318, size: 128, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !393, file: !4, line: 813, baseType: !261, size: 16, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !393, file: !4, line: 814, baseType: !261, size: 16, offset: 1296)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !393, file: !4, line: 816, baseType: !195, size: 64, offset: 1344)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !393, file: !4, line: 817, baseType: !195, size: 64, offset: 1408)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !393, file: !4, line: 818, baseType: !215, size: 32, offset: 1472)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !393, file: !4, line: 819, baseType: !215, size: 32, offset: 1504)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !393, file: !4, line: 821, baseType: !493, size: 64, offset: 1536)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !4, line: 770, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !4, line: 743, size: 9472, elements: !496)
!496 = !{!497, !509, !511, !512, !513, !514, !657, !658, !667, !668, !669, !670, !671, !672, !673, !674, !675, !702, !706}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !495, file: !4, line: 744, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !4, line: 703, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !4, line: 773, size: 192, elements: !501)
!501 = !{!502, !503, !504, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !500, file: !4, line: 774, baseType: !173, size: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !500, file: !4, line: 775, baseType: !173, size: 8, offset: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !4, line: 776, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !500, file: !4, line: 777, baseType: !505, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !500, file: !4, line: 778, baseType: !508, offset: 192)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, elements: !226)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !4, line: 745, baseType: !510, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !495, file: !4, line: 746, baseType: !215, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !495, file: !4, line: 747, baseType: !215, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !495, file: !4, line: 748, baseType: !161, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !495, file: !4, line: 749, baseType: !515, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !4, line: 668, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !4, line: 783, size: 1216, elements: !518)
!518 = !{!519, !520, !651, !652, !653}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !517, file: !4, line: 784, baseType: !215, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !517, file: !4, line: 785, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !4, line: 737, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 704, size: 54464, elements: !524)
!524 = !{!525, !527, !528, !529, !530, !585, !614, !617, !645, !646, !647, !648, !649, !650}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !523, file: !4, line: 705, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !248, line: 27, baseType: !190)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !523, file: !4, line: 706, baseType: !458, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !523, file: !4, line: 707, baseType: !412, size: 1024, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !523, file: !4, line: 709, baseType: !215, size: 32, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !523, file: !4, line: 714, baseType: !531, size: 51584, offset: 1216)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !4, line: 356, size: 51584, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !578, !582, !583, !584}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !531, file: !4, line: 357, baseType: !247, size: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 832)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 896)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1344)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1472)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1536)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1600)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1664)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !531, file: !4, line: 359, baseType: !188, size: 64, offset: 1792)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 1856)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 1920)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 1984)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 2048)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 2112)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !531, file: !4, line: 361, baseType: !188, size: 64, offset: 2176)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !531, file: !4, line: 367, baseType: !565, size: 32768, offset: 2240)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 32768, elements: !576)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !4, line: 303, size: 512, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !566, file: !4, line: 305, baseType: !188, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !566, file: !4, line: 305, baseType: !188, size: 64, offset: 448)
!576 = !{!577}
!577 = !DISubrange(count: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !531, file: !4, line: 368, baseType: !579, size: 16384, offset: 35008)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 16384, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !531, file: !4, line: 369, baseType: !188, size: 64, offset: 51392)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !531, file: !4, line: 370, baseType: !188, size: 64, offset: 51456)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !531, file: !4, line: 371, baseType: !188, size: 64, offset: 51520)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !523, file: !4, line: 715, baseType: !586, size: 1152, offset: 52800)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 1152, elements: !612)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !4, line: 701, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !4, line: 694, size: 384, elements: !589)
!589 = !{!590, !591, !604, !605, !610, !611}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !588, file: !4, line: 695, baseType: !161, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !588, file: !4, line: 696, baseType: !592, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !4, line: 670, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !4, line: 669, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !4, line: 687, size: 192, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !598, file: !4, line: 688, baseType: !161, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !598, file: !4, line: 689, baseType: !161, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !598, file: !4, line: 690, baseType: !215, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !598, file: !4, line: 691, baseType: !215, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !588, file: !4, line: 697, baseType: !592, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !588, file: !4, line: 698, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !4, line: 671, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !515}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !588, file: !4, line: 699, baseType: !606, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !4, line: 700, baseType: !215, size: 32, offset: 320)
!612 = !{!613}
!613 = !DISubrange(count: 3)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !523, file: !4, line: 716, baseType: !615, size: 64, offset: 53952)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !4, line: 716, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !523, file: !4, line: 717, baseType: !618, size: 64, offset: 54016)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !620, line: 39, baseType: !621)
!620 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 22, size: 704, elements: !622)
!622 = !{!623, !624, !625, !638, !641, !642, !643, !644}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !621, file: !620, line: 24, baseType: !247, size: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !620, line: 26, baseType: !195, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !621, file: !620, line: 28, baseType: !626, size: 128, offset: 384)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !620, line: 28, size: 128, elements: !627)
!627 = !{!628, !636}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !626, file: !620, line: 28, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !620, line: 12, size: 64, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !630, file: !620, line: 13, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !620, line: 13, size: 64, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !633, file: !620, line: 13, baseType: !629, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !626, file: !620, line: 28, baseType: !637, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !621, file: !620, line: 30, baseType: !639, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !640, line: 46, baseType: !190)
!640 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!641 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !621, file: !620, line: 32, baseType: !215, size: 32, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !621, file: !620, line: 34, baseType: !215, size: 32, offset: 608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !621, file: !620, line: 36, baseType: !215, size: 32, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !621, file: !620, line: 38, baseType: !215, size: 32, offset: 672)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !523, file: !4, line: 718, baseType: !498, size: 64, offset: 54080)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !523, file: !4, line: 719, baseType: !618, size: 64, offset: 54144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !523, file: !4, line: 721, baseType: !161, size: 64, offset: 54208)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !523, file: !4, line: 723, baseType: !239, size: 64, offset: 54272)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !523, file: !4, line: 724, baseType: !161, size: 64, offset: 54336)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !523, file: !4, line: 728, baseType: !215, size: 32, offset: 54400)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !517, file: !4, line: 786, baseType: !391, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !517, file: !4, line: 787, baseType: !493, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !517, file: !4, line: 788, baseType: !654, size: 960, offset: 256)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 960, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 120)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !495, file: !4, line: 751, baseType: !237, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !495, file: !4, line: 752, baseType: !659, size: 512, offset: 384)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 512, elements: !665)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !661, line: 26, size: 128, elements: !662)
!661 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !660, file: !661, line: 28, baseType: !161, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !660, file: !661, line: 29, baseType: !639, size: 64, offset: 64)
!665 = !{!666}
!666 = !DISubrange(count: 4)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !495, file: !4, line: 753, baseType: !215, size: 32, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !495, file: !4, line: 754, baseType: !173, size: 8, offset: 928)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !495, file: !4, line: 755, baseType: !173, size: 8, offset: 936)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !495, file: !4, line: 760, baseType: !401, size: 8, offset: 944)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !495, file: !4, line: 761, baseType: !401, size: 8, offset: 952)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !495, file: !4, line: 763, baseType: !179, size: 16, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !495, file: !4, line: 764, baseType: !179, size: 16, offset: 976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !495, file: !4, line: 765, baseType: !179, size: 16, offset: 992)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !495, file: !4, line: 766, baseType: !676, size: 224, offset: 1024)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !677, line: 253, size: 224, elements: !678)
!677 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!678 = !{!679, !682, !684, !685, !701}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !676, file: !677, line: 255, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !681, line: 28, baseType: !164)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !676, file: !677, line: 256, baseType: !683, size: 16, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !677, line: 119, baseType: !179)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !676, file: !677, line: 257, baseType: !184, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !676, file: !677, line: 258, baseType: !686, size: 128, offset: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !677, line: 212, size: 128, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !686, file: !677, line: 219, baseType: !689, size: 128)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !686, file: !677, line: 214, size: 128, elements: !690)
!690 = !{!691, !695, !699}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !689, file: !677, line: 216, baseType: !692, size: 128)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 128, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !689, file: !677, line: 217, baseType: !696, size: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !689, file: !677, line: 218, baseType: !700, size: 128)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !665)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !676, file: !677, line: 259, baseType: !184, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !495, file: !4, line: 767, baseType: !703, size: 32, offset: 1248)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !704, line: 33, baseType: !705)
!704 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !163, line: 209, baseType: !5)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !495, file: !4, line: 769, baseType: !707, size: 8192, offset: 1280)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 8192, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 1024)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !393, file: !4, line: 822, baseType: !493, size: 64, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !393, file: !4, line: 823, baseType: !195, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !393, file: !4, line: 824, baseType: !215, size: 32, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !393, file: !4, line: 832, baseType: !161, size: 64, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !393, file: !4, line: 835, baseType: !215, size: 32, offset: 1856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !393, file: !4, line: 837, baseType: !215, size: 32, offset: 1888)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !393, file: !4, line: 838, baseType: !717, size: 576, offset: 1920)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 576, elements: !612)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !393, file: !4, line: 843, baseType: !5, size: 32, offset: 2496)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !393, file: !4, line: 845, baseType: !53, size: 32, offset: 2528)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !393, file: !4, line: 846, baseType: !58, size: 32, offset: 2560)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !393, file: !4, line: 847, baseType: !63, size: 32, offset: 2592)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !393, file: !4, line: 850, baseType: !215, size: 32, offset: 2624)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !393, file: !4, line: 851, baseType: !676, size: 224, offset: 2656)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !393, file: !4, line: 852, baseType: !703, size: 32, offset: 2880)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !393, file: !4, line: 854, baseType: !401, size: 8, offset: 2912)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !393, file: !4, line: 860, baseType: !727, size: 192, offset: 2944)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !4, line: 856, size: 192, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !727, file: !4, line: 857, baseType: !195, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !727, file: !4, line: 858, baseType: !639, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !727, file: !4, line: 859, baseType: !639, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !393, file: !4, line: 864, baseType: !733, size: 192, offset: 3136)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !70, line: 164, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !70, line: 151, size: 192, elements: !735)
!735 = !{!736, !748}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !734, file: !70, line: 162, baseType: !737, size: 192)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !70, line: 152, size: 192, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !737, file: !70, line: 153, baseType: !173, size: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !737, file: !70, line: 154, baseType: !173, size: 8, offset: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !737, file: !70, line: 155, baseType: !179, size: 16, offset: 16)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !737, file: !70, line: 156, baseType: !173, size: 8, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !737, file: !70, line: 157, baseType: !173, size: 8, offset: 40)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !737, file: !70, line: 158, baseType: !179, size: 16, offset: 48)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !737, file: !70, line: 159, baseType: !184, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !737, file: !70, line: 160, baseType: !184, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !737, file: !70, line: 161, baseType: !188, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !734, file: !70, line: 163, baseType: !192, size: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !393, file: !4, line: 865, baseType: !188, size: 64, offset: 3328)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !393, file: !4, line: 866, baseType: !188, size: 64, offset: 3392)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !393, file: !4, line: 867, baseType: !261, size: 16, offset: 3456)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !393, file: !4, line: 868, baseType: !215, size: 32, offset: 3488)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !393, file: !4, line: 869, baseType: !215, size: 32, offset: 3520)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !4, line: 870, baseType: !391, size: 64, offset: 3584)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !393, file: !4, line: 871, baseType: !521, size: 64, offset: 3648)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !393, file: !4, line: 872, baseType: !757, size: 64, offset: 3712)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!215, !391}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !393, file: !4, line: 873, baseType: !761, size: 64, offset: 3776)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !391, !161, !639}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !765, line: 108, baseType: !766)
!765 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !163, line: 193, baseType: !276)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !393, file: !4, line: 874, baseType: !768, size: 64, offset: 3840)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!764, !391, !771, !215}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !704, line: 257, size: 448, elements: !773)
!773 = !{!774, !775, !776, !778, !779, !780, !781}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !772, file: !704, line: 259, baseType: !161, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !772, file: !704, line: 260, baseType: !703, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !772, file: !704, line: 262, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !772, file: !704, line: 263, baseType: !639, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !772, file: !704, line: 265, baseType: !161, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !772, file: !704, line: 266, baseType: !639, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !772, file: !704, line: 271, baseType: !215, size: 32, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !393, file: !4, line: 875, baseType: !761, size: 64, offset: 3904)
!783 = !{!784}
!784 = !DILocalVariable(name: "c", arg: 1, scope: !388, file: !1, line: 31, type: !391)
!785 = !DILocation(line: 0, scope: !388)
!786 = !DILocation(line: 32, column: 5, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !1, line: 32, column: 5)
!788 = distinct !DILexicalBlock(scope: !388, file: !1, line: 32, column: 5)
!789 = !DILocation(line: 32, column: 5, scope: !788)
!790 = !DILocation(line: 33, column: 5, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !1, line: 33, column: 5)
!792 = distinct !DILexicalBlock(scope: !388, file: !1, line: 33, column: 5)
!793 = !{!794, !803, i64 432}
!794 = !{!"conn", !795, i64 0, !798, i64 8, !799, i64 12, !799, i64 13, !799, i64 14, !799, i64 15, !799, i64 16, !799, i64 17, !799, i64 18, !796, i64 20, !796, i64 24, !798, i64 28, !800, i64 32, !803, i64 160, !803, i64 162, !795, i64 168, !795, i64 176, !798, i64 184, !798, i64 188, !795, i64 192, !795, i64 200, !795, i64 208, !798, i64 216, !795, i64 224, !798, i64 232, !798, i64 236, !796, i64 240, !798, i64 312, !796, i64 316, !796, i64 320, !796, i64 324, !798, i64 328, !806, i64 332, !798, i64 360, !799, i64 364, !808, i64 368, !796, i64 392, !805, i64 416, !805, i64 424, !803, i64 432, !798, i64 436, !798, i64 440, !795, i64 448, !795, i64 456, !795, i64 464, !795, i64 472, !795, i64 480, !795, i64 488}
!795 = !{!"any pointer", !796, i64 0}
!796 = !{!"omnipotent char", !797, i64 0}
!797 = !{!"Simple C/C++ TBAA"}
!798 = !{!"int", !796, i64 0}
!799 = !{!"_Bool", !796, i64 0}
!800 = !{!"event", !801, i64 0, !796, i64 40, !798, i64 56, !795, i64 64, !796, i64 72, !803, i64 104, !803, i64 106, !804, i64 112}
!801 = !{!"event_callback", !802, i64 0, !803, i64 16, !796, i64 18, !796, i64 19, !796, i64 24, !795, i64 32}
!802 = !{!"", !795, i64 0, !795, i64 8}
!803 = !{!"short", !796, i64 0}
!804 = !{!"timeval", !805, i64 0, !805, i64 8}
!805 = !{!"long", !796, i64 0}
!806 = !{!"sockaddr_in6", !803, i64 0, !803, i64 2, !798, i64 4, !807, i64 8, !798, i64 24}
!807 = !{!"in6_addr", !796, i64 0}
!808 = !{!"", !795, i64 0, !805, i64 8, !805, i64 16}
!809 = !DILocation(line: 33, column: 5, scope: !792)
!810 = !DILocation(line: 35, column: 15, scope: !388)
!811 = !{!794, !796, i64 24}
!812 = !DILocation(line: 35, column: 5, scope: !388)
!813 = !DILocation(line: 37, column: 29, scope: !814)
!814 = distinct !DILexicalBlock(scope: !388, file: !1, line: 35, column: 25)
!815 = !DILocation(line: 37, column: 9, scope: !814)
!816 = !DILocation(line: 38, column: 9, scope: !814)
!817 = !DILocation(line: 40, column: 9, scope: !814)
!818 = !DILocation(line: 41, column: 16, scope: !819)
!819 = distinct !DILexicalBlock(scope: !814, file: !1, line: 41, column: 13)
!820 = !{!794, !795, i64 224}
!821 = !DILocation(line: 41, column: 13, scope: !819)
!822 = !DILocation(line: 41, column: 13, scope: !814)
!823 = !DILocation(line: 42, column: 28, scope: !824)
!824 = distinct !DILexicalBlock(scope: !819, file: !1, line: 41, column: 22)
!825 = !DILocation(line: 42, column: 13, scope: !824)
!826 = !DILocation(line: 43, column: 21, scope: !824)
!827 = !DILocation(line: 44, column: 9, scope: !824)
!828 = !DILocation(line: 45, column: 9, scope: !814)
!829 = !DILocation(line: 47, column: 17, scope: !814)
!830 = !{!795, !795, i64 0}
!831 = !DILocation(line: 47, column: 9, scope: !814)
!832 = !DILocation(line: 48, column: 9, scope: !833)
!833 = distinct !DILexicalBlock(scope: !834, file: !1, line: 48, column: 9)
!834 = distinct !DILexicalBlock(scope: !814, file: !1, line: 48, column: 9)
!835 = !DILocation(line: 50, column: 1, scope: !388)
!836 = distinct !DISubprogram(name: "complete_update_bin", scope: !1, file: !1, line: 359, type: !389, scopeLine: 359, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !837)
!837 = !{!838, !839, !841, !842, !843}
!838 = !DILocalVariable(name: "c", arg: 1, scope: !836, file: !1, line: 359, type: !391)
!839 = !DILocalVariable(name: "eno", scope: !836, file: !1, line: 360, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_response_status", file: !70, line: 74, baseType: !74)
!841 = !DILocalVariable(name: "ret", scope: !836, file: !1, line: 361, type: !90)
!842 = !DILocalVariable(name: "it", scope: !836, file: !1, line: 364, type: !237)
!843 = !DILocalVariable(name: "ch", scope: !844, file: !1, line: 376, type: !197)
!844 = distinct !DILexicalBlock(scope: !845, file: !1, line: 374, column: 12)
!845 = distinct !DILexicalBlock(scope: !836, file: !1, line: 371, column: 9)
!846 = !DILocation(line: 0, scope: !836)
!847 = !DILocation(line: 362, column: 5, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !1, line: 362, column: 5)
!849 = distinct !DILexicalBlock(scope: !836, file: !1, line: 362, column: 5)
!850 = !DILocation(line: 362, column: 5, scope: !849)
!851 = !DILocation(line: 364, column: 19, scope: !836)
!852 = !DILocation(line: 365, column: 28, scope: !836)
!853 = !{!794, !795, i64 456}
!854 = !DILocation(line: 365, column: 42, scope: !836)
!855 = !DILocation(line: 365, column: 5, scope: !836)
!856 = !DILocation(line: 366, column: 8, scope: !836)
!857 = !DILocation(line: 366, column: 33, scope: !836)
!858 = !{!796, !796, i64 0}
!859 = !DILocation(line: 366, column: 49, scope: !836)
!860 = !DILocation(line: 366, column: 57, scope: !836)
!861 = !{!862, !805, i64 0}
!862 = !{!"slab_stats", !805, i64 0, !805, i64 8, !805, i64 16, !805, i64 24, !805, i64 32, !805, i64 40, !805, i64 48, !805, i64 56}
!863 = !DILocation(line: 367, column: 44, scope: !836)
!864 = !DILocation(line: 367, column: 5, scope: !836)
!865 = !DILocation(line: 371, column: 14, scope: !845)
!866 = !{!803, !803, i64 0}
!867 = !DILocation(line: 371, column: 23, scope: !845)
!868 = !DILocation(line: 371, column: 39, scope: !845)
!869 = !DILocation(line: 371, column: 9, scope: !836)
!870 = !DILocation(line: 372, column: 11, scope: !871)
!871 = distinct !DILexicalBlock(scope: !845, file: !1, line: 371, column: 45)
!872 = !DILocation(line: 372, column: 31, scope: !871)
!873 = !{!798, !798, i64 0}
!874 = !DILocation(line: 372, column: 25, scope: !871)
!875 = !DILocation(line: 372, column: 38, scope: !871)
!876 = !DILocation(line: 372, column: 43, scope: !871)
!877 = !DILocation(line: 373, column: 11, scope: !871)
!878 = !DILocation(line: 373, column: 31, scope: !871)
!879 = !DILocation(line: 373, column: 25, scope: !871)
!880 = !DILocation(line: 373, column: 38, scope: !871)
!881 = !DILocation(line: 373, column: 43, scope: !871)
!882 = !DILocation(line: 374, column: 5, scope: !871)
!883 = !DILocation(line: 375, column: 9, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 375, column: 9)
!885 = distinct !DILexicalBlock(scope: !844, file: !1, line: 375, column: 9)
!886 = !{!794, !795, i64 208}
!887 = !DILocation(line: 375, column: 9, scope: !885)
!888 = !DILocation(line: 376, column: 26, scope: !844)
!889 = !DILocation(line: 0, scope: !844)
!890 = !DILocation(line: 377, column: 17, scope: !891)
!891 = distinct !DILexicalBlock(scope: !844, file: !1, line: 377, column: 13)
!892 = !DILocation(line: 377, column: 29, scope: !891)
!893 = !DILocation(line: 377, column: 22, scope: !891)
!894 = !DILocation(line: 377, column: 13, scope: !844)
!895 = !DILocation(line: 378, column: 18, scope: !891)
!896 = !DILocation(line: 378, column: 22, scope: !891)
!897 = !DILocation(line: 378, column: 13, scope: !891)
!898 = !DILocation(line: 379, column: 9, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !1, line: 379, column: 9)
!900 = distinct !DILexicalBlock(scope: !844, file: !1, line: 379, column: 9)
!901 = !DILocation(line: 379, column: 9, scope: !900)
!902 = !DILocation(line: 380, column: 9, scope: !844)
!903 = !DILocation(line: 380, column: 22, scope: !844)
!904 = !DILocation(line: 380, column: 28, scope: !844)
!905 = !DILocation(line: 381, column: 22, scope: !844)
!906 = !DILocation(line: 381, column: 27, scope: !844)
!907 = !DILocation(line: 381, column: 9, scope: !844)
!908 = !DILocation(line: 381, column: 32, scope: !844)
!909 = !DILocation(line: 382, column: 18, scope: !844)
!910 = !DILocation(line: 385, column: 29, scope: !836)
!911 = !DILocation(line: 385, column: 26, scope: !836)
!912 = !DILocation(line: 385, column: 11, scope: !836)
!913 = !DILocation(line: 413, column: 5, scope: !836)
!914 = !DILocation(line: 416, column: 28, scope: !915)
!915 = distinct !DILexicalBlock(scope: !836, file: !1, line: 413, column: 18)
!916 = !DILocation(line: 416, column: 9, scope: !915)
!917 = !DILocation(line: 417, column: 9, scope: !915)
!918 = !DILocation(line: 419, column: 25, scope: !915)
!919 = !DILocation(line: 419, column: 9, scope: !915)
!920 = !DILocation(line: 420, column: 9, scope: !915)
!921 = !DILocation(line: 422, column: 25, scope: !915)
!922 = !DILocation(line: 422, column: 9, scope: !915)
!923 = !DILocation(line: 423, column: 9, scope: !915)
!924 = !DILocation(line: 427, column: 16, scope: !925)
!925 = distinct !DILexicalBlock(scope: !915, file: !1, line: 427, column: 13)
!926 = !DILocation(line: 427, column: 13, scope: !915)
!927 = !DILocation(line: 428, column: 17, scope: !928)
!928 = distinct !DILexicalBlock(scope: !925, file: !1, line: 427, column: 34)
!929 = !DILocation(line: 429, column: 9, scope: !928)
!930 = !DILocation(line: 430, column: 17, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !1, line: 429, column: 44)
!932 = distinct !DILexicalBlock(scope: !925, file: !1, line: 429, column: 19)
!933 = !DILocation(line: 431, column: 9, scope: !931)
!934 = !DILocation(line: 432, column: 17, scope: !935)
!935 = distinct !DILexicalBlock(scope: !932, file: !1, line: 431, column: 16)
!936 = !DILocation(line: 0, scope: !925)
!937 = !DILocation(line: 434, column: 9, scope: !915)
!938 = !DILocation(line: 435, column: 5, scope: !915)
!939 = !DILocation(line: 437, column: 20, scope: !836)
!940 = !DILocation(line: 437, column: 5, scope: !836)
!941 = !DILocation(line: 438, column: 13, scope: !836)
!942 = !DILocation(line: 439, column: 1, scope: !836)
!943 = distinct !DISubprogram(name: "process_bin_complete_sasl_auth", scope: !1, file: !1, line: 767, type: !389, scopeLine: 767, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !944)
!944 = !{!945, !946, !949, !950, !951, !952, !953, !957, !958}
!945 = !DILocalVariable(name: "c", arg: 1, scope: !943, file: !1, line: 767, type: !391)
!946 = !DILocalVariable(name: "out", scope: !943, file: !1, line: 769, type: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!949 = !DILocalVariable(name: "outlen", scope: !943, file: !1, line: 770, type: !5)
!950 = !DILocalVariable(name: "nkey", scope: !943, file: !1, line: 775, type: !215)
!951 = !DILocalVariable(name: "vlen", scope: !943, file: !1, line: 776, type: !215)
!952 = !DILocalVariable(name: "__vla_expr0", scope: !943, type: !190, flags: DIFlagArtificial)
!953 = !DILocalVariable(name: "mech", scope: !943, file: !1, line: 784, type: !954)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: !952)
!957 = !DILocalVariable(name: "challenge", scope: !943, file: !1, line: 791, type: !947)
!958 = !DILocalVariable(name: "result", scope: !943, file: !1, line: 799, type: !215)
!959 = !DILocation(line: 0, scope: !943)
!960 = !DILocation(line: 768, column: 5, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !1, line: 768, column: 5)
!962 = distinct !DILexicalBlock(scope: !943, file: !1, line: 768, column: 5)
!963 = !{!964, !799, i64 140}
!964 = !{!"settings", !805, i64 0, !798, i64 8, !798, i64 12, !798, i64 16, !795, i64 24, !798, i64 32, !798, i64 36, !805, i64 40, !798, i64 48, !795, i64 56, !795, i64 64, !798, i64 72, !965, i64 80, !798, i64 88, !798, i64 92, !798, i64 96, !796, i64 100, !798, i64 104, !798, i64 108, !799, i64 112, !796, i64 116, !798, i64 120, !798, i64 124, !798, i64 128, !798, i64 132, !798, i64 136, !799, i64 140, !799, i64 141, !799, i64 142, !799, i64 143, !799, i64 144, !799, i64 145, !798, i64 148, !965, i64 152, !798, i64 160, !798, i64 164, !799, i64 168, !798, i64 172, !799, i64 176, !799, i64 177, !795, i64 184, !798, i64 192, !798, i64 196, !798, i64 200, !798, i64 204, !965, i64 208, !965, i64 216, !798, i64 224, !799, i64 228, !798, i64 232, !798, i64 236, !798, i64 240, !798, i64 244, !798, i64 248, !799, i64 252, !799, i64 253, !799, i64 254, !799, i64 255, !798, i64 256, !798, i64 260, !798, i64 264, !798, i64 268, !798, i64 272, !798, i64 276, !798, i64 280, !798, i64 284, !798, i64 288, !798, i64 292, !965, i64 296, !965, i64 304, !799, i64 312, !798, i64 316, !798, i64 320, !795, i64 328, !798, i64 336}
!965 = !{!"double", !796, i64 0}
!966 = !{i8 0, i8 2}
!967 = !DILocation(line: 768, column: 5, scope: !962)
!968 = !DILocation(line: 772, column: 5, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !1, line: 772, column: 5)
!970 = distinct !DILexicalBlock(scope: !943, file: !1, line: 772, column: 5)
!971 = !DILocation(line: 772, column: 5, scope: !970)
!972 = !DILocation(line: 773, column: 5, scope: !943)
!973 = !DILocation(line: 775, column: 41, scope: !943)
!974 = !DILocation(line: 775, column: 16, scope: !943)
!975 = !DILocation(line: 776, column: 41, scope: !943)
!976 = !DILocation(line: 776, column: 49, scope: !943)
!977 = !DILocation(line: 778, column: 28, scope: !978)
!978 = distinct !DILexicalBlock(scope: !943, file: !1, line: 778, column: 9)
!979 = !DILocation(line: 778, column: 35, scope: !978)
!980 = !DILocation(line: 778, column: 14, scope: !978)
!981 = !DILocation(line: 778, column: 9, scope: !943)
!982 = !DILocation(line: 779, column: 25, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !1, line: 778, column: 41)
!984 = !DILocation(line: 779, column: 9, scope: !983)
!985 = !DILocation(line: 780, column: 9, scope: !983)
!986 = !DILocation(line: 781, column: 9, scope: !983)
!987 = !DILocation(line: 784, column: 19, scope: !943)
!988 = !DILocation(line: 784, column: 5, scope: !943)
!989 = !DILocation(line: 784, column: 10, scope: !943)
!990 = !DILocation(line: 785, column: 18, scope: !943)
!991 = !DILocation(line: 785, column: 44, scope: !943)
!992 = !DILocation(line: 785, column: 5, scope: !943)
!993 = !DILocation(line: 786, column: 5, scope: !943)
!994 = !DILocation(line: 786, column: 16, scope: !943)
!995 = !DILocation(line: 788, column: 18, scope: !996)
!996 = distinct !DILexicalBlock(scope: !943, file: !1, line: 788, column: 9)
!997 = !{!964, !798, i64 32}
!998 = !DILocation(line: 788, column: 9, scope: !996)
!999 = !DILocation(line: 788, column: 9, scope: !943)
!1000 = !DILocation(line: 789, column: 17, scope: !996)
!1001 = !DILocation(line: 789, column: 9, scope: !996)
!1002 = !DILocation(line: 791, column: 34, scope: !943)
!1003 = !DILocation(line: 791, column: 29, scope: !943)
!1004 = !DILocation(line: 793, column: 28, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !943, file: !1, line: 793, column: 9)
!1006 = !DILocation(line: 793, column: 35, scope: !1005)
!1007 = !DILocation(line: 793, column: 14, scope: !1005)
!1008 = !DILocation(line: 793, column: 9, scope: !943)
!1009 = !DILocation(line: 794, column: 25, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !1, line: 793, column: 43)
!1011 = !DILocation(line: 794, column: 9, scope: !1010)
!1012 = !DILocation(line: 795, column: 9, scope: !1010)
!1013 = !DILocation(line: 796, column: 9, scope: !1010)
!1014 = !DILocation(line: 801, column: 16, scope: !943)
!1015 = !DILocation(line: 801, column: 13, scope: !943)
!1016 = !DILocation(line: 801, column: 5, scope: !943)
!1017 = !DILocation(line: 806, column: 49, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !943, file: !1, line: 801, column: 21)
!1019 = !DILocation(line: 806, column: 12, scope: !1018)
!1020 = !DILocation(line: 806, column: 25, scope: !1018)
!1021 = !{!794, !799, i64 12}
!1022 = !DILocation(line: 807, column: 9, scope: !1018)
!1023 = !DILocation(line: 809, column: 17, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1018, file: !1, line: 809, column: 13)
!1025 = !DILocation(line: 809, column: 13, scope: !1018)
!1026 = !DILocation(line: 810, column: 26, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !1, line: 810, column: 17)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 809, column: 31)
!1029 = !DILocation(line: 810, column: 17, scope: !1027)
!1030 = !DILocation(line: 810, column: 17, scope: !1028)
!1031 = !DILocation(line: 811, column: 25, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 810, column: 35)
!1033 = !DILocation(line: 812, column: 65, scope: !1032)
!1034 = !{!794, !798, i64 8}
!1035 = !DILocation(line: 811, column: 17, scope: !1032)
!1036 = !DILocation(line: 813, column: 13, scope: !1032)
!1037 = !DILocation(line: 814, column: 13, scope: !1028)
!1038 = !DILocation(line: 816, column: 16, scope: !1018)
!1039 = !DILocation(line: 819, column: 9, scope: !1018)
!1040 = !DILocation(line: 821, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !1, line: 821, column: 9)
!1042 = distinct !DILexicalBlock(scope: !1018, file: !1, line: 821, column: 9)
!1043 = !DILocation(line: 831, column: 18, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !943, file: !1, line: 831, column: 9)
!1045 = !DILocation(line: 831, column: 9, scope: !1044)
!1046 = !DILocation(line: 831, column: 9, scope: !943)
!1047 = !DILocation(line: 832, column: 17, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 831, column: 27)
!1049 = !DILocation(line: 832, column: 9, scope: !1048)
!1050 = !DILocation(line: 833, column: 5, scope: !1048)
!1051 = !DILocation(line: 835, column: 5, scope: !943)
!1052 = !DILocation(line: 844, column: 9, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !943, file: !1, line: 835, column: 20)
!1054 = !DILocation(line: 849, column: 24, scope: !1053)
!1055 = !DILocation(line: 849, column: 9, scope: !1053)
!1056 = !DILocation(line: 850, column: 9, scope: !1053)
!1057 = !DILocation(line: 852, column: 22, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !1, line: 852, column: 13)
!1059 = !DILocation(line: 852, column: 13, scope: !1058)
!1060 = !DILocation(line: 852, column: 13, scope: !1053)
!1061 = !DILocation(line: 853, column: 21, scope: !1058)
!1062 = !DILocation(line: 853, column: 13, scope: !1058)
!1063 = !DILocation(line: 854, column: 25, scope: !1053)
!1064 = !DILocation(line: 854, column: 9, scope: !1053)
!1065 = !DILocation(line: 855, column: 32, scope: !1053)
!1066 = !DILocation(line: 855, column: 46, scope: !1053)
!1067 = !DILocation(line: 855, column: 9, scope: !1053)
!1068 = !DILocation(line: 856, column: 12, scope: !1053)
!1069 = !DILocation(line: 856, column: 26, scope: !1053)
!1070 = !DILocation(line: 856, column: 35, scope: !1053)
!1071 = !{!805, !805, i64 0}
!1072 = !DILocation(line: 858, column: 48, scope: !1053)
!1073 = !DILocation(line: 858, column: 9, scope: !1053)
!1074 = !DILocation(line: 859, column: 5, scope: !1053)
!1075 = !DILocation(line: 860, column: 1, scope: !943)
!1076 = !DISubprogram(name: "do_item_remove", scope: !1077, file: !1077, line: 23, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1080)
!1077 = !DIFile(filename: "./items.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "24f8c54717bd547418db2338c9044014")
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !237}
!1080 = !{}
!1081 = !DISubprogram(name: "fprintf", scope: !1082, file: !1082, line: 326, type: !1083, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1080)
!1082 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!215, !1085, !1139, null}
!1085 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1088, line: 7, baseType: !1089)
!1088 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1090, line: 49, size: 1728, elements: !1091)
!1090 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1107, !1109, !1110, !1111, !1113, !1114, !1116, !1120, !1123, !1125, !1128, !1131, !1132, !1133, !1134, !1135}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1089, file: !1090, line: 51, baseType: !215, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1089, file: !1090, line: 54, baseType: !195, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1089, file: !1090, line: 55, baseType: !195, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1089, file: !1090, line: 56, baseType: !195, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1089, file: !1090, line: 57, baseType: !195, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1089, file: !1090, line: 58, baseType: !195, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1089, file: !1090, line: 59, baseType: !195, size: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1089, file: !1090, line: 60, baseType: !195, size: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1089, file: !1090, line: 61, baseType: !195, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1089, file: !1090, line: 64, baseType: !195, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1089, file: !1090, line: 65, baseType: !195, size: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1089, file: !1090, line: 66, baseType: !195, size: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1089, file: !1090, line: 68, baseType: !1105, size: 64, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1090, line: 36, flags: DIFlagFwdDecl)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1089, file: !1090, line: 70, baseType: !1108, size: 64, offset: 832)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1089, file: !1090, line: 72, baseType: !215, size: 32, offset: 896)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1089, file: !1090, line: 73, baseType: !215, size: 32, offset: 928)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1089, file: !1090, line: 74, baseType: !1112, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !163, line: 152, baseType: !276)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1089, file: !1090, line: 77, baseType: !164, size: 16, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1089, file: !1090, line: 78, baseType: !1115, size: 8, offset: 1040)
!1115 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1089, file: !1090, line: 79, baseType: !1117, size: 8, offset: 1048)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 8, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 1)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1089, file: !1090, line: 81, baseType: !1121, size: 64, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1090, line: 43, baseType: null)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1089, file: !1090, line: 89, baseType: !1124, size: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !163, line: 153, baseType: !276)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1089, file: !1090, line: 91, baseType: !1126, size: 64, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1090, line: 37, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1089, file: !1090, line: 92, baseType: !1129, size: 64, offset: 1280)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1090, line: 38, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1089, file: !1090, line: 93, baseType: !1108, size: 64, offset: 1344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1089, file: !1090, line: 94, baseType: !161, size: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1089, file: !1090, line: 95, baseType: !639, size: 64, offset: 1472)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1089, file: !1090, line: 96, baseType: !215, size: 32, offset: 1536)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1089, file: !1090, line: 98, baseType: !1136, size: 160, offset: 1568)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 160, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 20)
!1139 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !947)
!1140 = distinct !DISubprogram(name: "try_read_command_binary", scope: !1, file: !1, line: 52, type: !758, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1141)
!1141 = !{!1142, !1143, !1147, !1150, !1151, !1152}
!1142 = !DILocalVariable(name: "c", arg: 1, scope: !1140, file: !1, line: 52, type: !391)
!1143 = !DILocalVariable(name: "req", scope: !1144, file: !1, line: 59, type: !1146)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !1, line: 57, column: 12)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 54, column: 9)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!1147 = !DILocalVariable(name: "ii", scope: !1148, file: !1, line: 64, type: !215)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !1, line: 62, column: 35)
!1149 = distinct !DILexicalBlock(scope: !1144, file: !1, line: 62, column: 13)
!1150 = !DILocalVariable(name: "extlen", scope: !1144, file: !1, line: 89, type: !173)
!1151 = !DILocalVariable(name: "keylen", scope: !1144, file: !1, line: 90, type: !179)
!1152 = !DILocalVariable(name: "extbuf", scope: !1144, file: !1, line: 116, type: !1153)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 384, elements: !1154)
!1154 = !{!1155}
!1155 = !DISubrange(count: 48)
!1156 = !DILocation(line: 0, scope: !1140)
!1157 = !DILocation(line: 54, column: 12, scope: !1145)
!1158 = !{!794, !798, i64 188}
!1159 = !DILocation(line: 54, column: 19, scope: !1145)
!1160 = !DILocation(line: 54, column: 9, scope: !1140)
!1161 = !DILocation(line: 56, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1145, file: !1, line: 54, column: 47)
!1163 = !DILocation(line: 58, column: 20, scope: !1144)
!1164 = !DILocation(line: 58, column: 16, scope: !1144)
!1165 = !DILocation(line: 58, column: 38, scope: !1144)
