; ModuleID = 'proto_text.c'
source_filename = "proto_text.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%emit_function_args_ty = type { i32, i32, i32 }
%emit_arcs_args_ty = type { i32, i64* }

!51 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!52 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !4, line: 231, baseType: !5, size: 32, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIEnumerator(name: "ascii_prot", value: 3)
!56 = !DIEnumerator(name: "binary_prot", value: 4)
!57 = !DIEnumerator(name: "negotiating_prot", value: 5)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !4, line: 240, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "local_transport", value: 0)
!61 = !DIEnumerator(name: "tcp_transport", value: 1)
!62 = !DIEnumerator(name: "udp_transport", value: 2)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !4, line: 259, baseType: !5, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!66 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!67 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!68 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "store_item_type", file: !4, line: 276, baseType: !5, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "NOT_STORED", value: 0)
!72 = !DIEnumerator(name: "STORED", value: 1)
!73 = !DIEnumerator(name: "EXISTS", value: 2)
!74 = !DIEnumerator(name: "NOT_FOUND", value: 3)
!75 = !DIEnumerator(name: "TOO_LARGE", value: 4)
!76 = !DIEnumerator(name: "NO_MEMORY", value: 5)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_ret_type", file: !36, line: 44, baseType: !5, size: 32, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "LOGGER_RET_OK", value: 0)
!80 = !DIEnumerator(name: "LOGGER_RET_NOSPACE", value: 1)
!81 = !DIEnumerator(name: "LOGGER_RET_ERR", value: 2)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "delta_result_type", file: !4, line: 280, baseType: !5, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88}
!84 = !DIEnumerator(name: "OK", value: 0)
!85 = !DIEnumerator(name: "NON_NUMERIC", value: 1)
!86 = !DIEnumerator(name: "EOM", value: 2)
!87 = !DIEnumerator(name: "DELTA_ITEM_NOT_FOUND", value: 3)
!88 = !DIEnumerator(name: "DELTA_ITEM_CAS_MISMATCH", value: 4)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reassign_result_type", file: !90, line: 55, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "./slabs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "28867aba1f41c79140864d76faedcb32")
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIEnumerator(name: "REASSIGN_OK", value: 0)
!93 = !DIEnumerator(name: "REASSIGN_RUNNING", value: 1)
!94 = !DIEnumerator(name: "REASSIGN_BADCLASS", value: 2)
!95 = !DIEnumerator(name: "REASSIGN_NOSPARE", value: 3)
!96 = !DIEnumerator(name: "REASSIGN_SRC_DST_SAME", value: 4)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "crawler_run_type", file: !4, line: 601, baseType: !5, size: 32, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "CRAWLER_AUTOEXPIRE", value: 0)
!100 = !DIEnumerator(name: "CRAWLER_EXPIRED", value: 1)
!101 = !DIEnumerator(name: "CRAWLER_METADUMP", value: 2)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "crawler_result_type", file: !103, line: 27, baseType: !5, size: 32, elements: !104)
!103 = !DIFile(filename: "./crawler.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "4dc9e6e54966538ea20b64490631aef9")
!104 = !{!105, !106, !107, !108, !109}
!105 = !DIEnumerator(name: "CRAWLER_OK", value: 0)
!106 = !DIEnumerator(name: "CRAWLER_RUNNING", value: 1)
!107 = !DIEnumerator(name: "CRAWLER_BADCLASS", value: 2)
!108 = !DIEnumerator(name: "CRAWLER_NOTSTARTED", value: 3)
!109 = !DIEnumerator(name: "CRAWLER_ERROR", value: 4)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_add_watcher_ret", file: !36, line: 218, baseType: !5, size: 32, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_TOO_MANY", value: 0)
!113 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_OK", value: 1)
!114 = !DIEnumerator(name: "LOGGER_ADD_WATCHER_FAILED", value: 2)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !116, line: 24, baseType: !5, size: 32, elements: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "630d972ab4324a8e936ce28b39a40b01")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126}
!118 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!119 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!120 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!121 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!122 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!123 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!124 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!125 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!126 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!127 = !{!128, !129, !131, !182, !167, !183, !158, !186, !190, !298, !169, !299}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !4, line: 635, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !4, line: 623, size: 384, elements: !134)
!134 = !{!135, !137, !138, !173, !174, !175, !176, !177, !178, !179, !180}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !4, line: 624, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !4, line: 625, baseType: !136, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !133, file: !4, line: 626, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !4, line: 575, size: 384, elements: !141)
!141 = !{!142, !143, !144, !145, !147, !148, !150, !152, !157, !161, !162}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !4, line: 577, baseType: !139, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !4, line: 578, baseType: !139, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !140, file: !4, line: 580, baseType: !139, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !140, file: !4, line: 581, baseType: !146, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !36, line: 14, baseType: !5)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !140, file: !4, line: 582, baseType: !146, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !140, file: !4, line: 583, baseType: !149, size: 32, offset: 256)
!149 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !140, file: !4, line: 584, baseType: !151, size: 16, offset: 288)
!151 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !140, file: !4, line: 585, baseType: !153, size: 16, offset: 304)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !154, line: 25, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !156, line: 40, baseType: !151)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !140, file: !4, line: 586, baseType: !158, size: 8, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !154, line: 24, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !156, line: 38, baseType: !160)
!160 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !140, file: !4, line: 587, baseType: !158, size: 8, offset: 328)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !4, line: 593, baseType: !163, offset: 384)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, elements: !171)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !4, line: 590, size: 64, elements: !165)
!165 = !{!166, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !164, file: !4, line: 591, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !154, line: 27, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !156, line: 45, baseType: !169)
!169 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !164, file: !4, line: 592, baseType: !130, size: 8)
!171 = !{!172}
!172 = !DISubrange(count: -1)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !4, line: 627, baseType: !149, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !133, file: !4, line: 628, baseType: !149, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !133, file: !4, line: 629, baseType: !149, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !133, file: !4, line: 630, baseType: !151, size: 16, offset: 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !133, file: !4, line: 631, baseType: !153, size: 16, offset: 304)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !133, file: !4, line: 632, baseType: !158, size: 8, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !133, file: !4, line: 633, baseType: !158, size: 8, offset: 328)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !4, line: 634, baseType: !181, offset: 336)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, elements: !171)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !154, line: 26, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !156, line: 42, baseType: !5)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !188, line: 26, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !156, line: 41, baseType: !149)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !36, line: 171, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !36, line: 159, size: 832, elements: !193)
!193 = !{!194, !196, !197, !228, !229, !230, !231, !232, !233, !234, !247}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !36, line: 160, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !36, line: 161, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !192, file: !36, line: 162, baseType: !198, size: 320, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !199, line: 72, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !199, line: 67, size: 320, elements: !201)
!201 = !{!202, !222, !226}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !200, file: !199, line: 69, baseType: !203, size: 320)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !204, line: 22, size: 320, elements: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!205 = !{!206, !207, !208, !209, !210, !211, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !203, file: !204, line: 24, baseType: !149, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !203, file: !204, line: 25, baseType: !5, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !203, file: !204, line: 26, baseType: !149, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !203, file: !204, line: 28, baseType: !5, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !203, file: !204, line: 32, baseType: !149, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !203, file: !204, line: 34, baseType: !212, size: 16, offset: 160)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !203, file: !204, line: 35, baseType: !212, size: 16, offset: 176)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !203, file: !204, line: 36, baseType: !215, size: 128, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !216, line: 53, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !216, line: 49, size: 128, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !217, file: !216, line: 51, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !217, file: !216, line: 52, baseType: !220, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !200, file: !199, line: 70, baseType: !223, size: 320)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 320, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 40)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !200, file: !199, line: 71, baseType: !227, size: 64)
!227 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !192, file: !36, line: 163, baseType: !167, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !192, file: !36, line: 164, baseType: !167, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !192, file: !36, line: 165, baseType: !167, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !192, file: !36, line: 166, baseType: !153, size: 16, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !192, file: !36, line: 167, baseType: !153, size: 16, offset: 656)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !192, file: !36, line: 168, baseType: !153, size: 16, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !36, line: 169, baseType: !235, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !237, line: 18, baseType: !238)
!237 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 4, size: 192, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !238, file: !237, line: 6, baseType: !169, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !238, file: !237, line: 9, baseType: !5, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !238, file: !237, line: 9, baseType: !5, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !238, file: !237, line: 12, baseType: !5, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !238, file: !237, line: 15, baseType: !149, size: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !237, line: 17, baseType: !246, offset: 192)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, elements: !171)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !192, file: !36, line: 170, baseType: !248, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !36, line: 57, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !36, line: 62, size: 256, elements: !252)
!252 = !{!253, !254, !255, !292, !297}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !251, file: !36, line: 63, baseType: !149, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !251, file: !36, line: 64, baseType: !153, size: 16, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !251, file: !36, line: 65, baseType: !256, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !36, line: 59, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !260, !248, !282, !284}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !36, line: 56, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !36, line: 135, size: 320, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !276, !277}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !262, file: !36, line: 136, baseType: !35, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !262, file: !36, line: 137, baseType: !158, size: 8, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !262, file: !36, line: 138, baseType: !153, size: 16, offset: 48)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !262, file: !36, line: 139, baseType: !167, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !262, file: !36, line: 140, baseType: !269, size: 128, offset: 128)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !270, line: 8, size: 128, elements: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!271 = !{!272, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !269, file: !270, line: 10, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !156, line: 160, baseType: !227)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !269, file: !270, line: 11, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !156, line: 162, baseType: !227)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !262, file: !36, line: 141, baseType: !149, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !36, line: 144, baseType: !278, offset: 288)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, elements: !171)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !262, file: !36, line: 142, size: 8, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !279, file: !36, line: 143, baseType: !130, size: 8)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !286)
!286 = !{!287, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !285, file: !288, baseType: !5, size: 32)
!288 = !DIFile(filename: "proto_text.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !285, file: !288, baseType: !5, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !285, file: !288, baseType: !128, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !285, file: !288, baseType: !128, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !251, file: !36, line: 66, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !36, line: 60, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!149, !260, !129}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !36, line: 67, baseType: !129, size: 64, offset: 192)
!298 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !300, line: 46, baseType: !169)
!300 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!301 = !{i32 7, !"Dwarf Version", i32 5}
!302 = !{i32 2, !"Debug Info Version", i32 3}
!303 = !{i32 1, !"wchar_size", i32 4}
!304 = !{i32 7, !"uwtable", i32 1}
!305 = !{!"/home/xuheng/blackbox/llvm-test/memcached/proto_text.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/proto_text.gcda", !0}
!306 = !{!"clang version 14.0.0"}
!307 = distinct !DISubprogram(name: "complete_nread_ascii", scope: !1, file: !1, line: 128, type: !308, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !706)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !4, line: 781, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !4, line: 794, size: 3968, elements: !313)
!313 = !{!314, !318, !319, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !405, !406, !407, !408, !409, !410, !411, !629, !630, !631, !632, !633, !634, !635, !637, !638, !639, !640, !641, !642, !643, !644, !645, !651, !672, !673, !674, !675, !676, !677, !678, !679, !683, !690, !705}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !312, file: !4, line: 795, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !317, line: 16, baseType: !128)
!317 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !312, file: !4, line: 796, baseType: !149, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !312, file: !4, line: 797, baseType: !320, size: 8, offset: 96)
!320 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !312, file: !4, line: 798, baseType: !320, size: 8, offset: 104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !312, file: !4, line: 799, baseType: !320, size: 8, offset: 112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !312, file: !4, line: 800, baseType: !320, size: 8, offset: 120)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !312, file: !4, line: 801, baseType: !320, size: 8, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !312, file: !4, line: 802, baseType: !320, size: 8, offset: 136)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !312, file: !4, line: 803, baseType: !320, size: 8, offset: 144)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !312, file: !4, line: 809, baseType: !3, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !312, file: !4, line: 810, baseType: !21, size: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !312, file: !4, line: 811, baseType: !146, size: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !312, file: !4, line: 812, baseType: !331, size: 1024, offset: 256)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !332, line: 123, size: 1024, elements: !333)
!332 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!333 = !{!334, !365, !375, !376, !379, !402, !403, !404}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !331, file: !332, line: 124, baseType: !335, size: 320)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !332, line: 107, size: 320, elements: !336)
!336 = !{!337, !344, !345, !346, !347, !364}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !335, file: !332, line: 108, baseType: !338, size: 128)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !335, file: !332, line: 108, size: 128, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !338, file: !332, line: 108, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !338, file: !332, line: 108, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !335, file: !332, line: 109, baseType: !212, size: 16, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !335, file: !332, line: 110, baseType: !158, size: 8, offset: 144)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !335, file: !332, line: 111, baseType: !158, size: 8, offset: 152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !335, file: !332, line: 118, baseType: !348, size: 64, offset: 192)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !332, line: 113, size: 64, elements: !349)
!349 = !{!350, !354, !358, !363}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !348, file: !332, line: 114, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !149, !212, !128}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !348, file: !332, line: 115, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !341, !128}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !348, file: !332, line: 116, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362, !128}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !348, file: !332, line: 117, baseType: !355, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !335, file: !332, line: 119, baseType: !128, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !331, file: !332, line: 130, baseType: !366, size: 128, offset: 320)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !332, line: 127, size: 128, elements: !367)
!367 = !{!368, !374}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !366, file: !332, line: 128, baseType: !369, size: 128)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !332, line: 128, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !369, file: !332, line: 128, baseType: !362, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !369, file: !332, line: 128, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !366, file: !332, line: 129, baseType: !149, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !331, file: !332, line: 131, baseType: !149, size: 32, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !331, file: !332, line: 133, baseType: !377, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !332, line: 122, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !331, file: !332, line: 149, baseType: !380, size: 256, offset: 576)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !332, line: 135, size: 256, elements: !381)
!381 = !{!382, !391}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !380, file: !332, line: 140, baseType: !383, size: 256)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !332, line: 137, size: 256, elements: !384)
!384 = !{!385, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !383, file: !332, line: 138, baseType: !386, size: 128)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !332, line: 138, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !386, file: !332, line: 138, baseType: !362, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !386, file: !332, line: 138, baseType: !373, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !383, file: !332, line: 139, baseType: !269, size: 128, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !380, file: !332, line: 148, baseType: !392, size: 256)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !332, line: 143, size: 256, elements: !393)
!393 = !{!394, !399, !400}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !392, file: !332, line: 144, baseType: !395, size: 128)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !332, line: 144, size: 128, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !395, file: !332, line: 144, baseType: !362, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !395, file: !332, line: 144, baseType: !373, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !392, file: !332, line: 145, baseType: !212, size: 16, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !392, file: !332, line: 147, baseType: !401, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !331, file: !332, line: 151, baseType: !212, size: 16, offset: 832)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !331, file: !332, line: 152, baseType: !212, size: 16, offset: 848)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !331, file: !332, line: 153, baseType: !269, size: 128, offset: 896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !312, file: !4, line: 813, baseType: !212, size: 16, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !312, file: !4, line: 814, baseType: !212, size: 16, offset: 1296)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !312, file: !4, line: 816, baseType: !129, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !312, file: !4, line: 817, baseType: !129, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !312, file: !4, line: 818, baseType: !149, size: 32, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !312, file: !4, line: 819, baseType: !149, size: 32, offset: 1504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !312, file: !4, line: 821, baseType: !412, size: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !4, line: 770, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !4, line: 743, size: 9472, elements: !415)
!415 = !{!416, !428, !430, !431, !432, !433, !574, !577, !586, !587, !588, !589, !590, !591, !592, !593, !594, !621, !625}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !414, file: !4, line: 744, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !4, line: 703, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !4, line: 773, size: 192, elements: !420)
!420 = !{!421, !422, !423, !425, !426}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !419, file: !4, line: 774, baseType: !158, size: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !419, file: !4, line: 775, baseType: !158, size: 8, offset: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !4, line: 776, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !4, line: 777, baseType: !424, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !419, file: !4, line: 778, baseType: !427, offset: 192)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, elements: !171)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !414, file: !4, line: 745, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !414, file: !4, line: 746, baseType: !149, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !414, file: !4, line: 747, baseType: !149, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !414, file: !4, line: 748, baseType: !128, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !414, file: !4, line: 749, baseType: !434, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !4, line: 668, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !4, line: 783, size: 1216, elements: !437)
!437 = !{!438, !439, !568, !569, !570}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !436, file: !4, line: 784, baseType: !149, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !436, file: !4, line: 785, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !4, line: 737, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 704, size: 54464, elements: !443)
!443 = !{!444, !446, !447, !448, !449, !504, !533, !536, !562, !563, !564, !565, !566, !567}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !442, file: !4, line: 705, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !199, line: 27, baseType: !169)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !4, line: 706, baseType: !377, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !442, file: !4, line: 707, baseType: !331, size: 1024, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !442, file: !4, line: 709, baseType: !149, size: 32, offset: 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !442, file: !4, line: 714, baseType: !450, size: 51584, offset: 1216)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !4, line: 356, size: 51584, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !497, !501, !502, !503}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !450, file: !4, line: 357, baseType: !198, size: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !450, file: !4, line: 359, baseType: !167, size: 64, offset: 1792)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 2048)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 2112)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !450, file: !4, line: 361, baseType: !167, size: 64, offset: 2176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !450, file: !4, line: 367, baseType: !484, size: 32768, offset: 2240)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 32768, elements: !495)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !4, line: 303, size: 512, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !485, file: !4, line: 305, baseType: !167, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !485, file: !4, line: 305, baseType: !167, size: 64, offset: 448)
!495 = !{!496}
!496 = !DISubrange(count: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !450, file: !4, line: 368, baseType: !498, size: 16384, offset: 35008)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 16384, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !450, file: !4, line: 369, baseType: !167, size: 64, offset: 51392)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !450, file: !4, line: 370, baseType: !167, size: 64, offset: 51456)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !450, file: !4, line: 371, baseType: !167, size: 64, offset: 51520)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !442, file: !4, line: 715, baseType: !505, size: 1152, offset: 52800)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 1152, elements: !531)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !4, line: 701, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !4, line: 694, size: 384, elements: !508)
!508 = !{!509, !510, !523, !524, !529, !530}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !507, file: !4, line: 695, baseType: !128, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !507, file: !4, line: 696, baseType: !511, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !4, line: 670, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !4, line: 669, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !4, line: 687, size: 192, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !517, file: !4, line: 688, baseType: !128, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !517, file: !4, line: 689, baseType: !128, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !517, file: !4, line: 690, baseType: !149, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !517, file: !4, line: 691, baseType: !149, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !507, file: !4, line: 697, baseType: !511, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !507, file: !4, line: 698, baseType: !525, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !4, line: 671, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !434}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !507, file: !4, line: 699, baseType: !525, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !4, line: 700, baseType: !149, size: 32, offset: 320)
!531 = !{!532}
!532 = !DISubrange(count: 3)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !442, file: !4, line: 716, baseType: !534, size: 64, offset: 53952)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !4, line: 716, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !442, file: !4, line: 717, baseType: !537, size: 64, offset: 54016)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !539, line: 39, baseType: !540)
!539 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 22, size: 704, elements: !541)
!541 = !{!542, !543, !544, !557, !558, !559, !560, !561}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !540, file: !539, line: 24, baseType: !198, size: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !539, line: 26, baseType: !129, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !540, file: !539, line: 28, baseType: !545, size: 128, offset: 384)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !539, line: 28, size: 128, elements: !546)
!546 = !{!547, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !545, file: !539, line: 28, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !539, line: 12, size: 64, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !549, file: !539, line: 13, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !539, line: 13, size: 64, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !552, file: !539, line: 13, baseType: !548, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !545, file: !539, line: 28, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !540, file: !539, line: 30, baseType: !299, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !540, file: !539, line: 32, baseType: !149, size: 32, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !540, file: !539, line: 34, baseType: !149, size: 32, offset: 608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !540, file: !539, line: 36, baseType: !149, size: 32, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !540, file: !539, line: 38, baseType: !149, size: 32, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !442, file: !4, line: 718, baseType: !417, size: 64, offset: 54080)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !442, file: !4, line: 719, baseType: !537, size: 64, offset: 54144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !442, file: !4, line: 721, baseType: !128, size: 64, offset: 54208)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !442, file: !4, line: 723, baseType: !190, size: 64, offset: 54272)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !442, file: !4, line: 724, baseType: !128, size: 64, offset: 54336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !442, file: !4, line: 728, baseType: !149, size: 32, offset: 54400)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !436, file: !4, line: 786, baseType: !310, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !436, file: !4, line: 787, baseType: !412, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !4, line: 788, baseType: !571, size: 960, offset: 256)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 960, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 120)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !414, file: !4, line: 751, baseType: !575, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !4, line: 598, baseType: !140)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !414, file: !4, line: 752, baseType: !578, size: 512, offset: 384)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 512, elements: !584)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !580, line: 26, size: 128, elements: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !579, file: !580, line: 28, baseType: !128, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !579, file: !580, line: 29, baseType: !299, size: 64, offset: 64)
!584 = !{!585}
!585 = !DISubrange(count: 4)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !414, file: !4, line: 753, baseType: !149, size: 32, offset: 896)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !414, file: !4, line: 754, baseType: !158, size: 8, offset: 928)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !414, file: !4, line: 755, baseType: !158, size: 8, offset: 936)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !414, file: !4, line: 760, baseType: !320, size: 8, offset: 944)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !414, file: !4, line: 761, baseType: !320, size: 8, offset: 952)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !414, file: !4, line: 763, baseType: !153, size: 16, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !414, file: !4, line: 764, baseType: !153, size: 16, offset: 976)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !414, file: !4, line: 765, baseType: !153, size: 16, offset: 992)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !414, file: !4, line: 766, baseType: !595, size: 224, offset: 1024)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !596, line: 253, size: 224, elements: !597)
!596 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!597 = !{!598, !601, !603, !604, !620}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !595, file: !596, line: 255, baseType: !599, size: 16)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !600, line: 28, baseType: !151)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !595, file: !596, line: 256, baseType: !602, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !596, line: 119, baseType: !153)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !595, file: !596, line: 257, baseType: !184, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !595, file: !596, line: 258, baseType: !605, size: 128, offset: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !596, line: 212, size: 128, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !605, file: !596, line: 219, baseType: !608, size: 128)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !596, line: 214, size: 128, elements: !609)
!609 = !{!610, !614, !618}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !608, file: !596, line: 216, baseType: !611, size: 128)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !608, file: !596, line: 217, baseType: !615, size: 128)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 8)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !608, file: !596, line: 218, baseType: !619, size: 128)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !584)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !595, file: !596, line: 259, baseType: !184, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !414, file: !4, line: 767, baseType: !622, size: 32, offset: 1248)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !623, line: 33, baseType: !624)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !156, line: 209, baseType: !5)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !414, file: !4, line: 769, baseType: !626, size: 8192, offset: 1280)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8192, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !312, file: !4, line: 822, baseType: !412, size: 64, offset: 1600)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !312, file: !4, line: 823, baseType: !129, size: 64, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !312, file: !4, line: 824, baseType: !149, size: 32, offset: 1728)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !312, file: !4, line: 832, baseType: !128, size: 64, offset: 1792)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !312, file: !4, line: 835, baseType: !149, size: 32, offset: 1856)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !312, file: !4, line: 837, baseType: !149, size: 32, offset: 1888)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !312, file: !4, line: 838, baseType: !636, size: 576, offset: 1920)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 576, elements: !531)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !312, file: !4, line: 843, baseType: !5, size: 32, offset: 2496)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !312, file: !4, line: 845, baseType: !53, size: 32, offset: 2528)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !312, file: !4, line: 846, baseType: !58, size: 32, offset: 2560)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !312, file: !4, line: 847, baseType: !63, size: 32, offset: 2592)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !312, file: !4, line: 850, baseType: !149, size: 32, offset: 2624)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !312, file: !4, line: 851, baseType: !595, size: 224, offset: 2656)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !312, file: !4, line: 852, baseType: !622, size: 32, offset: 2880)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !312, file: !4, line: 854, baseType: !320, size: 8, offset: 2912)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !312, file: !4, line: 860, baseType: !646, size: 192, offset: 2944)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !4, line: 856, size: 192, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !646, file: !4, line: 857, baseType: !129, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !4, line: 858, baseType: !299, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !646, file: !4, line: 859, baseType: !299, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !312, file: !4, line: 864, baseType: !652, size: 192, offset: 3136)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !653, line: 164, baseType: !654)
!653 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !653, line: 151, size: 192, elements: !655)
!655 = !{!656, !668}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !654, file: !653, line: 162, baseType: !657, size: 192)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !653, line: 152, size: 192, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !657, file: !653, line: 153, baseType: !158, size: 8)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !657, file: !653, line: 154, baseType: !158, size: 8, offset: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !657, file: !653, line: 155, baseType: !153, size: 16, offset: 16)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !657, file: !653, line: 156, baseType: !158, size: 8, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !657, file: !653, line: 157, baseType: !158, size: 8, offset: 40)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !657, file: !653, line: 158, baseType: !153, size: 16, offset: 48)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !657, file: !653, line: 159, baseType: !184, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !657, file: !653, line: 160, baseType: !184, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !657, file: !653, line: 161, baseType: !167, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !654, file: !653, line: 163, baseType: !669, size: 192)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 192, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 24)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !312, file: !4, line: 865, baseType: !167, size: 64, offset: 3328)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !312, file: !4, line: 866, baseType: !167, size: 64, offset: 3392)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !312, file: !4, line: 867, baseType: !212, size: 16, offset: 3456)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !312, file: !4, line: 868, baseType: !149, size: 32, offset: 3488)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !312, file: !4, line: 869, baseType: !149, size: 32, offset: 3520)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !4, line: 870, baseType: !310, size: 64, offset: 3584)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !312, file: !4, line: 871, baseType: !440, size: 64, offset: 3648)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !312, file: !4, line: 872, baseType: !680, size: 64, offset: 3712)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!149, !310}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !312, file: !4, line: 873, baseType: !684, size: 64, offset: 3776)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !310, !128, !299}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !688, line: 108, baseType: !689)
!688 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !156, line: 193, baseType: !227)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !312, file: !4, line: 874, baseType: !691, size: 64, offset: 3840)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!687, !310, !694, !149}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !623, line: 257, size: 448, elements: !696)
!696 = !{!697, !698, !699, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !695, file: !623, line: 259, baseType: !128, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !695, file: !623, line: 260, baseType: !622, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !695, file: !623, line: 262, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !695, file: !623, line: 263, baseType: !299, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !695, file: !623, line: 265, baseType: !128, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !695, file: !623, line: 266, baseType: !299, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !695, file: !623, line: 271, baseType: !149, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !312, file: !4, line: 875, baseType: !684, size: 64, offset: 3904)
!706 = !{!707, !708, !709, !710, !711, !712, !718}
!707 = !DILocalVariable(name: "c", arg: 1, scope: !307, file: !1, line: 128, type: !310)
!708 = !DILocalVariable(name: "it", scope: !307, file: !1, line: 131, type: !575)
!709 = !DILocalVariable(name: "comm", scope: !307, file: !1, line: 132, type: !149)
!710 = !DILocalVariable(name: "ret", scope: !307, file: !1, line: 133, type: !69)
!711 = !DILocalVariable(name: "is_valid", scope: !307, file: !1, line: 134, type: !320)
!712 = !DILocalVariable(name: "buf", scope: !713, file: !1, line: 145, type: !715)
!713 = distinct !DILexicalBlock(scope: !714, file: !1, line: 144, column: 12)
!714 = distinct !DILexicalBlock(scope: !307, file: !1, line: 140, column: 9)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 16, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 2)
!718 = !DILocalVariable(name: "ch", scope: !713, file: !1, line: 147, type: !131)
!719 = !DILocation(line: 0, scope: !307)
!720 = !DILocation(line: 129, column: 5, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 129, column: 5)
!722 = distinct !DILexicalBlock(scope: !307, file: !1, line: 129, column: 5)
!723 = !DILocation(line: 129, column: 5, scope: !722)
!724 = !DILocation(line: 131, column: 19, scope: !307)
!725 = !{!726, !727, i64 224}
!726 = !{!"conn", !727, i64 0, !730, i64 8, !731, i64 12, !731, i64 13, !731, i64 14, !731, i64 15, !731, i64 16, !731, i64 17, !731, i64 18, !728, i64 20, !728, i64 24, !730, i64 28, !732, i64 32, !735, i64 160, !735, i64 162, !727, i64 168, !727, i64 176, !730, i64 184, !730, i64 188, !727, i64 192, !727, i64 200, !727, i64 208, !730, i64 216, !727, i64 224, !730, i64 232, !730, i64 236, !728, i64 240, !730, i64 312, !728, i64 316, !728, i64 320, !728, i64 324, !730, i64 328, !738, i64 332, !730, i64 360, !731, i64 364, !740, i64 368, !728, i64 392, !737, i64 416, !737, i64 424, !735, i64 432, !730, i64 436, !730, i64 440, !727, i64 448, !727, i64 456, !727, i64 464, !727, i64 472, !727, i64 480, !727, i64 488}
!727 = !{!"any pointer", !728, i64 0}
!728 = !{!"omnipotent char", !729, i64 0}
!729 = !{!"Simple C/C++ TBAA"}
!730 = !{!"int", !728, i64 0}
!731 = !{!"_Bool", !728, i64 0}
!732 = !{!"event", !733, i64 0, !728, i64 40, !730, i64 56, !727, i64 64, !728, i64 72, !735, i64 104, !735, i64 106, !736, i64 112}
!733 = !{!"event_callback", !734, i64 0, !735, i64 16, !728, i64 18, !728, i64 19, !728, i64 24, !727, i64 32}
!734 = !{!"", !727, i64 0, !727, i64 8}
!735 = !{!"short", !728, i64 0}
!736 = !{!"timeval", !737, i64 0, !737, i64 8}
!737 = !{!"long", !728, i64 0}
!738 = !{!"sockaddr_in6", !735, i64 0, !735, i64 2, !730, i64 4, !739, i64 8, !730, i64 24}
!739 = !{!"in6_addr", !728, i64 0}
!740 = !{!"", !727, i64 0, !737, i64 8, !737, i64 16}
!741 = !DILocation(line: 132, column: 19, scope: !307)
!742 = !{!726, !735, i64 432}
!743 = !DILocation(line: 132, column: 16, scope: !307)
!744 = !DILocation(line: 136, column: 28, scope: !307)
!745 = !{!726, !727, i64 456}
!746 = !DILocation(line: 136, column: 42, scope: !307)
!747 = !DILocation(line: 136, column: 5, scope: !307)
!748 = !DILocation(line: 137, column: 8, scope: !307)
!749 = !DILocation(line: 137, column: 33, scope: !307)
!750 = !{!728, !728, i64 0}
!751 = !DILocation(line: 137, column: 49, scope: !307)
!752 = !DILocation(line: 137, column: 57, scope: !307)
!753 = !{!754, !737, i64 0}
!754 = !{!"slab_stats", !737, i64 0, !737, i64 8, !737, i64 16, !737, i64 24, !737, i64 32, !737, i64 40, !737, i64 48, !737, i64 56}
!755 = !DILocation(line: 138, column: 44, scope: !307)
!756 = !DILocation(line: 138, column: 5, scope: !307)
!757 = !DILocation(line: 140, column: 14, scope: !714)
!758 = !{!735, !735, i64 0}
!759 = !DILocation(line: 140, column: 10, scope: !714)
!760 = !DILocation(line: 140, column: 23, scope: !714)
!761 = !DILocation(line: 140, column: 39, scope: !714)
!762 = !DILocation(line: 140, column: 9, scope: !307)
!763 = !DILocation(line: 141, column: 21, scope: !764)
!764 = distinct !DILexicalBlock(scope: !765, file: !1, line: 141, column: 13)
!765 = distinct !DILexicalBlock(scope: !714, file: !1, line: 140, column: 45)
!766 = !DILocation(line: 141, column: 41, scope: !764)
!767 = !{!730, !730, i64 0}
!768 = !DILocation(line: 141, column: 35, scope: !764)
!769 = !DILocation(line: 141, column: 48, scope: !764)
!770 = !DILocation(line: 141, column: 13, scope: !764)
!771 = !DILocation(line: 141, column: 64, scope: !764)
!772 = !DILocation(line: 141, column: 13, scope: !765)
!773 = !DILocation(line: 142, column: 22, scope: !774)
!774 = distinct !DILexicalBlock(scope: !764, file: !1, line: 141, column: 70)
!775 = !DILocation(line: 168, column: 9, scope: !307)
!776 = !DILocation(line: 145, column: 9, scope: !713)
!777 = !DILocation(line: 145, column: 14, scope: !713)
!778 = !DILocation(line: 147, column: 44, scope: !713)
!779 = !{!726, !727, i64 208}
!780 = !DILocation(line: 0, scope: !713)
!781 = !DILocation(line: 148, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !1, line: 148, column: 9)
!783 = distinct !DILexicalBlock(scope: !713, file: !1, line: 148, column: 9)
!784 = !DILocation(line: 148, column: 9, scope: !783)
!785 = !DILocation(line: 152, column: 22, scope: !786)
!786 = distinct !DILexicalBlock(scope: !713, file: !1, line: 152, column: 13)
!787 = !DILocation(line: 152, column: 13, scope: !713)
!788 = !DILocation(line: 153, column: 22, scope: !789)
!789 = distinct !DILexicalBlock(scope: !786, file: !1, line: 152, column: 27)
!790 = !DILocation(line: 153, column: 35, scope: !789)
!791 = !DILocation(line: 153, column: 40, scope: !789)
!792 = !DILocation(line: 153, column: 20, scope: !789)
!793 = !DILocation(line: 155, column: 9, scope: !789)
!794 = !DILocation(line: 156, column: 13, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 156, column: 13)
!796 = distinct !DILexicalBlock(scope: !797, file: !1, line: 156, column: 13)
!797 = distinct !DILexicalBlock(scope: !786, file: !1, line: 155, column: 16)
!798 = !{!727, !727, i64 0}
!799 = !DILocation(line: 156, column: 13, scope: !796)
!800 = !DILocation(line: 157, column: 13, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !1, line: 157, column: 13)
!802 = distinct !DILexicalBlock(scope: !797, file: !1, line: 157, column: 13)
!803 = !DILocation(line: 157, column: 13, scope: !802)
!804 = !DILocation(line: 158, column: 22, scope: !797)
!805 = !DILocation(line: 158, column: 26, scope: !797)
!806 = !DILocation(line: 158, column: 47, scope: !797)
!807 = !DILocation(line: 158, column: 52, scope: !797)
!808 = !DILocation(line: 158, column: 20, scope: !797)
!809 = !DILocation(line: 159, column: 35, scope: !797)
!810 = !DILocation(line: 0, scope: !786)
!811 = !DILocation(line: 161, column: 13, scope: !812)
!812 = distinct !DILexicalBlock(scope: !713, file: !1, line: 161, column: 13)
!813 = !DILocation(line: 161, column: 37, scope: !812)
!814 = !DILocation(line: 161, column: 13, scope: !713)
!815 = !DILocation(line: 166, column: 5, scope: !714)
!816 = !DILocation(line: 164, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 164, column: 13)
!818 = distinct !DILexicalBlock(scope: !819, file: !1, line: 164, column: 13)
!819 = distinct !DILexicalBlock(scope: !812, file: !1, line: 163, column: 16)
!820 = !DILocation(line: 170, column: 16, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !1, line: 170, column: 13)
!822 = distinct !DILexicalBlock(scope: !823, file: !1, line: 168, column: 20)
!823 = distinct !DILexicalBlock(scope: !307, file: !1, line: 168, column: 9)
!824 = !{!726, !731, i64 15}
!825 = !{i8 0, i8 2}
!826 = !DILocation(line: 170, column: 13, scope: !822)
!827 = !DILocation(line: 171, column: 13, scope: !828)
!828 = distinct !DILexicalBlock(scope: !821, file: !1, line: 170, column: 26)
!829 = !DILocation(line: 171, column: 16, scope: !828)
!830 = !DILocation(line: 171, column: 24, scope: !828)
!831 = !{!726, !731, i64 364}
!832 = !DILocation(line: 172, column: 9, scope: !828)
!833 = !DILocation(line: 173, column: 20, scope: !822)
!834 = !DILocation(line: 173, column: 9, scope: !822)
!835 = !DILocation(line: 174, column: 5, scope: !822)
!836 = !DILocation(line: 175, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !823, file: !1, line: 174, column: 12)
!838 = !DILocation(line: 207, column: 14, scope: !839)
!839 = distinct !DILexicalBlock(scope: !837, file: !1, line: 207, column: 11)
!840 = !DILocation(line: 207, column: 11, scope: !837)
!841 = !DILocation(line: 208, column: 26, scope: !842)
!842 = distinct !DILexicalBlock(scope: !839, file: !1, line: 207, column: 24)
!843 = !DILocation(line: 208, column: 11, scope: !842)
!844 = !DILocation(line: 209, column: 7, scope: !842)
!845 = !DILocation(line: 210, column: 11, scope: !846)
!846 = distinct !DILexicalBlock(scope: !839, file: !1, line: 209, column: 14)
!847 = !DILocation(line: 212, column: 26, scope: !848)
!848 = distinct !DILexicalBlock(scope: !846, file: !1, line: 210, column: 24)
!849 = !DILocation(line: 212, column: 15, scope: !848)
!850 = !DILocation(line: 213, column: 15, scope: !848)
!851 = !DILocation(line: 215, column: 26, scope: !848)
!852 = !DILocation(line: 215, column: 15, scope: !848)
!853 = !DILocation(line: 216, column: 15, scope: !848)
!854 = !DILocation(line: 218, column: 26, scope: !848)
!855 = !DILocation(line: 218, column: 15, scope: !848)
!856 = !DILocation(line: 219, column: 15, scope: !848)
!857 = !DILocation(line: 221, column: 26, scope: !848)
!858 = !DILocation(line: 221, column: 15, scope: !848)
!859 = !DILocation(line: 222, column: 15, scope: !848)
!860 = !DILocation(line: 224, column: 26, scope: !848)
!861 = !DILocation(line: 224, column: 15, scope: !848)
!862 = !DILocation(line: 225, column: 11, scope: !848)
!863 = !DILocation(line: 230, column: 8, scope: !307)
!864 = !DILocation(line: 230, column: 18, scope: !307)
!865 = !{!726, !731, i64 14}
!866 = !DILocation(line: 231, column: 8, scope: !307)
!867 = !DILocation(line: 231, column: 17, scope: !307)
!868 = !DILocation(line: 232, column: 20, scope: !307)
!869 = !DILocation(line: 232, column: 5, scope: !307)
!870 = !DILocation(line: 233, column: 13, scope: !307)
!871 = !DILocation(line: 234, column: 1, scope: !307)
!872 = !DISubprogram(name: "pthread_mutex_lock", scope: !873, file: !873, line: 738, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!873 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!874 = !DISubroutineType(types: !875)
!875 = !{!149, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!877 = !{}
!878 = !DISubprogram(name: "pthread_mutex_unlock", scope: !873, file: !873, line: 756, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!879 = !DISubprogram(name: "strncmp", scope: !880, file: !880, line: 140, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!880 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!881 = !DISubroutineType(types: !882)
!882 = !{!149, !883, !883, !299}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!885 = !DISubprogram(name: "out_string", scope: !4, file: !4, line: 1007, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !310, !883}
!888 = !DISubprogram(name: "store_item", scope: !4, file: !4, line: 1004, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!889 = !DISubroutineType(types: !890)
!890 = !{!69, !575, !149, !310}
!891 = distinct !DISubprogram(name: "_finalize_mset", scope: !1, file: !1, line: 54, type: !892, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !894)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !310, !69}
!894 = !{!895, !896, !897, !898, !899, !900, !901}
!895 = !DILocalVariable(name: "c", arg: 1, scope: !891, file: !1, line: 54, type: !310)
!896 = !DILocalVariable(name: "ret", arg: 2, scope: !891, file: !1, line: 54, type: !69)
!897 = !DILocalVariable(name: "resp", scope: !891, file: !1, line: 55, type: !412)
!898 = !DILocalVariable(name: "it", scope: !891, file: !1, line: 56, type: !575)
!899 = !DILocalVariable(name: "p", scope: !891, file: !1, line: 60, type: !129)
!900 = !DILocalVariable(name: "end", scope: !891, file: !1, line: 61, type: !129)
!901 = !DILocalVariable(name: "fp", scope: !902, file: !1, line: 91, type: !129)
!902 = distinct !DILexicalBlock(scope: !891, file: !1, line: 91, column: 5)
!903 = !DILocation(line: 0, scope: !891)
!904 = !DILocation(line: 55, column: 24, scope: !891)
!905 = !{!726, !727, i64 192}
!906 = !DILocation(line: 56, column: 19, scope: !891)
!907 = !DILocation(line: 57, column: 5, scope: !891)
!908 = !DILocation(line: 60, column: 15, scope: !891)
!909 = !DILocation(line: 60, column: 34, scope: !891)
!910 = !{!911, !730, i64 16}
!911 = !{!"_mc_resp", !727, i64 0, !727, i64 8, !730, i64 16, !730, i64 20, !727, i64 24, !727, i64 32, !727, i64 40, !728, i64 48, !730, i64 112, !728, i64 116, !728, i64 117, !731, i64 118, !731, i64 119, !735, i64 120, !735, i64 122, !735, i64 124, !738, i64 128, !730, i64 156, !728, i64 160}
!912 = !DILocation(line: 60, column: 26, scope: !891)
!913 = !DILocation(line: 63, column: 5, scope: !891)
!914 = !DILocation(line: 65, column: 20, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !1, line: 65, column: 11)
!916 = distinct !DILexicalBlock(scope: !891, file: !1, line: 63, column: 18)
!917 = !{!918, !731, i64 255}
!918 = !{!"settings", !737, i64 0, !730, i64 8, !730, i64 12, !730, i64 16, !727, i64 24, !730, i64 32, !730, i64 36, !737, i64 40, !730, i64 48, !727, i64 56, !727, i64 64, !730, i64 72, !919, i64 80, !730, i64 88, !730, i64 92, !730, i64 96, !728, i64 100, !730, i64 104, !730, i64 108, !731, i64 112, !728, i64 116, !730, i64 120, !730, i64 124, !730, i64 128, !730, i64 132, !730, i64 136, !731, i64 140, !731, i64 141, !731, i64 142, !731, i64 143, !731, i64 144, !731, i64 145, !730, i64 148, !919, i64 152, !730, i64 160, !730, i64 164, !731, i64 168, !730, i64 172, !731, i64 176, !731, i64 177, !727, i64 184, !730, i64 192, !730, i64 196, !730, i64 200, !730, i64 204, !919, i64 208, !919, i64 216, !730, i64 224, !731, i64 228, !730, i64 232, !730, i64 236, !730, i64 240, !730, i64 244, !730, i64 248, !731, i64 252, !731, i64 253, !731, i64 254, !731, i64 255, !730, i64 256, !730, i64 260, !730, i64 264, !730, i64 268, !730, i64 272, !730, i64 276, !730, i64 280, !730, i64 284, !730, i64 288, !730, i64 292, !919, i64 296, !919, i64 304, !731, i64 312, !730, i64 316, !730, i64 320, !727, i64 328, !730, i64 336}
!919 = !{!"double", !728, i64 0}
!920 = !DILocation(line: 65, column: 11, scope: !916)
!921 = !DILocation(line: 66, column: 18, scope: !922)
!922 = distinct !DILexicalBlock(scope: !915, file: !1, line: 65, column: 39)
!923 = !DILocation(line: 67, column: 7, scope: !922)
!924 = !DILocation(line: 68, column: 18, scope: !925)
!925 = distinct !DILexicalBlock(scope: !915, file: !1, line: 67, column: 14)
!926 = !DILocation(line: 0, scope: !915)
!927 = !DILocation(line: 71, column: 14, scope: !928)
!928 = distinct !DILexicalBlock(scope: !916, file: !1, line: 71, column: 11)
!929 = !DILocation(line: 71, column: 11, scope: !916)
!930 = !DILocation(line: 72, column: 11, scope: !931)
!931 = distinct !DILexicalBlock(scope: !928, file: !1, line: 71, column: 23)
!932 = !DILocation(line: 72, column: 17, scope: !931)
!933 = !DILocation(line: 72, column: 22, scope: !931)
!934 = !{!911, !731, i64 118}
!935 = !DILocation(line: 73, column: 7, scope: !931)
!936 = !DILocation(line: 76, column: 14, scope: !916)
!937 = !DILocation(line: 76, column: 7, scope: !916)
!938 = !DILocation(line: 77, column: 7, scope: !916)
!939 = !DILocation(line: 79, column: 14, scope: !916)
!940 = !DILocation(line: 79, column: 7, scope: !916)
!941 = !DILocation(line: 80, column: 7, scope: !916)
!942 = !DILocation(line: 82, column: 14, scope: !916)
!943 = !DILocation(line: 82, column: 7, scope: !916)
!944 = !DILocation(line: 83, column: 7, scope: !916)
!945 = !DILocation(line: 85, column: 7, scope: !916)
!946 = !DILocation(line: 85, column: 10, scope: !916)
!947 = !DILocation(line: 85, column: 18, scope: !916)
!948 = !DILocation(line: 86, column: 7, scope: !916)
!949 = !DILocation(line: 87, column: 7, scope: !916)
!950 = !DILocation(line: 89, column: 7, scope: !891)
!951 = !DILocation(line: 0, scope: !902)
!952 = !DILocation(line: 91, column: 36, scope: !953)
!953 = distinct !DILexicalBlock(scope: !902, file: !1, line: 91, column: 5)
!954 = !DILocation(line: 91, column: 5, scope: !902)
!955 = !DILocation(line: 117, column: 5, scope: !891)
!956 = !DILocation(line: 118, column: 7, scope: !891)
!957 = !DILocation(line: 120, column: 22, scope: !891)
!958 = !DILocation(line: 120, column: 20, scope: !891)
!959 = !DILocation(line: 120, column: 18, scope: !891)
!960 = !DILocation(line: 121, column: 31, scope: !891)
!961 = !DILocation(line: 121, column: 29, scope: !891)
!962 = !DILocation(line: 121, column: 5, scope: !891)
!963 = !DILocation(line: 122, column: 1, scope: !891)
!964 = !DILocation(line: 92, column: 17, scope: !965)
!965 = distinct !DILexicalBlock(scope: !953, file: !1, line: 91, column: 49)
!966 = !DILocation(line: 92, column: 9, scope: !965)
!967 = !DILocation(line: 95, column: 17, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !1, line: 95, column: 17)
!969 = distinct !DILexicalBlock(scope: !965, file: !1, line: 92, column: 22)
!970 = !DILocation(line: 0, scope: !969)
!971 = !DILocation(line: 96, column: 27, scope: !969)
!972 = !DILocation(line: 96, column: 33, scope: !969)
!973 = !DILocation(line: 96, column: 37, scope: !969)
!974 = !DILocation(line: 96, column: 36, scope: !969)
!975 = !DILocation(line: 96, column: 40, scope: !969)
!976 = !DILocation(line: 96, column: 17, scope: !969)
!977 = !DILocation(line: 97, column: 27, scope: !978)
!978 = distinct !DILexicalBlock(scope: !969, file: !1, line: 96, column: 48)
!979 = !DILocation(line: 97, column: 26, scope: !978)
!980 = !DILocation(line: 97, column: 24, scope: !978)
!981 = !DILocation(line: 99, column: 23, scope: !978)
!982 = distinct !{!982, !976, !983, !984}
!983 = !DILocation(line: 100, column: 17, scope: !969)
!984 = !{!"llvm.loop.mustprogress"}
!985 = !DILocation(line: 101, column: 17, scope: !969)
!986 = !DILocation(line: 104, column: 17, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !1, line: 104, column: 17)
!988 = distinct !DILexicalBlock(scope: !969, file: !1, line: 104, column: 17)
!989 = !DILocation(line: 104, column: 17, scope: !990)
!990 = distinct !DILexicalBlock(scope: !988, file: !1, line: 104, column: 17)
!991 = !DILocation(line: 104, column: 17, scope: !988)
!992 = !DILocation(line: 104, column: 17, scope: !993)
!993 = distinct !DILexicalBlock(scope: !990, file: !1, line: 104, column: 17)
!994 = !DILocation(line: 104, column: 17, scope: !995)
!995 = distinct !DILexicalBlock(scope: !990, file: !1, line: 104, column: 17)
!996 = !DILocation(line: 109, column: 17, scope: !997)
!997 = distinct !DILexicalBlock(scope: !969, file: !1, line: 109, column: 17)
!998 = !DILocation(line: 110, column: 33, scope: !969)
!999 = !{!726, !737, i64 416}
!1000 = !DILocation(line: 110, column: 21, scope: !969)
!1001 = !DILocation(line: 111, column: 17, scope: !969)
!1002 = !DILocation(line: 113, column: 17, scope: !969)
!1003 = !DILocation(line: 91, column: 16, scope: !902)
!1004 = !DILocation(line: 91, column: 45, scope: !953)
!1005 = distinct !{!1005, !954, !1006, !984}
!1006 = !DILocation(line: 115, column: 5, scope: !902)
!1007 = !DISubprogram(name: "item_remove", scope: !4, file: !4, line: 978, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !877)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !575}
!1010 = distinct !DISubprogram(name: "try_read_command_asciiauth", scope: !1, file: !1, line: 326, type: !681, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1011)
!1011 = !{!1012, !1013, !1020, !1021, !1022, !1025}
!1012 = !DILocalVariable(name: "c", arg: 1, scope: !1010, file: !1, line: 326, type: !310)
!1013 = !DILocalVariable(name: "tokens", scope: !1010, file: !1, line: 327, type: !1014)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 3072, elements: !670)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_t", file: !1, line: 52, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "token_s", file: !1, line: 49, size: 128, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1016, file: !1, line: 50, baseType: !129, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1016, file: !1, line: 51, baseType: !299, size: 64, offset: 64)
!1020 = !DILocalVariable(name: "ntokens", scope: !1010, file: !1, line: 328, type: !299)
!1021 = !DILocalVariable(name: "cont", scope: !1010, file: !1, line: 329, type: !129)
!1022 = !DILocalVariable(name: "el", scope: !1023, file: !1, line: 333, type: !129)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 332, column: 27)
!1024 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 332, column: 9)
!1025 = !DILocalVariable(name: "size", scope: !1023, file: !1, line: 334, type: !184)
!1026 = !DILocation(line: 0, scope: !1010)
!1027 = !DILocation(line: 327, column: 5, scope: !1010)
!1028 = !DILocation(line: 327, column: 13, scope: !1010)
!1029 = !DILocation(line: 332, column: 13, scope: !1024)
!1030 = !{!726, !731, i64 12}
!1031 = !DILocation(line: 332, column: 9, scope: !1010)
!1032 = !DILocation(line: 384, column: 24, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 384, column: 9)
!1034 = !{!726, !730, i64 216}
!1035 = !DILocation(line: 334, column: 9, scope: !1023)
!1036 = !DILocation(line: 0, scope: !1023)
!1037 = !DILocation(line: 334, column: 18, scope: !1023)
!1038 = !DILocation(line: 337, column: 16, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 337, column: 13)
!1040 = !{!726, !730, i64 188}
!1041 = !DILocation(line: 337, column: 23, scope: !1039)
!1042 = !DILocation(line: 337, column: 13, scope: !1023)
!1043 = !DILocation(line: 338, column: 13, scope: !1039)
!1044 = !DILocation(line: 340, column: 24, scope: !1023)
!1045 = !{!726, !727, i64 176}
!1046 = !DILocation(line: 340, column: 37, scope: !1023)
!1047 = !DILocation(line: 340, column: 14, scope: !1023)
!1048 = !DILocation(line: 343, column: 14, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 343, column: 13)
!1050 = !DILocation(line: 343, column: 13, scope: !1023)
!1051 = !DILocation(line: 344, column: 27, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !1, line: 344, column: 17)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !1, line: 343, column: 18)
!1054 = !DILocation(line: 344, column: 17, scope: !1053)
!1055 = !DILocation(line: 345, column: 32, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 344, column: 35)
!1057 = !DILocation(line: 345, column: 17, scope: !1056)
!1058 = !DILocation(line: 346, column: 17, scope: !1056)
!1059 = !DILocation(line: 348, column: 13, scope: !1053)
!1060 = !DILocation(line: 356, column: 13, scope: !1023)
!1061 = !DILocation(line: 358, column: 39, scope: !1023)
!1062 = !DILocation(line: 358, column: 46, scope: !1023)
!1063 = !DILocation(line: 358, column: 19, scope: !1023)
!1064 = !DILocation(line: 360, column: 31, scope: !1023)
!1065 = !DILocation(line: 360, column: 26, scope: !1023)
!1066 = !DILocation(line: 360, column: 38, scope: !1023)
!1067 = !DILocation(line: 360, column: 19, scope: !1023)
!1068 = !DILocation(line: 361, column: 25, scope: !1023)
!1069 = !DILocation(line: 361, column: 37, scope: !1023)
!1070 = !DILocation(line: 361, column: 18, scope: !1023)
!1071 = !DILocation(line: 364, column: 21, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 364, column: 13)
!1073 = !DILocation(line: 365, column: 17, scope: !1072)
!1074 = !DILocation(line: 365, column: 27, scope: !1072)
!1075 = !DILocation(line: 365, column: 37, scope: !1072)
!1076 = !{!1077, !727, i64 0}
!1077 = !{!"token_s", !727, i64 0, !737, i64 8}
!1078 = !DILocation(line: 365, column: 20, scope: !1072)
!1079 = !DILocation(line: 365, column: 51, scope: !1072)
!1080 = !DILocation(line: 366, column: 17, scope: !1072)
!1081 = !DILocation(line: 366, column: 34, scope: !1072)
!1082 = !DILocation(line: 366, column: 44, scope: !1072)
!1083 = !DILocation(line: 366, column: 21, scope: !1072)
!1084 = !DILocation(line: 364, column: 13, scope: !1023)
!1085 = !DILocation(line: 367, column: 21, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !1, line: 367, column: 17)
!1087 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 366, column: 59)
!1088 = !DILocation(line: 367, column: 18, scope: !1086)
!1089 = !DILocation(line: 367, column: 17, scope: !1087)
!1090 = !DILocation(line: 368, column: 22, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 368, column: 21)
!1092 = distinct !DILexicalBlock(scope: !1086, file: !1, line: 367, column: 27)
!1093 = !DILocation(line: 368, column: 21, scope: !1092)
!1094 = !DILocation(line: 369, column: 36, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !1, line: 368, column: 37)
!1096 = !DILocation(line: 369, column: 21, scope: !1095)
!1097 = !DILocation(line: 370, column: 21, scope: !1095)
!1098 = !DILocation(line: 372, column: 13, scope: !1092)
!1099 = !DILocation(line: 373, column: 24, scope: !1087)
!1100 = !DILocation(line: 373, column: 13, scope: !1087)
!1101 = !DILocation(line: 374, column: 13, scope: !1087)
!1102 = !DILocation(line: 382, column: 5, scope: !1024)
!1103 = !DILocation(line: 379, column: 22, scope: !1023)
!1104 = !DILocation(line: 379, column: 27, scope: !1023)
!1105 = !DILocation(line: 379, column: 12, scope: !1023)
!1106 = !DILocation(line: 379, column: 20, scope: !1023)
!1107 = !DILocation(line: 381, column: 25, scope: !1023)
!1108 = !DILocation(line: 382, column: 5, scope: !1023)
!1109 = !DILocation(line: 384, column: 12, scope: !1033)
!1110 = !DILocation(line: 384, column: 19, scope: !1033)
!1111 = !DILocation(line: 384, column: 9, scope: !1010)
!1112 = !DILocation(line: 386, column: 9, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 384, column: 33)
!1114 = !DILocation(line: 390, column: 13, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 390, column: 9)
!1116 = !DILocation(line: 390, column: 10, scope: !1115)
!1117 = !DILocation(line: 390, column: 9, scope: !1010)
!1118 = !DILocation(line: 391, column: 14, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !1, line: 391, column: 13)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 390, column: 19)
!1121 = !DILocation(line: 391, column: 13, scope: !1120)
!1122 = !DILocation(line: 392, column: 28, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 391, column: 29)
!1124 = !DILocation(line: 392, column: 13, scope: !1123)
!1125 = !DILocation(line: 393, column: 13, scope: !1123)
!1126 = !DILocation(line: 395, column: 5, scope: !1120)
!1127 = !DILocation(line: 399, column: 21, scope: !1010)
!1128 = !DILocation(line: 399, column: 15, scope: !1010)
!1129 = !DILocation(line: 397, column: 15, scope: !1010)
!1130 = !DILocation(line: 400, column: 14, scope: !1010)
!1131 = !DILocation(line: 401, column: 21, scope: !1010)
!1132 = !DILocation(line: 406, column: 35, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 406, column: 9)
!1134 = !DILocation(line: 406, column: 9, scope: !1133)
!1135 = !DILocation(line: 406, column: 51, scope: !1133)
!1136 = !DILocation(line: 406, column: 9, scope: !1010)
!1137 = !DILocation(line: 407, column: 20, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 406, column: 57)
!1139 = !DILocation(line: 407, column: 9, scope: !1138)
!1140 = !DILocation(line: 408, column: 9, scope: !1138)
!1141 = !DILocation(line: 412, column: 21, scope: !1010)
!1142 = !DILocation(line: 412, column: 5, scope: !1010)
!1143 = !DILocation(line: 412, column: 26, scope: !1010)
!1144 = !DILocation(line: 413, column: 38, scope: !1010)
!1145 = !DILocation(line: 413, column: 15, scope: !1010)
!1146 = !DILocation(line: 415, column: 17, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 415, column: 9)
!1148 = !DILocation(line: 415, column: 9, scope: !1010)
!1149 = !DILocation(line: 416, column: 20, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 415, column: 22)
!1151 = !DILocation(line: 416, column: 9, scope: !1150)
!1152 = !DILocation(line: 417, column: 9, scope: !1150)
!1153 = !DILocation(line: 420, column: 34, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 420, column: 9)
!1155 = !DILocation(line: 420, column: 51, scope: !1154)
!1156 = !DILocation(line: 420, column: 9, scope: !1154)
!1157 = !DILocation(line: 420, column: 58, scope: !1154)
!1158 = !DILocation(line: 420, column: 9, scope: !1010)
!1159 = !DILocation(line: 421, column: 20, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 420, column: 64)
!1161 = !DILocation(line: 421, column: 9, scope: !1160)
!1162 = !DILocation(line: 422, column: 12, scope: !1160)
!1163 = !DILocation(line: 422, column: 26, scope: !1160)
!1164 = !{!726, !731, i64 13}
!1165 = !DILocation(line: 423, column: 12, scope: !1160)
!1166 = !DILocation(line: 423, column: 29, scope: !1160)
!1167 = !{!726, !727, i64 464}
!1168 = !DILocation(line: 424, column: 32, scope: !1160)
!1169 = !DILocation(line: 424, column: 46, scope: !1160)
!1170 = !DILocation(line: 424, column: 9, scope: !1160)
!1171 = !DILocation(line: 425, column: 12, scope: !1160)
!1172 = !DILocation(line: 425, column: 26, scope: !1160)
!1173 = !DILocation(line: 425, column: 35, scope: !1160)
!1174 = !{!1175, !737, i64 312}
!1175 = !{!"", !737, i64 0, !727, i64 8, !732, i64 16, !730, i64 144, !1176, i64 152, !728, i64 6600, !727, i64 6744, !727, i64 6752, !727, i64 6760, !727, i64 6768, !727, i64 6776, !727, i64 6784, !727, i64 6792, !730, i64 6800}
!1176 = !{!"thread_stats", !728, i64 0, !737, i64 40, !737, i64 48, !737, i64 56, !737, i64 64, !737, i64 72, !737, i64 80, !737, i64 88, !737, i64 96, !737, i64 104, !737, i64 112, !737, i64 120, !737, i64 128, !737, i64 136, !737, i64 144, !737, i64 152, !737, i64 160, !737, i64 168, !737, i64 176, !737, i64 184, !737, i64 192, !737, i64 200, !737, i64 208, !737, i64 216, !737, i64 224, !737, i64 232, !737, i64 240, !737, i64 248, !737, i64 256, !737, i64 264, !737, i64 272, !728, i64 280, !728, i64 4376, !737, i64 6424, !737, i64 6432, !737, i64 6440}
!1177 = !DILocation(line: 426, column: 48, scope: !1160)
!1178 = !DILocation(line: 426, column: 9, scope: !1160)
!1179 = !DILocation(line: 427, column: 5, scope: !1160)
!1180 = !DILocation(line: 428, column: 20, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 427, column: 12)
