; ModuleID = 'restart.c'
source_filename = "restart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._restart_data_cb = type { i8*, %struct._restart_data_cb*, i32 (i8*, i8*, i8*)*, i32 (i8*, i8*, i8*)*, [255 x i8] }
%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%emit_function_args_ty = type { i32, i32, i32 }
%emit_arcs_args_ty = type { i32, i64* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.restart_cb_ctx = type { %struct._IO_FILE*, %struct._restart_data_cb*, i8*, i8 }
%struct.timeval = type { i64, i64 }
%struct._stritem = type { %struct._stritem*, %struct._stritem*, %struct._stritem*, i32, i32, i32, i16, i16, i8, i8, [0 x %union.anon] }

!158 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!159 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!160 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!161 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!162 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!163 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!164 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!165 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!166 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!167 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!168 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!169 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!170 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!171 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!172 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!173 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!174 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!175 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!176 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!177 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!178 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!179 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!180 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!181 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!182 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!183 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!184 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!185 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!186 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!187 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!188 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!189 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!190 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!191 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!192 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!193 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!194 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!195 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!196 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!197 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!198 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!199 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!200 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!201 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!202 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!203 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!204 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!205 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!206 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!207 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!208 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!209 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!210 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!211 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!212 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!213 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!214 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!215 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!216 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!217 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!218 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!219 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!220 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!221 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!222 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!223 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!224 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!225 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!226 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!227 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!228 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!229 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!230 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!231 = !{!232, !233, !245, !324, !247, !358, !359}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "restart_cb_ctx", file: !3, line: 65, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 60, size: 256, elements: !236)
!236 = !{!237, !300, !321, !322}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !235, file: !3, line: 61, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!243 = !{!244, !246, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !262, !264, !265, !266, !270, !272, !274, !278, !281, !283, !286, !289, !290, !291, !295, !296}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !245, size: 32)
!245 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !247, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !247, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !247, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !247, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !247, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !247, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !247, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !247, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !247, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !247, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !247, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !260, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !263, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !245, size: 32, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !245, size: 32, offset: 928)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !267, size: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !268, line: 152, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!269 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !271, size: 16, offset: 1024)
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !273, size: 8, offset: 1040)
!273 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !275, size: 8, offset: 1048)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !279, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !282, size: 64, offset: 1152)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !268, line: 153, baseType: !269)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !284, size: 64, offset: 1216)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !287, size: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !263, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !232, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !292, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !293, line: 46, baseType: !294)
!293 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!294 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !245, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !297, size: 160, offset: 1568)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !235, file: !3, line: 62, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "restart_data_cb", file: !3, line: 13, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_restart_data_cb", file: !3, line: 15, size: 2304, elements: !304)
!304 = !{!305, !306, !308, !315, !317}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !3, line: 16, baseType: !232, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !3, line: 17, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ccb", scope: !303, file: !3, line: 18, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "restart_check_cb", file: !6, line: 17, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!245, !313, !232, !232}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scb", scope: !303, file: !3, line: 19, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "restart_save_cb", file: !6, line: 18, baseType: !310)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !303, file: !3, line: 20, baseType: !318, size: 2040, offset: 256)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 2040, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 255)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !235, file: !3, line: 63, baseType: !247, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !235, file: !3, line: 64, baseType: !323, size: 8, offset: 192)
!323 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !326, line: 598, baseType: !327)
!326 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !326, line: 575, size: 384, elements: !328)
!328 = !{!329, !331, !332, !333, !336, !337, !338, !339, !343, !347, !348}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !326, line: 577, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !326, line: 578, baseType: !330, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !327, file: !326, line: 580, baseType: !330, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !327, file: !326, line: 581, baseType: !334, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !335, line: 14, baseType: !7)
!335 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !327, file: !326, line: 582, baseType: !334, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !327, file: !326, line: 583, baseType: !245, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !327, file: !326, line: 584, baseType: !271, size: 16, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !327, file: !326, line: 585, baseType: !340, size: 16, offset: 304)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !341, line: 25, baseType: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !268, line: 40, baseType: !271)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !327, file: !326, line: 586, baseType: !344, size: 8, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !341, line: 24, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !268, line: 38, baseType: !346)
!346 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !327, file: !326, line: 587, baseType: !344, size: 8, offset: 328)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !326, line: 593, baseType: !349, offset: 384)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, elements: !356)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !326, line: 590, size: 64, elements: !351)
!351 = !{!352, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !350, file: !326, line: 591, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !341, line: 27, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !268, line: 45, baseType: !294)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !350, file: !326, line: 592, baseType: !248, size: 8)
!356 = !{!357}
!357 = !DISubrange(count: -1)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_ptr_t", file: !6, line: 8, baseType: !353)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !326, line: 635, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !326, line: 623, size: 384, elements: !362)
!362 = !{!363, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !326, line: 624, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !326, line: 625, baseType: !364, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !361, file: !326, line: 626, baseType: !330, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !326, line: 627, baseType: !245, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !361, file: !326, line: 628, baseType: !245, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !361, file: !326, line: 629, baseType: !245, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !361, file: !326, line: 630, baseType: !271, size: 16, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !361, file: !326, line: 631, baseType: !340, size: 16, offset: 304)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !361, file: !326, line: 632, baseType: !344, size: 8, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !361, file: !326, line: 633, baseType: !344, size: 8, offset: 328)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !326, line: 634, baseType: !375, offset: 336)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, elements: !356)
!376 = !{!0, !377, !379, !381, !383}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "cb_stack", scope: !2, file: !3, line: 29, type: !301, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "mmap_fd", scope: !2, file: !3, line: 24, type: !245, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "mmap_base", scope: !2, file: !3, line: 25, type: !232, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "slabmem_limit", scope: !2, file: !3, line: 26, type: !292, isLocal: true, isDefinition: true)
!385 = !{i32 7, !"Dwarf Version", i32 5}
!386 = !{i32 2, !"Debug Info Version", i32 3}
!387 = !{i32 1, !"wchar_size", i32 4}
!388 = !{i32 7, !"uwtable", i32 1}
!389 = !{!"/home/xuheng/blackbox/llvm-test/memcached/restart.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/restart.gcda", !2}
!390 = !{!"clang version 14.0.0"}
!391 = distinct !DISubprogram(name: "restart_register", scope: !3, file: !3, line: 33, type: !392, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !313, !309, !316, !232}
!394 = !{!395, !396, !397, !398, !399, !400}
!395 = !DILocalVariable(name: "tag", arg: 1, scope: !391, file: !3, line: 33, type: !313)
!396 = !DILocalVariable(name: "ccb", arg: 2, scope: !391, file: !3, line: 33, type: !309)
!397 = !DILocalVariable(name: "scb", arg: 3, scope: !391, file: !3, line: 33, type: !316)
!398 = !DILocalVariable(name: "data", arg: 4, scope: !391, file: !3, line: 33, type: !232)
!399 = !DILocalVariable(name: "cb", scope: !391, file: !3, line: 34, type: !301)
!400 = !DILocalVariable(name: "finder", scope: !401, file: !3, line: 47, type: !301)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 44, column: 12)
!402 = distinct !DILexicalBlock(scope: !391, file: !3, line: 42, column: 9)
!403 = !DILocation(line: 0, scope: !391)
!404 = !DILocation(line: 34, column: 27, scope: !391)
!405 = !DILocation(line: 35, column: 12, scope: !406)
!406 = distinct !DILexicalBlock(scope: !391, file: !3, line: 35, column: 9)
!407 = !DILocation(line: 35, column: 9, scope: !391)
!408 = !DILocation(line: 36, column: 17, scope: !409)
!409 = distinct !DILexicalBlock(scope: !406, file: !3, line: 35, column: 21)
!410 = !{!411, !411, i64 0}
!411 = !{!"any pointer", !412, i64 0}
!412 = !{!"omnipotent char", !413, i64 0}
!413 = !{!"Simple C/C++ TBAA"}
!414 = !DILocation(line: 36, column: 9, scope: !409)
!415 = !DILocation(line: 37, column: 9, scope: !409)
!416 = !DILocation(line: 42, column: 9, scope: !402)
!417 = !DILocation(line: 42, column: 18, scope: !402)
!418 = !DILocation(line: 42, column: 9, scope: !391)
!419 = !DILocation(line: 0, scope: !401)
!420 = !DILocation(line: 48, column: 24, scope: !401)
!421 = !{!422, !411, i64 8}
!422 = !{!"_restart_data_cb", !411, i64 0, !411, i64 8, !411, i64 16, !411, i64 24, !412, i64 32}
!423 = !DILocation(line: 48, column: 29, scope: !401)
!424 = !DILocation(line: 48, column: 9, scope: !401)
!425 = !DILocation(line: 49, column: 22, scope: !426)
!426 = distinct !DILexicalBlock(scope: !401, file: !3, line: 48, column: 38)
!427 = !DILocation(line: 43, column: 20, scope: !428)
!428 = distinct !DILexicalBlock(scope: !402, file: !3, line: 42, column: 27)
!429 = !DILocation(line: 44, column: 5, scope: !428)
!430 = !DILocation(line: 49, column: 30, scope: !426)
!431 = distinct !{!431, !424, !432, !433}
!432 = !DILocation(line: 50, column: 9, scope: !401)
!433 = !{!"llvm.loop.mustprogress"}
!434 = !DILocation(line: 51, column: 24, scope: !401)
!435 = !DILocation(line: 51, column: 22, scope: !401)
!436 = !DILocation(line: 0, scope: !402)
!437 = !DILocation(line: 54, column: 21, scope: !391)
!438 = !DILocation(line: 54, column: 5, scope: !391)
!439 = !DILocation(line: 55, column: 9, scope: !391)
!440 = !DILocation(line: 55, column: 14, scope: !391)
!441 = !{!422, !411, i64 0}
!442 = !DILocation(line: 56, column: 9, scope: !391)
!443 = !DILocation(line: 56, column: 13, scope: !391)
!444 = !{!422, !411, i64 16}
!445 = !DILocation(line: 57, column: 9, scope: !391)
!446 = !DILocation(line: 57, column: 13, scope: !391)
!447 = !{!422, !411, i64 24}
!448 = !DILocation(line: 58, column: 1, scope: !391)
!449 = !DISubprogram(name: "calloc", scope: !450, file: !450, line: 542, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!450 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!451 = !DISubroutineType(types: !452)
!452 = !{!232, !292, !292}
!453 = !{}
!454 = !DISubprogram(name: "fprintf", scope: !455, file: !455, line: 326, type: !456, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!455 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!456 = !DISubroutineType(types: !457)
!457 = !{!245, !458, !459, null}
!458 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!459 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !313)
!460 = !DISubprogram(name: "abort", scope: !450, file: !450, line: 591, type: !461, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !453)
!461 = !DISubroutineType(types: !462)
!462 = !{null}
!463 = !DISubprogram(name: "safe_strcpy", scope: !464, file: !464, line: 22, type: !465, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!464 = !DIFile(filename: "./util.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d1ef68c688867746f50aae7567be079a")
!465 = !DISubroutineType(types: !466)
!466 = !{!323, !247, !313, !467}
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!468 = distinct !DISubprogram(name: "restart_get_kv", scope: !3, file: !3, line: 141, type: !469, scopeLine: 141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !472)
!469 = !DISubroutineType(types: !470)
!470 = !{!5, !232, !471, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !483}
!473 = !DILocalVariable(name: "ctx", arg: 1, scope: !468, file: !3, line: 141, type: !232)
!474 = !DILocalVariable(name: "key", arg: 2, scope: !468, file: !3, line: 141, type: !471)
!475 = !DILocalVariable(name: "val", arg: 3, scope: !468, file: !3, line: 141, type: !471)
!476 = !DILocalVariable(name: "line", scope: !468, file: !3, line: 142, type: !247)
!477 = !DILocalVariable(name: "len", scope: !468, file: !3, line: 143, type: !292)
!478 = !DILocalVariable(name: "cb", scope: !468, file: !3, line: 144, type: !301)
!479 = !DILocalVariable(name: "c", scope: !468, file: !3, line: 145, type: !233)
!480 = !DILocalVariable(name: "p", scope: !481, file: !3, line: 158, type: !247)
!481 = distinct !DILexicalBlock(scope: !482, file: !3, line: 154, column: 43)
!482 = distinct !DILexicalBlock(scope: !468, file: !3, line: 154, column: 9)
!483 = !DILocalVariable(name: "p", scope: !484, file: !3, line: 179, type: !247)
!484 = distinct !DILexicalBlock(scope: !485, file: !3, line: 178, column: 36)
!485 = distinct !DILexicalBlock(scope: !486, file: !3, line: 178, column: 20)
!486 = distinct !DILexicalBlock(scope: !481, file: !3, line: 164, column: 13)
!487 = !DILocation(line: 0, scope: !468)
!488 = !DILocation(line: 142, column: 5, scope: !468)
!489 = !DILocation(line: 142, column: 11, scope: !468)
!490 = !DILocation(line: 143, column: 5, scope: !468)
!491 = !DILocation(line: 143, column: 12, scope: !468)
!492 = !{!493, !493, i64 0}
!493 = !{!"long", !412, i64 0}
!494 = !DILocation(line: 149, column: 12, scope: !495)
!495 = distinct !DILexicalBlock(scope: !468, file: !3, line: 149, column: 9)
!496 = !{!497, !411, i64 16}
!497 = !{!"", !411, i64 0, !411, i64 8, !411, i64 16, !498, i64 24}
!498 = !{!"_Bool", !412, i64 0}
!499 = !DILocation(line: 149, column: 17, scope: !495)
!500 = !DILocation(line: 149, column: 9, scope: !468)
!501 = !DILocation(line: 150, column: 14, scope: !502)
!502 = distinct !DILexicalBlock(scope: !495, file: !3, line: 149, column: 26)
!503 = !DILocation(line: 150, column: 9, scope: !502)
!504 = !DILocation(line: 151, column: 17, scope: !502)
!505 = !DILocation(line: 152, column: 5, scope: !502)
!506 = !DILocation(line: 154, column: 33, scope: !482)
!507 = !{!497, !411, i64 0}
!508 = !DILocation(line: 154, column: 9, scope: !482)
!509 = !DILocation(line: 154, column: 36, scope: !482)
!510 = !DILocation(line: 154, column: 9, scope: !468)
!511 = !DILocation(line: 158, column: 19, scope: !481)
!512 = !DILocation(line: 0, scope: !481)
!513 = !DILocation(line: 159, column: 16, scope: !481)
!514 = !{!412, !412, i64 0}
!515 = !DILocation(line: 159, column: 19, scope: !481)
!516 = !DILocation(line: 159, column: 9, scope: !481)
!517 = !DILocation(line: 160, column: 14, scope: !518)
!518 = distinct !DILexicalBlock(scope: !481, file: !3, line: 159, column: 28)
!519 = distinct !{!519, !516, !520, !433}
!520 = !DILocation(line: 161, column: 9, scope: !481)
!521 = !DILocation(line: 162, column: 12, scope: !481)
!522 = !DILocation(line: 164, column: 13, scope: !486)
!523 = !DILocation(line: 164, column: 13, scope: !481)
!524 = !DILocation(line: 0, scope: !525)
!525 = distinct !DILexicalBlock(scope: !486, file: !3, line: 164, column: 29)
!526 = !DILocation(line: 166, column: 13, scope: !525)
!527 = !DILocation(line: 168, column: 28, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !3, line: 168, column: 21)
!529 = distinct !DILexicalBlock(scope: !525, file: !3, line: 166, column: 32)
!530 = !DILocation(line: 168, column: 21, scope: !528)
!531 = !DILocation(line: 168, column: 45, scope: !528)
!532 = !DILocation(line: 168, column: 21, scope: !529)
!533 = !DILocation(line: 169, column: 21, scope: !534)
!534 = distinct !DILexicalBlock(scope: !528, file: !3, line: 168, column: 51)
!535 = !DILocation(line: 177, column: 16, scope: !525)
!536 = !DILocation(line: 177, column: 19, scope: !525)
!537 = !{!497, !411, i64 8}
!538 = !DILocation(line: 205, column: 5, scope: !482)
!539 = !DILocation(line: 205, column: 5, scope: !481)
!540 = !DILocation(line: 171, column: 22, scope: !529)
!541 = !DILocation(line: 171, column: 26, scope: !529)
!542 = distinct !{!542, !526, !543, !433}
!543 = !DILocation(line: 172, column: 13, scope: !525)
!544 = !DILocation(line: 174, column: 25, scope: !545)
!545 = distinct !DILexicalBlock(scope: !546, file: !3, line: 173, column: 29)
!546 = distinct !DILexicalBlock(scope: !525, file: !3, line: 173, column: 17)
!547 = !DILocation(line: 174, column: 101, scope: !545)
!548 = !DILocation(line: 174, column: 17, scope: !545)
!549 = !DILocation(line: 175, column: 17, scope: !545)
!550 = !DILocation(line: 179, column: 27, scope: !484)
!551 = !DILocation(line: 0, scope: !484)
!552 = !DILocation(line: 181, column: 21, scope: !553)
!553 = distinct !DILexicalBlock(scope: !484, file: !3, line: 181, column: 17)
!554 = !DILocation(line: 181, column: 17, scope: !484)
!555 = !DILocation(line: 182, column: 24, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !3, line: 181, column: 30)
!557 = !DILocation(line: 182, column: 22, scope: !556)
!558 = !DILocation(line: 183, column: 13, scope: !556)
!559 = !DILocation(line: 186, column: 20, scope: !484)
!560 = !DILocation(line: 186, column: 23, scope: !484)
!561 = !DILocation(line: 186, column: 30, scope: !484)
!562 = !DILocation(line: 186, column: 34, scope: !484)
!563 = !DILocation(line: 186, column: 36, scope: !484)
!564 = !DILocation(line: 186, column: 43, scope: !484)
!565 = !DILocation(line: 186, column: 13, scope: !484)
!566 = !DILocation(line: 187, column: 18, scope: !567)
!567 = distinct !DILexicalBlock(scope: !484, file: !3, line: 186, column: 51)
!568 = distinct !{!568, !565, !569, !433}
!569 = !DILocation(line: 188, column: 13, scope: !484)
!570 = !DILocation(line: 189, column: 16, scope: !484)
!571 = !DILocation(line: 193, column: 21, scope: !572)
!572 = distinct !DILexicalBlock(scope: !484, file: !3, line: 193, column: 17)
!573 = !DILocation(line: 193, column: 17, scope: !484)
!574 = !DILocation(line: 190, column: 14, scope: !484)
!575 = !DILocation(line: 194, column: 24, scope: !576)
!576 = distinct !DILexicalBlock(scope: !572, file: !3, line: 193, column: 30)
!577 = !DILocation(line: 194, column: 22, scope: !576)
!578 = !DILocation(line: 195, column: 13, scope: !576)
!579 = !DILocation(line: 196, column: 23, scope: !484)
!580 = !DILocation(line: 196, column: 21, scope: !484)
!581 = !DILocation(line: 201, column: 21, scope: !582)
!582 = distinct !DILexicalBlock(scope: !485, file: !3, line: 199, column: 16)
!583 = !DILocation(line: 201, column: 13, scope: !582)
!584 = !DILocation(line: 202, column: 18, scope: !582)
!585 = !DILocation(line: 202, column: 13, scope: !582)
!586 = !DILocation(line: 203, column: 13, scope: !582)
!587 = !DILocation(line: 207, column: 9, scope: !588)
!588 = distinct !DILexicalBlock(scope: !482, file: !3, line: 205, column: 12)
!589 = !DILocation(line: 207, column: 12, scope: !588)
!590 = !DILocation(line: 207, column: 17, scope: !588)
!591 = !{!497, !498, i64 24}
!592 = !DILocation(line: 211, column: 1, scope: !468)
!593 = !DISubprogram(name: "free", scope: !450, file: !450, line: 565, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !232}
!596 = !DISubprogram(name: "strcmp", scope: !597, file: !597, line: 137, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!597 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!598 = !DISubroutineType(types: !599)
!599 = !{!245, !313, !313}
!600 = distinct !DISubprogram(name: "restart_set_kv", scope: !3, file: !3, line: 268, type: !601, scopeLine: 268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !232, !313, !313, null}
!603 = !{!604, !605, !606, !607, !620, !621, !625}
!604 = !DILocalVariable(name: "ctx", arg: 1, scope: !600, file: !3, line: 268, type: !232)
!605 = !DILocalVariable(name: "key", arg: 2, scope: !600, file: !3, line: 268, type: !313)
!606 = !DILocalVariable(name: "fmt", arg: 3, scope: !600, file: !3, line: 268, type: !313)
!607 = !DILocalVariable(name: "ap", scope: !600, file: !3, line: 269, type: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !455, line: 52, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !610, line: 32, baseType: !611)
!610 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stdarg.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !612, baseType: !613)
!612 = !DIFile(filename: "restart.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 192, elements: !276)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !614, file: !612, line: 269, baseType: !7, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !614, file: !612, line: 269, baseType: !7, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !614, file: !612, line: 269, baseType: !232, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !614, file: !612, line: 269, baseType: !232, size: 64, offset: 128)
!620 = !DILocalVariable(name: "c", scope: !600, file: !3, line: 270, type: !233)
!621 = !DILocalVariable(name: "valbuf", scope: !600, file: !3, line: 271, type: !622)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 32768, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 4096)
!625 = !DILocalVariable(name: "vlen", scope: !600, file: !3, line: 274, type: !245)
!626 = !DILocation(line: 0, scope: !600)
!627 = !DILocation(line: 269, column: 5, scope: !600)
!628 = !DILocation(line: 269, column: 13, scope: !600)
!629 = !DILocation(line: 271, column: 5, scope: !600)
!630 = !DILocation(line: 271, column: 10, scope: !600)
!631 = !DILocation(line: 273, column: 5, scope: !600)
!632 = !DILocation(line: 274, column: 16, scope: !600)
!633 = !DILocation(line: 275, column: 5, scope: !600)
!634 = !DILocation(line: 279, column: 14, scope: !635)
!635 = distinct !DILexicalBlock(scope: !600, file: !3, line: 279, column: 9)
!636 = !DILocation(line: 279, column: 9, scope: !600)
!637 = !DILocation(line: 280, column: 17, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !3, line: 279, column: 30)
!639 = !DILocation(line: 280, column: 9, scope: !638)
!640 = !DILocation(line: 282, column: 9, scope: !638)
!641 = !DILocation(line: 285, column: 16, scope: !600)
!642 = !DILocation(line: 285, column: 5, scope: !600)
!643 = !DILocation(line: 287, column: 1, scope: !600)
!644 = !DISubprogram(name: "vsnprintf", scope: !455, file: !455, line: 358, type: !645, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!645 = !DISubroutineType(types: !646)
!646 = !{!245, !647, !292, !459, !648}
!647 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!649 = distinct !DISubprogram(name: "restart_mmap_open", scope: !3, file: !3, line: 298, type: !650, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !653)
!650 = !DISubroutineType(types: !651)
!651 = !{!323, !467, !313, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!653 = !{!654, !655, !656, !657, !658}
!654 = !DILocalVariable(name: "limit", arg: 1, scope: !649, file: !3, line: 298, type: !467)
!655 = !DILocalVariable(name: "file", arg: 2, scope: !649, file: !3, line: 298, type: !313)
!656 = !DILocalVariable(name: "mem_base", arg: 3, scope: !649, file: !3, line: 298, type: !652)
!657 = !DILocalVariable(name: "reuse_mmap", scope: !649, file: !3, line: 299, type: !323)
!658 = !DILocalVariable(name: "pagesize", scope: !649, file: !3, line: 301, type: !269)
!659 = !DILocation(line: 0, scope: !649)
!660 = !DILocation(line: 301, column: 21, scope: !649)
!661 = !DILocation(line: 302, column: 19, scope: !649)
!662 = !DILocation(line: 302, column: 17, scope: !649)
!663 = !DILocation(line: 303, column: 15, scope: !649)
!664 = !DILocation(line: 303, column: 13, scope: !649)
!665 = !{!666, !666, i64 0}
!666 = !{!"int", !412, i64 0}
!667 = !DILocation(line: 304, column: 17, scope: !668)
!668 = distinct !DILexicalBlock(scope: !649, file: !3, line: 304, column: 9)
!669 = !DILocation(line: 304, column: 9, scope: !649)
!670 = !DILocation(line: 305, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !3, line: 304, column: 24)
!672 = !DILocation(line: 306, column: 9, scope: !671)
!673 = !DILocation(line: 308, column: 9, scope: !674)
!674 = distinct !DILexicalBlock(scope: !649, file: !3, line: 308, column: 9)
!675 = !DILocation(line: 308, column: 35, scope: !674)
!676 = !DILocation(line: 308, column: 9, scope: !649)
!677 = !DILocation(line: 309, column: 9, scope: !678)
!678 = distinct !DILexicalBlock(scope: !674, file: !3, line: 308, column: 41)
!679 = !DILocation(line: 310, column: 9, scope: !678)
!680 = !DILocation(line: 313, column: 15, scope: !681)
!681 = distinct !DILexicalBlock(scope: !649, file: !3, line: 313, column: 9)
!682 = !DILocation(line: 313, column: 9, scope: !649)
!683 = !DILocation(line: 316, column: 17, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !3, line: 313, column: 27)
!685 = !DILocation(line: 316, column: 9, scope: !684)
!686 = !DILocation(line: 317, column: 9, scope: !684)
!687 = !DILocation(line: 319, column: 69, scope: !649)
!688 = !DILocation(line: 319, column: 17, scope: !649)
!689 = !DILocation(line: 319, column: 15, scope: !649)
!690 = !DILocation(line: 320, column: 19, scope: !691)
!691 = distinct !DILexicalBlock(scope: !649, file: !3, line: 320, column: 9)
!692 = !DILocation(line: 320, column: 9, scope: !649)
!693 = !DILocation(line: 321, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !3, line: 320, column: 34)
!695 = !DILocation(line: 322, column: 9, scope: !694)
!696 = !DILocation(line: 325, column: 21, scope: !649)
!697 = !DILocation(line: 325, column: 19, scope: !649)
!698 = !DILocation(line: 326, column: 9, scope: !699)
!699 = distinct !DILexicalBlock(scope: !649, file: !3, line: 326, column: 9)
!700 = !DILocation(line: 326, column: 29, scope: !699)
!701 = !DILocation(line: 326, column: 9, scope: !649)
!702 = !DILocation(line: 327, column: 20, scope: !703)
!703 = distinct !DILexicalBlock(scope: !699, file: !3, line: 326, column: 35)
!704 = !DILocation(line: 328, column: 5, scope: !703)
!705 = !DILocation(line: 329, column: 17, scope: !649)
!706 = !DILocation(line: 329, column: 15, scope: !649)
!707 = !DILocation(line: 331, column: 5, scope: !649)
!708 = distinct !DISubprogram(name: "_find_pagesize", scope: !3, file: !3, line: 289, type: !709, scopeLine: 289, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!709 = !DISubroutineType(types: !710)
!710 = !{!269}
!711 = !DILocation(line: 291, column: 12, scope: !708)
!712 = !DILocation(line: 291, column: 5, scope: !708)
!713 = !DISubprogram(name: "strdup", scope: !597, file: !597, line: 167, type: !714, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!714 = !DISubroutineType(types: !715)
!715 = !{!247, !313}
!716 = !DISubprogram(name: "open", scope: !717, file: !717, line: 168, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!717 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "270596b098606fab5166d0114edf8288")
!718 = !DISubroutineType(types: !719)
!719 = !{!245, !313, !245, null}
!720 = !DISubprogram(name: "perror", scope: !455, file: !455, line: 775, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !313}
!723 = !DISubprogram(name: "ftruncate", scope: !724, file: !724, line: 1014, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!724 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "29bea3f2d65ec3bb874f389bfdfa2266")
!725 = !DISubroutineType(types: !726)
!726 = !{!245, !245, !267}
!727 = !DISubprogram(name: "mmap", scope: !728, file: !728, line: 57, type: !729, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!728 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "2f0ac90c7588adcea5a1a12d771e1e34")
!729 = !DISubroutineType(types: !730)
!730 = !{!232, !232, !292, !245, !245, !245, !267}
!731 = distinct !DISubprogram(name: "restart_check", scope: !3, file: !3, line: 72, type: !732, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{!245, !313}
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742}
!735 = !DILocalVariable(name: "file", arg: 1, scope: !731, file: !3, line: 72, type: !313)
!736 = !DILocalVariable(name: "flen", scope: !731, file: !3, line: 74, type: !292)
!737 = !DILocalVariable(name: "ext", scope: !731, file: !3, line: 75, type: !313)
!738 = !DILocalVariable(name: "metafile", scope: !731, file: !3, line: 76, type: !247)
!739 = !DILocalVariable(name: "f", scope: !731, file: !3, line: 85, type: !238)
!740 = !DILocalVariable(name: "ctx", scope: !731, file: !3, line: 92, type: !234)
!741 = !DILocalVariable(name: "failed", scope: !731, file: !3, line: 111, type: !323)
!742 = !DILocalVariable(name: "cb", scope: !743, file: !3, line: 113, type: !301)
!743 = distinct !DILexicalBlock(scope: !731, file: !3, line: 112, column: 23)
!744 = !DILocation(line: 0, scope: !731)
!745 = !DILocation(line: 74, column: 19, scope: !731)
!746 = !DILocation(line: 76, column: 39, scope: !731)
!747 = !DILocation(line: 76, column: 37, scope: !731)
!748 = !DILocation(line: 76, column: 51, scope: !731)
!749 = !DILocation(line: 76, column: 22, scope: !731)
!750 = !DILocation(line: 77, column: 18, scope: !751)
!751 = distinct !DILexicalBlock(scope: !731, file: !3, line: 77, column: 9)
!752 = !DILocation(line: 77, column: 9, scope: !731)
!753 = !DILocation(line: 79, column: 17, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 77, column: 27)
!755 = !DILocation(line: 79, column: 9, scope: !754)
!756 = !DILocation(line: 80, column: 9, scope: !754)
!757 = !DILocation(line: 82, column: 5, scope: !731)
!758 = !DILocation(line: 83, column: 20, scope: !731)
!759 = !DILocation(line: 83, column: 32, scope: !731)
!760 = !DILocation(line: 83, column: 5, scope: !731)
!761 = !DILocation(line: 85, column: 15, scope: !731)
!762 = !DILocation(line: 86, column: 11, scope: !763)
!763 = distinct !DILexicalBlock(scope: !731, file: !3, line: 86, column: 9)
!764 = !DILocation(line: 86, column: 9, scope: !731)
!765 = !DILocation(line: 87, column: 17, scope: !766)
!766 = distinct !DILexicalBlock(scope: !763, file: !3, line: 86, column: 20)
!767 = !DILocation(line: 87, column: 9, scope: !766)
!768 = !DILocation(line: 88, column: 9, scope: !766)
!769 = !DILocation(line: 89, column: 9, scope: !766)
!770 = !DILocation(line: 92, column: 5, scope: !731)
!771 = !DILocation(line: 92, column: 20, scope: !731)
!772 = !DILocation(line: 94, column: 9, scope: !731)
!773 = !DILocation(line: 94, column: 11, scope: !731)
!774 = !DILocation(line: 95, column: 9, scope: !731)
!775 = !DILocation(line: 95, column: 12, scope: !731)
!776 = !DILocation(line: 96, column: 9, scope: !731)
!777 = !DILocation(line: 96, column: 14, scope: !731)
!778 = !DILocation(line: 97, column: 9, scope: !731)
!779 = !DILocation(line: 97, column: 14, scope: !731)
!780 = !DILocation(line: 98, column: 9, scope: !781)
!781 = distinct !DILexicalBlock(scope: !731, file: !3, line: 98, column: 9)
!782 = !DILocation(line: 98, column: 42, scope: !781)
!783 = !DILocation(line: 98, column: 9, scope: !731)
!784 = !DILocation(line: 101, column: 17, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !3, line: 98, column: 59)
!786 = !DILocation(line: 101, column: 9, scope: !785)
!787 = !DILocation(line: 103, column: 9, scope: !785)
!788 = !DILocation(line: 105, column: 13, scope: !789)
!789 = distinct !DILexicalBlock(scope: !731, file: !3, line: 105, column: 9)
!790 = !DILocation(line: 105, column: 16, scope: !789)
!791 = !DILocation(line: 105, column: 9, scope: !731)
!792 = !DILocation(line: 112, column: 17, scope: !731)
!793 = !{i8 0, i8 2}
!794 = !DILocation(line: 112, column: 5, scope: !731)
!795 = !DILocation(line: 0, scope: !743)
!796 = !DILocation(line: 114, column: 17, scope: !797)
!797 = distinct !DILexicalBlock(scope: !743, file: !3, line: 114, column: 13)
!798 = !DILocation(line: 114, column: 21, scope: !797)
!799 = !DILocation(line: 114, column: 40, scope: !797)
!800 = !DILocation(line: 114, column: 13, scope: !797)
!801 = !DILocation(line: 114, column: 46, scope: !797)
!802 = !DILocation(line: 114, column: 13, scope: !743)
!803 = !DILocation(line: 106, column: 17, scope: !804)
!804 = distinct !DILexicalBlock(scope: !789, file: !3, line: 105, column: 25)
!805 = !DILocation(line: 106, column: 9, scope: !804)
!806 = !DILocation(line: 107, column: 9, scope: !804)
!807 = !DILocation(line: 115, column: 20, scope: !808)
!808 = distinct !DILexicalBlock(scope: !797, file: !3, line: 114, column: 52)
!809 = !DILocation(line: 118, column: 5, scope: !731)
!810 = distinct !{!810, !794, !809, !433}
!811 = !DILocation(line: 113, column: 35, scope: !743)
!812 = !DILocation(line: 120, column: 13, scope: !813)
!813 = distinct !DILexicalBlock(scope: !731, file: !3, line: 120, column: 9)
!814 = !DILocation(line: 120, column: 9, scope: !813)
!815 = !DILocation(line: 120, column: 9, scope: !731)
!816 = !DILocation(line: 121, column: 18, scope: !813)
!817 = !DILocation(line: 121, column: 9, scope: !813)
!818 = !DILocation(line: 123, column: 5, scope: !731)
!819 = !DILocation(line: 125, column: 5, scope: !731)
!820 = !DILocation(line: 126, column: 5, scope: !731)
!821 = !DILocation(line: 128, column: 9, scope: !731)
!822 = !DILocation(line: 129, column: 17, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 128, column: 17)
!824 = distinct !DILexicalBlock(scope: !731, file: !3, line: 128, column: 9)
!825 = !DILocation(line: 129, column: 9, scope: !823)
!826 = !DILocation(line: 130, column: 9, scope: !823)
!827 = !DILocation(line: 132, column: 9, scope: !828)
!828 = distinct !DILexicalBlock(scope: !824, file: !3, line: 131, column: 12)
!829 = !DILocation(line: 0, scope: !824)
!830 = !DILocation(line: 134, column: 1, scope: !731)
!831 = distinct !DISubprogram(name: "restart_mmap_close", scope: !3, file: !3, line: 335, type: !461, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!832 = !DILocation(line: 336, column: 11, scope: !831)
!833 = !DILocation(line: 336, column: 22, scope: !831)
!834 = !DILocation(line: 336, column: 5, scope: !831)
!835 = !DILocation(line: 338, column: 22, scope: !836)
!836 = distinct !DILexicalBlock(scope: !831, file: !3, line: 338, column: 9)
!837 = !DILocation(line: 338, column: 9, scope: !836)
!838 = !DILocation(line: 338, column: 35, scope: !836)
!839 = !DILocation(line: 338, column: 9, scope: !831)
!840 = !DILocation(line: 339, column: 17, scope: !841)
!841 = distinct !DILexicalBlock(scope: !836, file: !3, line: 338, column: 41)
!842 = !DILocation(line: 339, column: 9, scope: !841)
!843 = !DILocation(line: 340, column: 5, scope: !841)
!844 = !DILocation(line: 342, column: 16, scope: !845)
!845 = distinct !DILexicalBlock(scope: !831, file: !3, line: 342, column: 9)
!846 = !DILocation(line: 342, column: 27, scope: !845)
!847 = !DILocation(line: 342, column: 9, scope: !845)
!848 = !DILocation(line: 342, column: 42, scope: !845)
!849 = !DILocation(line: 342, column: 9, scope: !831)
!850 = !DILocation(line: 343, column: 9, scope: !851)
!851 = distinct !DILexicalBlock(scope: !845, file: !3, line: 342, column: 48)
!852 = !DILocation(line: 344, column: 5, scope: !851)
!853 = !DILocation(line: 344, column: 22, scope: !854)
!854 = distinct !DILexicalBlock(scope: !845, file: !3, line: 344, column: 16)
!855 = !DILocation(line: 344, column: 16, scope: !854)
!856 = !DILocation(line: 344, column: 31, scope: !854)
!857 = !DILocation(line: 344, column: 16, scope: !845)
!858 = !DILocation(line: 345, column: 9, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !3, line: 344, column: 37)
!860 = !DILocation(line: 346, column: 5, scope: !859)
!861 = !DILocation(line: 348, column: 10, scope: !831)
!862 = !DILocation(line: 348, column: 5, scope: !831)
!863 = !DILocation(line: 349, column: 1, scope: !831)
!864 = !DISubprogram(name: "msync", scope: !728, file: !728, line: 89, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!865 = !DISubroutineType(types: !866)
!866 = !{!245, !232, !292, !245}
!867 = distinct !DISubprogram(name: "restart_save", scope: !3, file: !3, line: 217, type: !732, scopeLine: 217, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !878, !879, !880}
!869 = !DILocalVariable(name: "file", arg: 1, scope: !867, file: !3, line: 217, type: !313)
!870 = !DILocalVariable(name: "flen", scope: !867, file: !3, line: 220, type: !292)
!871 = !DILocalVariable(name: "ext", scope: !867, file: !3, line: 221, type: !313)
!872 = !DILocalVariable(name: "extlen", scope: !867, file: !3, line: 222, type: !292)
!873 = !DILocalVariable(name: "metafile", scope: !867, file: !3, line: 223, type: !247)
!874 = !DILocalVariable(name: "oldmask", scope: !867, file: !3, line: 233, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !876, line: 69, baseType: !877)
!876 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !268, line: 150, baseType: !7)
!878 = !DILocalVariable(name: "f", scope: !867, file: !3, line: 234, type: !238)
!879 = !DILocalVariable(name: "cb", scope: !867, file: !3, line: 243, type: !301)
!880 = !DILocalVariable(name: "ctx", scope: !867, file: !3, line: 244, type: !234)
!881 = !DILocation(line: 0, scope: !867)
!882 = !DILocation(line: 220, column: 19, scope: !867)
!883 = !DILocation(line: 222, column: 21, scope: !867)
!884 = !DILocation(line: 223, column: 37, scope: !867)
!885 = !DILocation(line: 223, column: 46, scope: !867)
!886 = !DILocation(line: 223, column: 22, scope: !867)
!887 = !DILocation(line: 224, column: 18, scope: !888)
!888 = distinct !DILexicalBlock(scope: !867, file: !3, line: 224, column: 9)
!889 = !DILocation(line: 224, column: 9, scope: !867)
!890 = !DILocation(line: 225, column: 17, scope: !891)
!891 = distinct !DILexicalBlock(scope: !888, file: !3, line: 224, column: 27)
!892 = !DILocation(line: 225, column: 9, scope: !891)
!893 = !DILocation(line: 226, column: 9, scope: !891)
!894 = !DILocation(line: 228, column: 5, scope: !867)
!895 = !DILocation(line: 229, column: 20, scope: !867)
!896 = !DILocation(line: 229, column: 5, scope: !867)
!897 = !DILocation(line: 233, column: 22, scope: !867)
!898 = !DILocation(line: 234, column: 15, scope: !867)
!899 = !DILocation(line: 235, column: 5, scope: !867)
!900 = !DILocation(line: 236, column: 11, scope: !901)
!901 = distinct !DILexicalBlock(scope: !867, file: !3, line: 236, column: 9)
!902 = !DILocation(line: 236, column: 9, scope: !867)
!903 = !DILocation(line: 238, column: 14, scope: !904)
!904 = distinct !DILexicalBlock(scope: !901, file: !3, line: 236, column: 20)
!905 = !DILocation(line: 238, column: 9, scope: !904)
!906 = !DILocation(line: 239, column: 9, scope: !904)
!907 = !DILocation(line: 240, column: 9, scope: !904)
!908 = !DILocation(line: 243, column: 27, scope: !867)
!909 = !DILocation(line: 244, column: 5, scope: !867)
!910 = !DILocation(line: 244, column: 20, scope: !867)
!911 = !DILocation(line: 245, column: 9, scope: !867)
!912 = !DILocation(line: 245, column: 11, scope: !867)
!913 = !DILocation(line: 246, column: 15, scope: !867)
!914 = !DILocation(line: 246, column: 5, scope: !867)
!915 = !DILocation(line: 248, column: 29, scope: !916)
!916 = distinct !DILexicalBlock(scope: !867, file: !3, line: 246, column: 24)
!917 = !DILocation(line: 248, column: 9, scope: !916)
!918 = !DILocation(line: 249, column: 17, scope: !919)
!919 = distinct !DILexicalBlock(scope: !916, file: !3, line: 249, column: 13)
!920 = !DILocation(line: 249, column: 40, scope: !919)
!921 = !DILocation(line: 249, column: 13, scope: !919)
!922 = !DILocation(line: 249, column: 46, scope: !919)
!923 = !DILocation(line: 249, column: 13, scope: !916)
!924 = !DILocation(line: 255, column: 14, scope: !916)
!925 = !DILocation(line: 255, column: 18, scope: !916)
!926 = distinct !{!926, !914, !927, !433}
!927 = !DILocation(line: 256, column: 5, scope: !867)
!928 = !DILocation(line: 262, column: 1, scope: !867)
!929 = !DISubprogram(name: "munmap", scope: !728, file: !728, line: 76, type: !930, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!930 = !DISubroutineType(types: !931)
!931 = !{!245, !232, !292}
!932 = !DISubprogram(name: "close", scope: !724, file: !724, line: 353, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !453)
!933 = !DISubroutineType(types: !934)
!934 = !{!245, !245}
!935 = distinct !DISubprogram(name: "restart_fixup", scope: !3, file: !3, line: 354, type: !936, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{!7, !232}
!938 = !{!939, !940, !948, !949, !951, !952, !954, !955}
!939 = !DILocalVariable(name: "orig_addr", arg: 1, scope: !935, file: !3, line: 354, type: !232)
!940 = !DILocalVariable(name: "tv", scope: !935, file: !3, line: 355, type: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !942, line: 8, size: 128, elements: !943)
!942 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!943 = !{!944, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !941, file: !942, line: 10, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !268, line: 160, baseType: !269)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !941, file: !942, line: 11, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !268, line: 162, baseType: !269)
!948 = !DILocalVariable(name: "checked", scope: !935, file: !3, line: 356, type: !353)
!949 = !DILocalVariable(name: "page_size", scope: !935, file: !3, line: 357, type: !950)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!951 = !DILocalVariable(name: "page_remain", scope: !935, file: !3, line: 358, type: !7)
!952 = !DILocalVariable(name: "it", scope: !953, file: !3, line: 369, type: !324)
!953 = distinct !DILexicalBlock(scope: !935, file: !3, line: 367, column: 37)
!954 = !DILocalVariable(name: "size", scope: !953, file: !3, line: 371, type: !245)
!955 = !DILocalVariable(name: "ch", scope: !956, file: !3, line: 399, type: !359)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 398, column: 55)
!957 = distinct !DILexicalBlock(scope: !953, file: !3, line: 398, column: 13)
!958 = !DILocation(line: 0, scope: !935)
!959 = !DILocation(line: 355, column: 5, scope: !935)
!960 = !DILocation(line: 355, column: 20, scope: !935)
!961 = !DILocation(line: 357, column: 45, scope: !935)
!962 = !{!963, !666, i64 132}
!963 = !{!"settings", !493, i64 0, !666, i64 8, !666, i64 12, !666, i64 16, !411, i64 24, !666, i64 32, !666, i64 36, !493, i64 40, !666, i64 48, !411, i64 56, !411, i64 64, !666, i64 72, !964, i64 80, !666, i64 88, !666, i64 92, !666, i64 96, !412, i64 100, !666, i64 104, !666, i64 108, !498, i64 112, !412, i64 116, !666, i64 120, !666, i64 124, !666, i64 128, !666, i64 132, !666, i64 136, !498, i64 140, !498, i64 141, !498, i64 142, !498, i64 143, !498, i64 144, !498, i64 145, !666, i64 148, !964, i64 152, !666, i64 160, !666, i64 164, !498, i64 168, !666, i64 172, !498, i64 176, !498, i64 177, !411, i64 184, !666, i64 192, !666, i64 196, !666, i64 200, !666, i64 204, !964, i64 208, !964, i64 216, !666, i64 224, !498, i64 228, !666, i64 232, !666, i64 236, !666, i64 240, !666, i64 244, !666, i64 248, !498, i64 252, !498, i64 253, !498, i64 254, !498, i64 255, !666, i64 256, !666, i64 260, !666, i64 264, !666, i64 268, !666, i64 272, !666, i64 276, !666, i64 280, !666, i64 284, !666, i64 288, !666, i64 292, !964, i64 296, !964, i64 304, !498, i64 312, !666, i64 316, !666, i64 320, !411, i64 328, !666, i64 336}
!964 = !{!"double", !412, i64 0}
!965 = !DILocation(line: 360, column: 5, scope: !935)
!966 = !DILocation(line: 361, column: 18, scope: !967)
!967 = distinct !DILexicalBlock(scope: !935, file: !3, line: 361, column: 9)
!968 = !{!963, !666, i64 32}
!969 = !DILocation(line: 361, column: 26, scope: !967)
!970 = !DILocation(line: 361, column: 9, scope: !935)
!971 = !DILocation(line: 362, column: 17, scope: !972)
!972 = distinct !DILexicalBlock(scope: !967, file: !3, line: 361, column: 31)
!973 = !DILocation(line: 362, column: 93, scope: !972)
!974 = !DILocation(line: 362, column: 9, scope: !972)
!975 = !DILocation(line: 363, column: 17, scope: !972)
!976 = !DILocation(line: 363, column: 71, scope: !972)
!977 = !{!978, !493, i64 0}
!978 = !{!"timeval", !493, i64 0, !493, i64 8}
!979 = !DILocation(line: 363, column: 63, scope: !972)
!980 = !DILocation(line: 363, column: 87, scope: !972)
!981 = !{!978, !493, i64 8}
!982 = !DILocation(line: 363, column: 79, scope: !972)
!983 = !DILocation(line: 363, column: 9, scope: !972)
!984 = !DILocation(line: 364, column: 5, scope: !972)
!985 = !DILocation(line: 367, column: 22, scope: !935)
!986 = !DILocation(line: 367, column: 20, scope: !935)
!987 = !DILocation(line: 367, column: 5, scope: !935)
!988 = !DILocation(line: 369, column: 37, scope: !953)
!989 = !DILocation(line: 369, column: 47, scope: !953)
!990 = !DILocation(line: 369, column: 20, scope: !953)
!991 = !DILocation(line: 0, scope: !953)
!992 = !DILocation(line: 372, column: 36, scope: !953)
!993 = !DILocation(line: 372, column: 27, scope: !953)
