; ModuleID = 'slabs.c'
source_filename = "slabs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%struct.slabclass_t = type { i32, i32, i8*, i32, i32, i8**, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.slab_rebalance = type { i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8* }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reassign_result_type", file: !6, line: 55, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./slabs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "28867aba1f41c79140864d76faedcb32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "REASSIGN_OK", value: 0)
!10 = !DIEnumerator(name: "REASSIGN_RUNNING", value: 1)
!11 = !DIEnumerator(name: "REASSIGN_BADCLASS", value: 2)
!12 = !DIEnumerator(name: "REASSIGN_NOSPARE", value: 3)
!13 = !DIEnumerator(name: "REASSIGN_SRC_DST_SAME", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "conn_states", file: !15, line: 199, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!17 = !DIEnumerator(name: "conn_listening", value: 0)
!18 = !DIEnumerator(name: "conn_new_cmd", value: 1)
!19 = !DIEnumerator(name: "conn_waiting", value: 2)
!20 = !DIEnumerator(name: "conn_read", value: 3)
!21 = !DIEnumerator(name: "conn_parse_cmd", value: 4)
!22 = !DIEnumerator(name: "conn_write", value: 5)
!23 = !DIEnumerator(name: "conn_nread", value: 6)
!24 = !DIEnumerator(name: "conn_swallow", value: 7)
!25 = !DIEnumerator(name: "conn_closing", value: 8)
!26 = !DIEnumerator(name: "conn_mwrite", value: 9)
!27 = !DIEnumerator(name: "conn_closed", value: 10)
!28 = !DIEnumerator(name: "conn_watch", value: 11)
!29 = !DIEnumerator(name: "conn_io_queue", value: 12)
!30 = !DIEnumerator(name: "conn_max_state", value: 13)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bin_substates", file: !15, line: 216, baseType: !7, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!33 = !DIEnumerator(name: "bin_no_state", value: 0)
!34 = !DIEnumerator(name: "bin_reading_set_header", value: 1)
!35 = !DIEnumerator(name: "bin_reading_cas_header", value: 2)
!36 = !DIEnumerator(name: "bin_read_set_value", value: 3)
!37 = !DIEnumerator(name: "bin_reading_get_key", value: 4)
!38 = !DIEnumerator(name: "bin_reading_stat", value: 5)
!39 = !DIEnumerator(name: "bin_reading_del_header", value: 6)
!40 = !DIEnumerator(name: "bin_reading_incr_header", value: 7)
!41 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!42 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!43 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!44 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_entry_type", file: !46, line: 16, baseType: !7, size: 32, elements: !47)
!46 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!48 = !DIEnumerator(name: "LOGGER_ASCII_CMD", value: 0)
!49 = !DIEnumerator(name: "LOGGER_EVICTION", value: 1)
!50 = !DIEnumerator(name: "LOGGER_ITEM_GET", value: 2)
!51 = !DIEnumerator(name: "LOGGER_ITEM_STORE", value: 3)
!52 = !DIEnumerator(name: "LOGGER_CRAWLER_STATUS", value: 4)
!53 = !DIEnumerator(name: "LOGGER_SLAB_MOVE", value: 5)
!54 = !DIEnumerator(name: "LOGGER_CONNECTION_NEW", value: 6)
!55 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!56 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!57 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!58 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!59 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!60 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!61 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!62 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !15, line: 231, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "ascii_prot", value: 3)
!66 = !DIEnumerator(name: "binary_prot", value: 4)
!67 = !DIEnumerator(name: "negotiating_prot", value: 5)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !15, line: 240, baseType: !7, size: 32, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "local_transport", value: 0)
!71 = !DIEnumerator(name: "tcp_transport", value: 1)
!72 = !DIEnumerator(name: "udp_transport", value: 2)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !15, line: 259, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!76 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!77 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!78 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "move_status", file: !3, line: 833, baseType: !7, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "MOVE_PASS", value: 0)
!82 = !DIEnumerator(name: "MOVE_FROM_SLAB", value: 1)
!83 = !DIEnumerator(name: "MOVE_FROM_LRU", value: 2)
!84 = !DIEnumerator(name: "MOVE_BUSY", value: 3)
!85 = !DIEnumerator(name: "MOVE_LOCKED", value: 4)
!86 = !{!87, !124, !125, !126, !128, !130, !147, !148}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !15, line: 598, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !15, line: 575, size: 384, elements: !90)
!90 = !{!91, !93, !94, !95, !97, !98, !100, !102, !107, !111, !112}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !15, line: 577, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !89, file: !15, line: 578, baseType: !92, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !89, file: !15, line: 580, baseType: !92, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !89, file: !15, line: 581, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !46, line: 14, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !89, file: !15, line: 582, baseType: !96, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !89, file: !15, line: 583, baseType: !99, size: 32, offset: 256)
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !89, file: !15, line: 584, baseType: !101, size: 16, offset: 288)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !89, file: !15, line: 585, baseType: !103, size: 16, offset: 304)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !104, line: 25, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !106, line: 40, baseType: !101)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !89, file: !15, line: 586, baseType: !108, size: 8, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !104, line: 24, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !106, line: 38, baseType: !110)
!110 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !89, file: !15, line: 587, baseType: !108, size: 8, offset: 328)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !15, line: 593, baseType: !113, offset: 384)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, elements: !122)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !15, line: 590, size: 64, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !114, file: !15, line: 591, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !104, line: 27, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !106, line: 45, baseType: !119)
!119 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !114, file: !15, line: 592, baseType: !121, size: 8)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !{!123}
!123 = !DISubrange(count: -1)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !129, line: 46, baseType: !119)
!129 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !15, line: 635, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !15, line: 623, size: 384, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !15, line: 624, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !15, line: 625, baseType: !135, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !15, line: 626, baseType: !92, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !132, file: !15, line: 627, baseType: !99, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !132, file: !15, line: 628, baseType: !99, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !132, file: !15, line: 629, baseType: !99, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !132, file: !15, line: 630, baseType: !101, size: 16, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !132, file: !15, line: 631, baseType: !103, size: 16, offset: 304)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !132, file: !15, line: 632, baseType: !108, size: 8, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !132, file: !15, line: 633, baseType: !108, size: 8, offset: 328)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !132, file: !15, line: 634, baseType: !146, offset: 336)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, elements: !122)
!147 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!149 = !{!150, !166, !168, !0, !172, !174, !176, !178, !180, !182, !185, !216, !218, !226, !229}
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "slabclass", scope: !2, file: !3, line: 42, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 20480, elements: !164)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "slabclass_t", file: !3, line: 40, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 29, size: 320, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !163}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !3, line: 30, baseType: !7, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "perslab", scope: !154, file: !3, line: 31, baseType: !7, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !154, file: !3, line: 33, baseType: !125, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sl_curr", scope: !154, file: !3, line: 34, baseType: !7, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "slabs", scope: !154, file: !3, line: 36, baseType: !7, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "slab_list", scope: !154, file: !3, line: 38, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "list_size", scope: !154, file: !3, line: 39, baseType: !7, size: 32, offset: 256)
!164 = !{!165}
!165 = !DISubrange(count: 64)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "power_largest", scope: !2, file: !3, line: 48, type: !99, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "rebalance_tid", scope: !2, file: !3, line: 1317, type: !170, isLocal: true, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !171, line: 27, baseType: !119)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "mem_limit", scope: !2, file: !3, line: 43, type: !128, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "mem_base", scope: !2, file: !3, line: 50, type: !125, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "mem_current", scope: !2, file: !3, line: 51, type: !125, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "mem_avail", scope: !2, file: !3, line: 52, type: !128, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "mem_malloced", scope: !2, file: !3, line: 44, type: !128, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "mem_limit_reached", scope: !2, file: !3, line: 47, type: !184, isLocal: true, isDefinition: true)
!184 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "slabs_lock", scope: !2, file: !3, line: 59, type: !187, isLocal: true, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !171, line: 72, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !171, line: 67, size: 320, elements: !189)
!189 = !{!190, !210, !214}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !188, file: !171, line: 69, baseType: !191, size: 320)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !192, line: 22, size: 320, elements: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!193 = !{!194, !195, !196, !197, !198, !199, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !191, file: !192, line: 24, baseType: !99, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !191, file: !192, line: 25, baseType: !7, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !191, file: !192, line: 26, baseType: !99, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !191, file: !192, line: 28, baseType: !7, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !191, file: !192, line: 32, baseType: !99, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !191, file: !192, line: 34, baseType: !200, size: 16, offset: 160)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !191, file: !192, line: 35, baseType: !200, size: 16, offset: 176)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !191, file: !192, line: 36, baseType: !203, size: 128, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !204, line: 53, baseType: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !204, line: 49, size: 128, elements: !206)
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !205, file: !204, line: 51, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !205, file: !204, line: 52, baseType: !208, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !188, file: !171, line: 70, baseType: !211, size: 320)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 320, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 40)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !188, file: !171, line: 71, baseType: !215, size: 64)
!215 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "slabs_rebalance_lock", scope: !2, file: !3, line: 60, type: !187, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "cur", scope: !220, file: !3, line: 1249, type: !99, isLocal: true, isDefinition: true)
!220 = distinct !DISubprogram(name: "slabs_reassign_pick_any", scope: !3, file: !3, line: 1248, type: !221, scopeLine: 1248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !223)
!221 = !DISubroutineType(types: !222)
!222 = !{!99, !99}
!223 = !{!224, !225}
!224 = !DILocalVariable(name: "dst", arg: 1, scope: !220, file: !3, line: 1248, type: !99)
!225 = !DILocalVariable(name: "tries", scope: !220, file: !3, line: 1250, type: !99)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "do_run_slab_rebalance_thread", scope: !2, file: !3, line: 728, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "slab_rebalance_cond", scope: !2, file: !3, line: 727, type: !231, isLocal: true, isDefinition: true)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !171, line: 80, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !171, line: 75, size: 384, elements: !233)
!233 = !{!234, !263, !267}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !232, file: !171, line: 77, baseType: !235, size: 384)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !204, line: 92, size: 384, elements: !236)
!236 = !{!237, !246, !255, !259, !260, !261, !262}
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !204, line: 94, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !204, line: 94, size: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !238, file: !204, line: 96, baseType: !147, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !238, file: !204, line: 101, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !204, line: 97, size: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !242, file: !204, line: 99, baseType: !7, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !242, file: !204, line: 100, baseType: !7, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !204, line: 103, baseType: !247, size: 64, offset: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !204, line: 103, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !247, file: !204, line: 105, baseType: !147, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !247, file: !204, line: 110, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !247, file: !204, line: 106, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !251, file: !204, line: 108, baseType: !7, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !251, file: !204, line: 109, baseType: !7, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !235, file: !204, line: 112, baseType: !256, size: 64, offset: 128)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 2)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !235, file: !204, line: 113, baseType: !256, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !235, file: !204, line: 114, baseType: !7, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !235, file: !204, line: 115, baseType: !7, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !235, file: !204, line: 116, baseType: !256, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !232, file: !171, line: 78, baseType: !264, size: 384)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 384, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 48)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !232, file: !171, line: 79, baseType: !268, size: 64)
!268 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!269 = !{i32 7, !"Dwarf Version", i32 5}
!270 = !{i32 2, !"Debug Info Version", i32 3}
!271 = !{i32 1, !"wchar_size", i32 4}
!272 = !{i32 7, !"uwtable", i32 1}
!273 = !{!"/home/xuheng/blackbox/llvm-test/memcached/slabs.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/slabs.gcda", !2}
!274 = !{!"clang version 14.0.0"}
!275 = distinct !DISubprogram(name: "slabs_set_storage", scope: !3, file: !3, line: 78, type: !276, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !125}
!278 = !{!279}
!279 = !DILocalVariable(name: "arg", arg: 1, scope: !275, file: !3, line: 78, type: !125)
!280 = !DILocation(line: 0, scope: !275)
!281 = !DILocation(line: 79, column: 13, scope: !275)
!282 = !{!283, !283, i64 0}
!283 = !{!"any pointer", !284, i64 0}
!284 = !{!"omnipotent char", !285, i64 0}
!285 = !{!"Simple C/C++ TBAA"}
!286 = !DILocation(line: 80, column: 1, scope: !275)
!287 = distinct !DISubprogram(name: "slabs_clsid", scope: !3, file: !3, line: 90, type: !288, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !291)
!288 = !DISubroutineType(types: !289)
!289 = !{!7, !290}
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!291 = !{!292, !293}
!292 = !DILocalVariable(name: "size", arg: 1, scope: !287, file: !3, line: 90, type: !290)
!293 = !DILocalVariable(name: "res", scope: !287, file: !3, line: 91, type: !99)
!294 = !DILocation(line: 0, scope: !287)
!295 = !DILocation(line: 93, column: 14, scope: !296)
!296 = distinct !DILexicalBlock(scope: !287, file: !3, line: 93, column: 9)
!297 = !DILocation(line: 93, column: 19, scope: !296)
!298 = !DILocation(line: 93, column: 22, scope: !296)
!299 = !DILocation(line: 93, column: 38, scope: !296)
!300 = !{!301, !303, i64 124}
!301 = !{!"settings", !302, i64 0, !303, i64 8, !303, i64 12, !303, i64 16, !283, i64 24, !303, i64 32, !303, i64 36, !302, i64 40, !303, i64 48, !283, i64 56, !283, i64 64, !303, i64 72, !304, i64 80, !303, i64 88, !303, i64 92, !303, i64 96, !284, i64 100, !303, i64 104, !303, i64 108, !305, i64 112, !284, i64 116, !303, i64 120, !303, i64 124, !303, i64 128, !303, i64 132, !303, i64 136, !305, i64 140, !305, i64 141, !305, i64 142, !305, i64 143, !305, i64 144, !305, i64 145, !303, i64 148, !304, i64 152, !303, i64 160, !303, i64 164, !305, i64 168, !303, i64 172, !305, i64 176, !305, i64 177, !283, i64 184, !303, i64 192, !303, i64 196, !303, i64 200, !303, i64 204, !304, i64 208, !304, i64 216, !303, i64 224, !305, i64 228, !303, i64 232, !303, i64 236, !303, i64 240, !303, i64 244, !303, i64 248, !305, i64 252, !305, i64 253, !305, i64 254, !305, i64 255, !303, i64 256, !303, i64 260, !303, i64 264, !303, i64 268, !303, i64 272, !303, i64 276, !303, i64 280, !303, i64 284, !303, i64 288, !303, i64 292, !304, i64 296, !304, i64 304, !305, i64 312, !303, i64 316, !303, i64 320, !283, i64 328, !303, i64 336}
!302 = !{!"long", !284, i64 0}
!303 = !{!"int", !284, i64 0}
!304 = !{!"double", !284, i64 0}
!305 = !{!"_Bool", !284, i64 0}
!306 = !DILocation(line: 93, column: 29, scope: !296)
!307 = !DILocation(line: 93, column: 27, scope: !296)
!308 = !DILocation(line: 93, column: 9, scope: !287)
!309 = !DILocation(line: 95, column: 34, scope: !287)
!310 = !{!311, !303, i64 0}
!311 = !{!"", !303, i64 0, !303, i64 4, !283, i64 8, !303, i64 16, !303, i64 20, !283, i64 24, !303, i64 32}
!312 = !DILocation(line: 95, column: 19, scope: !287)
!313 = !DILocation(line: 95, column: 17, scope: !287)
!314 = !DILocation(line: 95, column: 5, scope: !287)
!315 = !{!303, !303, i64 0}
!316 = !DILocation(line: 94, column: 9, scope: !296)
!317 = !DILocation(line: 96, column: 19, scope: !318)
!318 = distinct !DILexicalBlock(scope: !287, file: !3, line: 96, column: 13)
!319 = !DILocation(line: 96, column: 13, scope: !287)
!320 = !DILocation(line: 97, column: 20, scope: !318)
!321 = !DILocation(line: 97, column: 13, scope: !318)
!322 = !DILocation(line: 96, column: 16, scope: !318)
!323 = distinct !{!323, !314, !324, !325}
!324 = !DILocation(line: 97, column: 20, scope: !287)
!325 = !{!"llvm.loop.mustprogress"}
!326 = !DILocation(line: 98, column: 12, scope: !287)
!327 = !DILocation(line: 98, column: 5, scope: !287)
!328 = !DILocation(line: 99, column: 1, scope: !287)
!329 = distinct !DISubprogram(name: "slabs_size", scope: !3, file: !3, line: 101, type: !330, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!330 = !DISubroutineType(types: !331)
!331 = !{!7, !332}
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!333 = !{!334}
!334 = !DILocalVariable(name: "clsid", arg: 1, scope: !329, file: !3, line: 101, type: !332)
!335 = !DILocation(line: 0, scope: !329)
!336 = !DILocation(line: 102, column: 12, scope: !329)
!337 = !DILocation(line: 102, column: 29, scope: !329)
!338 = !DILocation(line: 102, column: 5, scope: !329)
!339 = distinct !DISubprogram(name: "slabs_fixup", scope: !3, file: !3, line: 166, type: !340, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!7, !124, !332}
!342 = !{!343, !344, !345, !347, !348}
!343 = !DILocalVariable(name: "chunk", arg: 1, scope: !339, file: !3, line: 166, type: !124)
!344 = !DILocalVariable(name: "border", arg: 2, scope: !339, file: !3, line: 166, type: !332)
!345 = !DILocalVariable(name: "p", scope: !339, file: !3, line: 167, type: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!347 = !DILocalVariable(name: "it", scope: !339, file: !3, line: 168, type: !87)
!348 = !DILocalVariable(name: "id", scope: !339, file: !3, line: 169, type: !99)
!349 = !DILocation(line: 0, scope: !339)
!350 = !DILocation(line: 169, column: 14, scope: !339)
!351 = !{!284, !284, i64 0}
!352 = !DILocation(line: 173, column: 12, scope: !353)
!353 = distinct !DILexicalBlock(scope: !339, file: !3, line: 173, column: 9)
!354 = !DILocation(line: 173, column: 9, scope: !339)
!355 = !DILocation(line: 175, column: 11, scope: !356)
!356 = distinct !DILexicalBlock(scope: !353, file: !3, line: 173, column: 18)
!357 = !DILocation(line: 176, column: 9, scope: !356)
!358 = !DILocation(line: 177, column: 12, scope: !356)
!359 = !{!311, !283, i64 24}
!360 = !DILocation(line: 177, column: 30, scope: !356)
!361 = !{!311, !303, i64 20}
!362 = !DILocation(line: 177, column: 9, scope: !356)
!363 = !DILocation(line: 177, column: 34, scope: !356)
!364 = !DILocation(line: 178, column: 9, scope: !356)
!365 = !DILocation(line: 180, column: 20, scope: !339)
!366 = !DILocation(line: 180, column: 10, scope: !339)
!367 = !DILocation(line: 183, column: 16, scope: !368)
!368 = distinct !DILexicalBlock(scope: !339, file: !3, line: 183, column: 9)
!369 = !DILocation(line: 183, column: 9, scope: !339)
!370 = !DILocation(line: 184, column: 24, scope: !371)
!371 = distinct !DILexicalBlock(scope: !368, file: !3, line: 183, column: 22)
!372 = !DILocation(line: 184, column: 9, scope: !371)
!373 = !DILocation(line: 185, column: 12, scope: !371)
!374 = !DILocation(line: 185, column: 25, scope: !371)
!375 = !DILocation(line: 185, column: 30, scope: !371)
!376 = !DILocation(line: 185, column: 9, scope: !371)
!377 = !DILocation(line: 185, column: 34, scope: !371)
!378 = !DILocation(line: 186, column: 5, scope: !371)
!379 = !DILocation(line: 189, column: 13, scope: !380)
!380 = distinct !DILexicalBlock(scope: !339, file: !3, line: 189, column: 9)
!381 = !{!382, !382, i64 0}
!382 = !{!"short", !284, i64 0}
!383 = !DILocation(line: 189, column: 22, scope: !380)
!384 = !DILocation(line: 189, column: 9, scope: !339)
!385 = !DILocation(line: 192, column: 13, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !3, line: 189, column: 39)
!387 = !DILocation(line: 192, column: 18, scope: !386)
!388 = !DILocation(line: 193, column: 23, scope: !386)
!389 = !{!311, !283, i64 8}
!390 = !DILocation(line: 193, column: 13, scope: !386)
!391 = !DILocation(line: 193, column: 18, scope: !386)
!392 = !DILocation(line: 194, column: 13, scope: !393)
!393 = distinct !DILexicalBlock(scope: !386, file: !3, line: 194, column: 13)
!394 = !DILocation(line: 194, column: 13, scope: !386)
!395 = !DILocation(line: 194, column: 40, scope: !393)
!396 = !DILocation(line: 194, column: 27, scope: !393)
!397 = !DILocation(line: 194, column: 33, scope: !393)
!398 = !DILocation(line: 194, column: 38, scope: !393)
!399 = !DILocation(line: 194, column: 23, scope: !393)
!400 = !DILocation(line: 195, column: 20, scope: !386)
!401 = !DILocation(line: 195, column: 18, scope: !386)
!402 = !DILocation(line: 197, column: 12, scope: !386)
!403 = !DILocation(line: 197, column: 19, scope: !386)
!404 = !{!311, !303, i64 16}
!405 = !DILocation(line: 199, column: 5, scope: !386)
!406 = !DILocation(line: 201, column: 15, scope: !339)
!407 = !DILocation(line: 201, column: 5, scope: !339)
!408 = !DILocation(line: 202, column: 1, scope: !339)
!409 = distinct !DISubprogram(name: "grow_slab_list", scope: !3, file: !3, line: 337, type: !410, scopeLine: 337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !413)
!410 = !DISubroutineType(types: !411)
!411 = !{!99, !412}
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!413 = !{!414, !415, !416, !419}
!414 = !DILocalVariable(name: "id", arg: 1, scope: !409, file: !3, line: 337, type: !412)
!415 = !DILocalVariable(name: "p", scope: !409, file: !3, line: 338, type: !346)
!416 = !DILocalVariable(name: "new_size", scope: !417, file: !3, line: 340, type: !128)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 339, column: 35)
!418 = distinct !DILexicalBlock(scope: !409, file: !3, line: 339, column: 9)
!419 = !DILocalVariable(name: "new_list", scope: !417, file: !3, line: 341, type: !125)
!420 = !DILocation(line: 0, scope: !409)
!421 = !DILocation(line: 338, column: 23, scope: !409)
!422 = !DILocation(line: 339, column: 12, scope: !418)
!423 = !DILocation(line: 339, column: 24, scope: !418)
!424 = !{!311, !303, i64 32}
!425 = !DILocation(line: 339, column: 18, scope: !418)
!426 = !DILocation(line: 339, column: 9, scope: !409)
!427 = !DILocation(line: 340, column: 42, scope: !417)
!428 = !DILocation(line: 340, column: 28, scope: !417)
!429 = !DILocation(line: 340, column: 63, scope: !417)
!430 = !DILocation(line: 0, scope: !417)
!431 = !DILocation(line: 341, column: 37, scope: !417)
!432 = !DILocation(line: 341, column: 57, scope: !417)
!433 = !DILocation(line: 341, column: 26, scope: !417)
!434 = !DILocation(line: 342, column: 22, scope: !435)
!435 = distinct !DILexicalBlock(scope: !417, file: !3, line: 342, column: 13)
!436 = !DILocation(line: 342, column: 13, scope: !417)
!437 = !DILocation(line: 342, column: 28, scope: !435)
!438 = !DILocation(line: 343, column: 22, scope: !417)
!439 = !DILocation(line: 344, column: 22, scope: !417)
!440 = !DILocation(line: 343, column: 24, scope: !417)
!441 = !DILocation(line: 345, column: 5, scope: !417)
!442 = !DILocation(line: 346, column: 5, scope: !409)
!443 = !DILocation(line: 347, column: 1, scope: !409)
!444 = distinct !DISubprogram(name: "slabs_init", scope: !3, file: !3, line: 208, type: !445, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !454)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !290, !447, !449, !450, !125, !184}
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !104, line: 26, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !466}
!455 = !DILocalVariable(name: "limit", arg: 1, scope: !444, file: !3, line: 208, type: !290)
!456 = !DILocalVariable(name: "factor", arg: 2, scope: !444, file: !3, line: 208, type: !447)
!457 = !DILocalVariable(name: "prealloc", arg: 3, scope: !444, file: !3, line: 208, type: !449)
!458 = !DILocalVariable(name: "slab_sizes", arg: 4, scope: !444, file: !3, line: 208, type: !450)
!459 = !DILocalVariable(name: "mem_base_external", arg: 5, scope: !444, file: !3, line: 208, type: !125)
!460 = !DILocalVariable(name: "reuse_mem", arg: 6, scope: !444, file: !3, line: 208, type: !184)
!461 = !DILocalVariable(name: "i", scope: !444, file: !3, line: 209, type: !99)
!462 = !DILocalVariable(name: "size", scope: !444, file: !3, line: 210, type: !7)
!463 = !DILocalVariable(name: "do_slab_prealloc", scope: !444, file: !3, line: 216, type: !184)
!464 = !DILocalVariable(name: "t_initial_malloc", scope: !465, file: !3, line: 281, type: !124)
!465 = distinct !DILexicalBlock(scope: !444, file: !3, line: 280, column: 5)
!466 = !DILocalVariable(name: "env_malloced", scope: !467, file: !3, line: 283, type: !469)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 282, column: 31)
!468 = distinct !DILexicalBlock(scope: !465, file: !3, line: 282, column: 13)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !470, line: 27, baseType: !471)
!470 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !106, line: 44, baseType: !215)
!472 = !DILocation(line: 0, scope: !444)
!473 = !DILocation(line: 210, column: 49, scope: !444)
!474 = !{!301, !303, i64 88}
!475 = !DILocation(line: 210, column: 38, scope: !444)
!476 = !DILocation(line: 218, column: 15, scope: !444)
!477 = !{!302, !302, i64 0}
!478 = !DILocation(line: 220, column: 18, scope: !479)
!479 = distinct !DILexicalBlock(scope: !444, file: !3, line: 220, column: 9)
!480 = !DILocation(line: 220, column: 21, scope: !479)
!481 = !DILocation(line: 220, column: 39, scope: !479)
!482 = !DILocation(line: 220, column: 9, scope: !444)
!483 = !DILocation(line: 221, column: 20, scope: !484)
!484 = distinct !DILexicalBlock(scope: !479, file: !3, line: 220, column: 48)
!485 = !DILocation(line: 221, column: 18, scope: !484)
!486 = !DILocation(line: 222, column: 13, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !3, line: 222, column: 13)
!488 = !DILocation(line: 222, column: 13, scope: !484)
!489 = !DILocation(line: 223, column: 30, scope: !490)
!490 = distinct !DILexicalBlock(scope: !487, file: !3, line: 222, column: 23)
!491 = !DILocation(line: 224, column: 25, scope: !490)
!492 = !DILocation(line: 225, column: 25, scope: !490)
!493 = !DILocation(line: 225, column: 23, scope: !490)
!494 = !DILocation(line: 226, column: 9, scope: !490)
!495 = !DILocation(line: 227, column: 21, scope: !496)
!496 = distinct !DILexicalBlock(scope: !487, file: !3, line: 226, column: 16)
!497 = !DILocation(line: 227, column: 13, scope: !496)
!498 = !DILocation(line: 230, column: 28, scope: !499)
!499 = distinct !DILexicalBlock(scope: !479, file: !3, line: 230, column: 16)
!500 = !DILocation(line: 235, column: 18, scope: !501)
!501 = distinct !DILexicalBlock(scope: !499, file: !3, line: 230, column: 55)
!502 = !DILocation(line: 238, column: 13, scope: !501)
!503 = !DILocation(line: 239, column: 35, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 238, column: 24)
!505 = distinct !DILexicalBlock(scope: !501, file: !3, line: 238, column: 13)
!506 = !DILocation(line: 239, column: 45, scope: !504)
!507 = !DILocation(line: 241, column: 9, scope: !504)
!508 = !DILocation(line: 242, column: 27, scope: !509)
!509 = distinct !DILexicalBlock(scope: !505, file: !3, line: 241, column: 16)
!510 = !DILocation(line: 0, scope: !505)
!511 = !DILocation(line: 247, column: 5, scope: !444)
!512 = !DILocation(line: 249, column: 5, scope: !444)
!513 = !DILocation(line: 250, column: 13, scope: !514)
!514 = distinct !DILexicalBlock(scope: !444, file: !3, line: 249, column: 48)
!515 = !DILocation(line: 251, column: 17, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 251, column: 17)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 250, column: 33)
!518 = distinct !DILexicalBlock(scope: !514, file: !3, line: 250, column: 13)
!519 = !DILocation(line: 251, column: 33, scope: !516)
!520 = !DILocation(line: 251, column: 17, scope: !517)
!521 = !DILocation(line: 253, column: 20, scope: !517)
!522 = !DILocation(line: 254, column: 9, scope: !517)
!523 = !DILocation(line: 254, column: 20, scope: !524)
!524 = distinct !DILexicalBlock(scope: !518, file: !3, line: 254, column: 20)
!525 = !DILocation(line: 254, column: 37, scope: !524)
!526 = !{!301, !303, i64 128}
!527 = !DILocation(line: 254, column: 28, scope: !524)
!528 = !DILocation(line: 254, column: 57, scope: !524)
!529 = !DILocation(line: 254, column: 25, scope: !524)
!530 = !DILocation(line: 254, column: 20, scope: !518)
!531 = !DILocation(line: 258, column: 18, scope: !532)
!532 = distinct !DILexicalBlock(scope: !514, file: !3, line: 258, column: 13)
!533 = !DILocation(line: 258, column: 13, scope: !514)
!534 = !DILocation(line: 259, column: 42, scope: !532)
!535 = !DILocation(line: 259, column: 39, scope: !532)
!536 = !DILocation(line: 259, column: 18, scope: !532)
!537 = !DILocation(line: 259, column: 13, scope: !532)
!538 = !DILocation(line: 0, scope: !514)
!539 = !DILocation(line: 261, column: 22, scope: !514)
!540 = !DILocation(line: 261, column: 27, scope: !514)
!541 = !DILocation(line: 262, column: 41, scope: !514)
!542 = !{!301, !303, i64 132}
!543 = !DILocation(line: 262, column: 56, scope: !514)
!544 = !DILocation(line: 262, column: 22, scope: !514)
!545 = !DILocation(line: 262, column: 30, scope: !514)
!546 = !{!311, !303, i64 4}
!547 = !DILocation(line: 263, column: 13, scope: !514)
!548 = !DILocation(line: 264, column: 21, scope: !549)
!549 = distinct !DILexicalBlock(scope: !514, file: !3, line: 263, column: 13)
!550 = !DILocation(line: 264, column: 18, scope: !549)
!551 = !DILocation(line: 264, column: 13, scope: !549)
!552 = !DILocation(line: 265, column: 22, scope: !553)
!553 = distinct !DILexicalBlock(scope: !514, file: !3, line: 265, column: 13)
!554 = !{!301, !303, i64 32}
!555 = !DILocation(line: 265, column: 30, scope: !553)
!556 = !DILocation(line: 265, column: 13, scope: !514)
!557 = !DILocation(line: 266, column: 21, scope: !558)
!558 = distinct !DILexicalBlock(scope: !553, file: !3, line: 265, column: 35)
!559 = !DILocation(line: 266, column: 13, scope: !558)
!560 = !DILocation(line: 268, column: 9, scope: !558)
!561 = !DILocation(line: 249, column: 12, scope: !444)
!562 = !DILocation(line: 249, column: 16, scope: !444)
!563 = distinct !{!563, !512, !564, !325}
!564 = !DILocation(line: 269, column: 5, scope: !444)
!565 = !DILocation(line: 0, scope: !518)
!566 = !DILocation(line: 271, column: 19, scope: !444)
!567 = !DILocation(line: 272, column: 46, scope: !444)
!568 = !DILocation(line: 272, column: 5, scope: !444)
!569 = !DILocation(line: 272, column: 30, scope: !444)
!570 = !DILocation(line: 272, column: 35, scope: !444)
!571 = !DILocation(line: 273, column: 49, scope: !444)
!572 = !DILocation(line: 273, column: 64, scope: !444)
!573 = !DILocation(line: 273, column: 30, scope: !444)
!574 = !DILocation(line: 273, column: 38, scope: !444)
!575 = !DILocation(line: 274, column: 18, scope: !576)
!576 = distinct !DILexicalBlock(scope: !444, file: !3, line: 274, column: 9)
!577 = !DILocation(line: 274, column: 26, scope: !576)
!578 = !DILocation(line: 274, column: 9, scope: !444)
!579 = !DILocation(line: 275, column: 17, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !3, line: 274, column: 31)
!581 = !DILocation(line: 275, column: 9, scope: !580)
!582 = !DILocation(line: 277, column: 5, scope: !580)
!583 = !DILocation(line: 281, column: 34, scope: !465)
!584 = !DILocation(line: 0, scope: !465)
!585 = !DILocation(line: 282, column: 13, scope: !468)
!586 = !DILocation(line: 282, column: 13, scope: !465)
!587 = !DILocation(line: 283, column: 13, scope: !467)
!588 = !DILocation(line: 0, scope: !467)
!589 = !DILocation(line: 284, column: 17, scope: !590)
!590 = distinct !DILexicalBlock(scope: !467, file: !3, line: 284, column: 17)
!591 = !DILocation(line: 284, column: 17, scope: !467)
!592 = !DILocation(line: 285, column: 40, scope: !593)
!593 = distinct !DILexicalBlock(scope: !590, file: !3, line: 284, column: 78)
!594 = !DILocation(line: 285, column: 30, scope: !593)
!595 = !DILocation(line: 286, column: 13, scope: !593)
!596 = !DILocation(line: 287, column: 9, scope: !468)
!597 = !DILocation(line: 287, column: 9, scope: !467)
!598 = !DILocation(line: 291, column: 9, scope: !444)
!599 = !DILocation(line: 292, column: 13, scope: !600)
!600 = distinct !DILexicalBlock(scope: !601, file: !3, line: 291, column: 27)
!601 = distinct !DILexicalBlock(scope: !444, file: !3, line: 291, column: 9)
!602 = !DILocation(line: 293, column: 31, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !3, line: 292, column: 25)
!604 = distinct !DILexicalBlock(scope: !600, file: !3, line: 292, column: 13)
!605 = !DILocation(line: 293, column: 13, scope: !603)
!606 = !DILocation(line: 294, column: 9, scope: !603)
!607 = !DILocation(line: 295, column: 5, scope: !600)
!608 = !DILocation(line: 296, column: 1, scope: !444)
!609 = distinct !DISubprogram(name: "alloc_large_chunk", scope: !3, file: !3, line: 108, type: !610, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!125, !290}
!612 = !{!613, !614, !615, !616, !670, !671}
!613 = !DILocalVariable(name: "limit", arg: 1, scope: !609, file: !3, line: 108, type: !290)
!614 = !DILocalVariable(name: "ptr", scope: !609, file: !3, line: 110, type: !125)
!615 = !DILocalVariable(name: "pagesize", scope: !609, file: !3, line: 112, type: !128)
!616 = !DILocalVariable(name: "fp", scope: !609, file: !3, line: 113, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !619, line: 7, baseType: !620)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !621, line: 49, size: 1728, elements: !622)
!621 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !638, !640, !641, !642, !644, !645, !647, !651, !654, !656, !659, !662, !663, !664, !665, !666}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !620, file: !621, line: 51, baseType: !99, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !620, file: !621, line: 54, baseType: !124, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !620, file: !621, line: 55, baseType: !124, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !620, file: !621, line: 56, baseType: !124, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !620, file: !621, line: 57, baseType: !124, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !620, file: !621, line: 58, baseType: !124, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !620, file: !621, line: 59, baseType: !124, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !620, file: !621, line: 60, baseType: !124, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !620, file: !621, line: 61, baseType: !124, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !620, file: !621, line: 64, baseType: !124, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !620, file: !621, line: 65, baseType: !124, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !620, file: !621, line: 66, baseType: !124, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !620, file: !621, line: 68, baseType: !636, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !621, line: 36, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !620, file: !621, line: 70, baseType: !639, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !620, file: !621, line: 72, baseType: !99, size: 32, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !620, file: !621, line: 73, baseType: !99, size: 32, offset: 928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !620, file: !621, line: 74, baseType: !643, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !215)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !620, file: !621, line: 77, baseType: !101, size: 16, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !620, file: !621, line: 78, baseType: !646, size: 8, offset: 1040)
!646 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !620, file: !621, line: 79, baseType: !648, size: 8, offset: 1048)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 1)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !620, file: !621, line: 81, baseType: !652, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !621, line: 43, baseType: null)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !620, file: !621, line: 89, baseType: !655, size: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !215)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !620, file: !621, line: 91, baseType: !657, size: 64, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !621, line: 37, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !620, file: !621, line: 92, baseType: !660, size: 64, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !621, line: 38, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !620, file: !621, line: 93, baseType: !639, size: 64, offset: 1344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !620, file: !621, line: 94, baseType: !125, size: 64, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !620, file: !621, line: 95, baseType: !128, size: 64, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !620, file: !621, line: 96, baseType: !99, size: 32, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !620, file: !621, line: 98, baseType: !667, size: 160, offset: 1568)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 160, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 20)
!670 = !DILocalVariable(name: "ret", scope: !609, file: !3, line: 114, type: !99)
!671 = !DILocalVariable(name: "buf", scope: !672, file: !3, line: 119, type: !674)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 118, column: 21)
!673 = distinct !DILexicalBlock(scope: !609, file: !3, line: 118, column: 9)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, elements: !164)
!675 = !DILocation(line: 0, scope: !609)
!676 = !DILocation(line: 110, column: 5, scope: !609)
!677 = !DILocation(line: 110, column: 11, scope: !609)
!678 = !DILocation(line: 112, column: 5, scope: !609)
!679 = !DILocation(line: 112, column: 12, scope: !609)
!680 = !DILocation(line: 117, column: 10, scope: !609)
!681 = !DILocation(line: 118, column: 12, scope: !673)
!682 = !DILocation(line: 118, column: 9, scope: !609)
!683 = !DILocation(line: 119, column: 9, scope: !672)
!684 = !DILocation(line: 119, column: 14, scope: !672)
!685 = !DILocation(line: 121, column: 17, scope: !672)
!686 = !DILocation(line: 121, column: 9, scope: !672)
!687 = !DILocation(line: 122, column: 18, scope: !688)
!688 = distinct !DILexicalBlock(scope: !672, file: !3, line: 122, column: 17)
!689 = !DILocation(line: 122, column: 17, scope: !672)
!690 = !DILocation(line: 123, column: 30, scope: !691)
!691 = distinct !DILexicalBlock(scope: !688, file: !3, line: 122, column: 53)
!692 = !DILocation(line: 123, column: 23, scope: !691)
!693 = !DILocation(line: 126, column: 26, scope: !691)
!694 = !DILocation(line: 127, column: 13, scope: !691)
!695 = distinct !{!695, !686, !696, !325}
!696 = !DILocation(line: 127, column: 13, scope: !672)
!697 = !DILocation(line: 128, column: 16, scope: !672)
!698 = !DILocation(line: 128, column: 9, scope: !672)
!699 = !DILocation(line: 129, column: 5, scope: !673)
!700 = !DILocation(line: 131, column: 10, scope: !701)
!701 = distinct !DILexicalBlock(scope: !609, file: !3, line: 131, column: 9)
!702 = !DILocation(line: 131, column: 9, scope: !609)
!703 = !DILocation(line: 132, column: 17, scope: !704)
!704 = distinct !DILexicalBlock(scope: !701, file: !3, line: 131, column: 20)
!705 = !DILocation(line: 132, column: 9, scope: !704)
!706 = !DILocation(line: 133, column: 9, scope: !704)
!707 = !DILocation(line: 136, column: 18, scope: !708)
!708 = distinct !DILexicalBlock(scope: !609, file: !3, line: 136, column: 9)
!709 = !DILocation(line: 136, column: 26, scope: !708)
!710 = !DILocation(line: 136, column: 9, scope: !609)
!711 = !DILocation(line: 137, column: 17, scope: !708)
!712 = !DILocation(line: 137, column: 9, scope: !708)
!713 = !DILocation(line: 141, column: 32, scope: !609)
!714 = !DILocation(line: 141, column: 11, scope: !609)
!715 = !DILocation(line: 142, column: 13, scope: !716)
!716 = distinct !DILexicalBlock(scope: !609, file: !3, line: 142, column: 9)
!717 = !DILocation(line: 142, column: 9, scope: !609)
!718 = !DILocation(line: 143, column: 17, scope: !719)
!719 = distinct !DILexicalBlock(scope: !716, file: !3, line: 142, column: 19)
!720 = !DILocation(line: 143, column: 9, scope: !719)
!721 = !DILocation(line: 144, column: 9, scope: !719)
!722 = !DILocation(line: 147, column: 19, scope: !609)
!723 = !DILocation(line: 147, column: 11, scope: !609)
!724 = !DILocation(line: 148, column: 13, scope: !725)
!725 = distinct !DILexicalBlock(scope: !609, file: !3, line: 148, column: 9)
!726 = !DILocation(line: 148, column: 9, scope: !609)
!727 = !DILocation(line: 163, column: 12, scope: !609)
!728 = !DILocation(line: 149, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !725, file: !3, line: 148, column: 18)
!730 = !DILocation(line: 149, column: 9, scope: !729)
!731 = !DILocation(line: 150, column: 14, scope: !729)
!732 = !DILocation(line: 150, column: 9, scope: !729)
!733 = !DILocation(line: 152, column: 5, scope: !729)
!734 = !DILocation(line: 163, column: 5, scope: !609)
!735 = !DILocation(line: 164, column: 1, scope: !609)
!736 = !DISubprogram(name: "fprintf", scope: !737, file: !737, line: 326, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!737 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!738 = !DISubroutineType(types: !739)
!739 = !{!99, !740, !741, null}
!740 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !617)
!741 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !126)
!742 = !{}
!743 = !DISubprogram(name: "memset", scope: !744, file: !744, line: 61, type: !745, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!744 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!745 = !DISubroutineType(types: !746)
!746 = !{!125, !125, !99, !128}
!747 = !DISubprogram(name: "getenv", scope: !748, file: !748, line: 634, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!748 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!749 = !DISubroutineType(types: !750)
!750 = !{!124, !126}
!751 = !DISubprogram(name: "safe_strtoll", scope: !752, file: !752, line: 18, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!752 = !DIFile(filename: "./util.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d1ef68c688867746f50aae7567be079a")
!753 = !DISubroutineType(types: !754)
!754 = !{!184, !126, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!756 = distinct !DISubprogram(name: "slabs_preallocate", scope: !3, file: !3, line: 315, type: !757, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !412}
!759 = !{!760, !761, !762}
!760 = !DILocalVariable(name: "maxslabs", arg: 1, scope: !756, file: !3, line: 315, type: !412)
!761 = !DILocalVariable(name: "i", scope: !756, file: !3, line: 316, type: !99)
!762 = !DILocalVariable(name: "prealloc", scope: !756, file: !3, line: 317, type: !7)
!763 = !DILocation(line: 0, scope: !756)
!764 = !DILocation(line: 325, column: 5, scope: !765)
!765 = distinct !DILexicalBlock(scope: !756, file: !3, line: 325, column: 5)
!766 = !DILocation(line: 326, column: 13, scope: !767)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 326, column: 13)
!768 = distinct !DILexicalBlock(scope: !769, file: !3, line: 325, column: 67)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 325, column: 5)
!770 = !DILocation(line: 326, column: 24, scope: !767)
!771 = !DILocation(line: 326, column: 13, scope: !768)
!772 = !DILocation(line: 327, column: 13, scope: !767)
!773 = !DILocation(line: 328, column: 13, scope: !774)
!774 = distinct !DILexicalBlock(scope: !768, file: !3, line: 328, column: 13)
!775 = !DILocation(line: 328, column: 33, scope: !774)
!776 = !DILocation(line: 328, column: 13, scope: !768)
!777 = !DILocation(line: 329, column: 21, scope: !778)
!778 = distinct !DILexicalBlock(scope: !774, file: !3, line: 328, column: 39)
!779 = !DILocation(line: 331, column: 45, scope: !778)
!780 = !DILocation(line: 329, column: 13, scope: !778)
!781 = !DILocation(line: 332, column: 13, scope: !778)
!782 = !DILocation(line: 325, column: 63, scope: !769)
!783 = !DILocation(line: 325, column: 32, scope: !769)
!784 = distinct !{!784, !764, !785, !325}
!785 = !DILocation(line: 334, column: 5, scope: !765)
!786 = !DILocation(line: 335, column: 1, scope: !756)
!787 = distinct !DISubprogram(name: "slabs_prefill_global", scope: !3, file: !3, line: 298, type: !788, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{null}
!790 = !{!791, !792, !793}
!791 = !DILocalVariable(name: "ptr", scope: !787, file: !3, line: 299, type: !125)
!792 = !DILocalVariable(name: "p", scope: !787, file: !3, line: 300, type: !346)
!793 = !DILocalVariable(name: "len", scope: !787, file: !3, line: 301, type: !99)
!794 = !DILocation(line: 0, scope: !787)
!795 = !DILocation(line: 303, column: 12, scope: !787)
!796 = !DILocation(line: 303, column: 27, scope: !787)
!797 = !DILocation(line: 303, column: 25, scope: !787)
!798 = !DILocation(line: 304, column: 13, scope: !787)
!799 = !DILocation(line: 301, column: 24, scope: !787)
!800 = !DILocation(line: 304, column: 39, scope: !787)
!801 = !DILocation(line: 304, column: 23, scope: !787)
!802 = !DILocation(line: 304, column: 45, scope: !787)
!803 = !DILocation(line: 303, column: 5, scope: !787)
!804 = !DILocation(line: 305, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !787, file: !3, line: 304, column: 54)
!806 = !DILocation(line: 309, column: 9, scope: !805)
!807 = !DILocation(line: 310, column: 12, scope: !805)
!808 = !DILocation(line: 310, column: 30, scope: !805)
!809 = !DILocation(line: 310, column: 9, scope: !805)
!810 = !DILocation(line: 310, column: 34, scope: !805)
!811 = distinct !{!811, !803, !812, !325}
!812 = !DILocation(line: 311, column: 5, scope: !787)
!813 = !DILocation(line: 313, column: 1, scope: !787)
!814 = distinct !DISubprogram(name: "memory_allocate", scope: !3, file: !3, line: 610, type: !815, scopeLine: 610, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!125, !128}
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "size", arg: 1, scope: !814, file: !3, line: 610, type: !128)
!819 = !DILocalVariable(name: "ret", scope: !814, file: !3, line: 611, type: !125)
!820 = !DILocation(line: 0, scope: !814)
!821 = !DILocation(line: 613, column: 9, scope: !822)
!822 = distinct !DILexicalBlock(scope: !814, file: !3, line: 613, column: 9)
!823 = !DILocation(line: 613, column: 18, scope: !822)
!824 = !DILocation(line: 613, column: 9, scope: !814)
!825 = !DILocation(line: 615, column: 22, scope: !826)
!826 = distinct !DILexicalBlock(scope: !822, file: !3, line: 613, column: 27)
!827 = !DILocation(line: 615, column: 15, scope: !826)
!828 = !DILocation(line: 616, column: 5, scope: !826)
!829 = !DILocation(line: 617, column: 15, scope: !830)
!830 = distinct !DILexicalBlock(scope: !822, file: !3, line: 616, column: 12)
!831 = !DILocation(line: 619, column: 20, scope: !832)
!832 = distinct !DILexicalBlock(scope: !830, file: !3, line: 619, column: 13)
!833 = !DILocation(line: 619, column: 18, scope: !832)
!834 = !DILocation(line: 619, column: 13, scope: !830)
!835 = !DILocation(line: 624, column: 18, scope: !836)
!836 = distinct !DILexicalBlock(scope: !830, file: !3, line: 624, column: 13)
!837 = !DILocation(line: 624, column: 13, scope: !830)
!838 = !DILocation(line: 625, column: 42, scope: !839)
!839 = distinct !DILexicalBlock(scope: !836, file: !3, line: 624, column: 39)
!840 = !DILocation(line: 625, column: 39, scope: !839)
!841 = !DILocation(line: 625, column: 18, scope: !839)
!842 = !DILocation(line: 626, column: 9, scope: !839)
!843 = !DILocation(line: 628, column: 44, scope: !830)
!844 = !DILocation(line: 628, column: 21, scope: !830)
!845 = !DILocation(line: 629, column: 18, scope: !846)
!846 = distinct !DILexicalBlock(scope: !830, file: !3, line: 629, column: 13)
!847 = !DILocation(line: 629, column: 13, scope: !830)
!848 = !DILocation(line: 630, column: 26, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !3, line: 629, column: 31)
!850 = !DILocation(line: 630, column: 23, scope: !849)
!851 = !DILocation(line: 631, column: 9, scope: !849)
!852 = !DILocation(line: 632, column: 23, scope: !853)
!853 = distinct !DILexicalBlock(scope: !846, file: !3, line: 631, column: 16)
!854 = !DILocation(line: 638, column: 1, scope: !814)
!855 = distinct !DISubprogram(name: "fill_slab_stats_automove", scope: !3, file: !3, line: 528, type: !856, scopeLine: 528, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !866)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_stats_automove", file: !6, line: 39, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 34, size: 192, elements: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chunks_per_page", scope: !860, file: !6, line: 35, baseType: !7, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !860, file: !6, line: 36, baseType: !7, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "free_chunks", scope: !860, file: !6, line: 37, baseType: !215, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "total_pages", scope: !860, file: !6, line: 38, baseType: !215, size: 64, offset: 128)
!866 = !{!867, !868, !869, !873}
!867 = !DILocalVariable(name: "am", arg: 1, scope: !855, file: !3, line: 528, type: !858)
!868 = !DILocalVariable(name: "n", scope: !855, file: !3, line: 529, type: !99)
!869 = !DILocalVariable(name: "p", scope: !870, file: !3, line: 532, type: !346)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 531, column: 54)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 531, column: 5)
!872 = distinct !DILexicalBlock(scope: !855, file: !3, line: 531, column: 5)
!873 = !DILocalVariable(name: "cur", scope: !870, file: !3, line: 533, type: !858)
!874 = !DILocation(line: 0, scope: !855)
!875 = !DILocation(line: 530, column: 5, scope: !855)
!876 = !DILocation(line: 531, column: 5, scope: !872)
!877 = !DILocation(line: 0, scope: !870)
!878 = !DILocation(line: 534, column: 35, scope: !870)
!879 = !DILocation(line: 534, column: 14, scope: !870)
!880 = !DILocation(line: 534, column: 30, scope: !870)
!881 = !{!882, !303, i64 0}
!882 = !{!"", !303, i64 0, !303, i64 4, !302, i64 8, !302, i64 16}
!883 = !DILocation(line: 535, column: 31, scope: !870)
!884 = !DILocation(line: 535, column: 14, scope: !870)
!885 = !DILocation(line: 535, column: 28, scope: !870)
!886 = !DILocation(line: 535, column: 26, scope: !870)
!887 = !DILocation(line: 537, column: 30, scope: !870)
!888 = !DILocation(line: 537, column: 14, scope: !870)
!889 = !DILocation(line: 537, column: 25, scope: !870)
!890 = !{!882, !303, i64 4}
!891 = !DILocation(line: 531, column: 50, scope: !871)
!892 = !DILocation(line: 531, column: 19, scope: !871)
!893 = distinct !{!893, !876, !894, !325}
!894 = !DILocation(line: 538, column: 5, scope: !872)
!895 = !DILocation(line: 539, column: 5, scope: !855)
!896 = !DILocation(line: 540, column: 1, scope: !855)
!897 = !DISubprogram(name: "pthread_mutex_lock", scope: !898, file: !898, line: 738, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!898 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!899 = !DISubroutineType(types: !900)
!900 = !{!99, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!902 = !DISubprogram(name: "pthread_mutex_unlock", scope: !898, file: !898, line: 756, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!903 = distinct !DISubprogram(name: "global_page_pool_size", scope: !3, file: !3, line: 545, type: !904, scopeLine: 545, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !907)
!904 = !DISubroutineType(types: !905)
!905 = !{!7, !906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!907 = !{!908, !909}
!908 = !DILocalVariable(name: "mem_flag", arg: 1, scope: !903, file: !3, line: 545, type: !906)
!909 = !DILocalVariable(name: "ret", scope: !903, file: !3, line: 546, type: !7)
!910 = !DILocation(line: 0, scope: !903)
!911 = !DILocation(line: 547, column: 5, scope: !903)
!912 = !DILocation(line: 548, column: 18, scope: !913)
!913 = distinct !DILexicalBlock(scope: !903, file: !3, line: 548, column: 9)
!914 = !DILocation(line: 548, column: 9, scope: !903)
!915 = !DILocation(line: 549, column: 21, scope: !913)
!916 = !DILocation(line: 549, column: 37, scope: !913)
!917 = !DILocation(line: 549, column: 34, scope: !913)
!918 = !DILocation(line: 549, column: 19, scope: !913)
!919 = !{!305, !305, i64 0}
!920 = !DILocation(line: 549, column: 9, scope: !913)
!921 = !DILocation(line: 550, column: 44, scope: !903)
!922 = !DILocation(line: 551, column: 5, scope: !903)
!923 = !DILocation(line: 552, column: 5, scope: !903)
!924 = distinct !DISubprogram(name: "slabs_alloc", scope: !3, file: !3, line: 656, type: !925, scopeLine: 657, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{!125, !128, !7, !7}
!927 = !{!928, !929, !930, !931}
!928 = !DILocalVariable(name: "size", arg: 1, scope: !924, file: !3, line: 656, type: !128)
!929 = !DILocalVariable(name: "id", arg: 2, scope: !924, file: !3, line: 656, type: !7)
!930 = !DILocalVariable(name: "flags", arg: 3, scope: !924, file: !3, line: 657, type: !7)
!931 = !DILocalVariable(name: "ret", scope: !924, file: !3, line: 658, type: !125)
!932 = !DILocation(line: 0, scope: !924)
!933 = !DILocation(line: 660, column: 5, scope: !924)
!934 = !DILocation(line: 661, column: 11, scope: !924)
!935 = !DILocation(line: 662, column: 5, scope: !924)
!936 = !DILocation(line: 663, column: 5, scope: !924)
!937 = distinct !DISubprogram(name: "do_slabs_alloc", scope: !3, file: !3, line: 406, type: !938, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !940)
!938 = !DISubroutineType(types: !939)
!939 = !{!125, !290, !7, !7}
!940 = !{!941, !942, !943, !944, !945, !946}
!941 = !DILocalVariable(name: "size", arg: 1, scope: !937, file: !3, line: 406, type: !290)
!942 = !DILocalVariable(name: "id", arg: 2, scope: !937, file: !3, line: 406, type: !7)
!943 = !DILocalVariable(name: "flags", arg: 3, scope: !937, file: !3, line: 407, type: !7)
!944 = !DILocalVariable(name: "p", scope: !937, file: !3, line: 408, type: !346)
!945 = !DILocalVariable(name: "ret", scope: !937, file: !3, line: 409, type: !125)
!946 = !DILocalVariable(name: "it", scope: !937, file: !3, line: 410, type: !87)
!947 = !DILocation(line: 0, scope: !937)
!948 = !DILocation(line: 412, column: 12, scope: !949)
!949 = distinct !DILexicalBlock(scope: !937, file: !3, line: 412, column: 9)
!950 = !DILocation(line: 412, column: 29, scope: !949)
!951 = !DILocation(line: 412, column: 32, scope: !949)
!952 = !DILocation(line: 412, column: 37, scope: !949)
!953 = !DILocation(line: 412, column: 35, scope: !949)
!954 = !DILocation(line: 412, column: 9, scope: !937)
!955 = !DILocation(line: 414, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !949, file: !3, line: 412, column: 52)
!957 = !DILocation(line: 416, column: 10, scope: !937)
!958 = !DILocation(line: 417, column: 5, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 417, column: 5)
!960 = distinct !DILexicalBlock(scope: !937, file: !3, line: 417, column: 5)
!961 = !DILocation(line: 417, column: 5, scope: !960)
!962 = !DILocation(line: 419, column: 5, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 419, column: 5)
!964 = distinct !DILexicalBlock(scope: !937, file: !3, line: 419, column: 5)
!965 = !DILocation(line: 419, column: 5, scope: !964)
!966 = !DILocation(line: 422, column: 28, scope: !967)
!967 = distinct !DILexicalBlock(scope: !937, file: !3, line: 422, column: 9)
!968 = !DILocation(line: 422, column: 34, scope: !967)
!969 = !DILocation(line: 422, column: 9, scope: !937)
!970 = !DILocation(line: 423, column: 26, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !3, line: 422, column: 61)
!972 = !DILocation(line: 423, column: 9, scope: !971)
!973 = !DILocation(line: 426, column: 12, scope: !974)
!974 = distinct !DILexicalBlock(scope: !937, file: !3, line: 426, column: 9)
!975 = !DILocation(line: 426, column: 20, scope: !974)
!976 = !DILocation(line: 426, column: 9, scope: !937)
!977 = !DILocation(line: 428, column: 25, scope: !978)
!978 = distinct !DILexicalBlock(scope: !974, file: !3, line: 426, column: 26)
!979 = !DILocation(line: 429, column: 24, scope: !978)
!980 = !DILocation(line: 429, column: 18, scope: !978)
!981 = !DILocation(line: 430, column: 17, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !3, line: 430, column: 13)
!983 = !DILocation(line: 430, column: 13, scope: !982)
!984 = !DILocation(line: 430, column: 13, scope: !978)
!985 = !DILocation(line: 430, column: 23, scope: !982)
!986 = !DILocation(line: 430, column: 27, scope: !982)
!987 = !DILocation(line: 430, column: 33, scope: !982)
!988 = !DILocation(line: 430, column: 38, scope: !982)
!989 = !DILocation(line: 433, column: 13, scope: !978)
!990 = !DILocation(line: 433, column: 22, scope: !978)
!991 = !DILocation(line: 434, column: 13, scope: !978)
!992 = !DILocation(line: 434, column: 22, scope: !978)
!993 = !DILocation(line: 435, column: 19, scope: !978)
!994 = !DILocation(line: 443, column: 5, scope: !995)
!995 = distinct !DILexicalBlock(scope: !996, file: !3, line: 441, column: 14)
!996 = distinct !DILexicalBlock(scope: !937, file: !3, line: 441, column: 9)
!997 = !DILocation(line: 438, column: 13, scope: !998)
!998 = distinct !DILexicalBlock(scope: !974, file: !3, line: 437, column: 12)
!999 = !DILocation(line: 448, column: 1, scope: !937)
!1000 = distinct !DISubprogram(name: "slabs_free", scope: !3, file: !3, line: 666, type: !1001, scopeLine: 666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !125, !128, !7}
!1003 = !{!1004, !1005, !1006}
!1004 = !DILocalVariable(name: "ptr", arg: 1, scope: !1000, file: !3, line: 666, type: !125)
!1005 = !DILocalVariable(name: "size", arg: 2, scope: !1000, file: !3, line: 666, type: !128)
!1006 = !DILocalVariable(name: "id", arg: 3, scope: !1000, file: !3, line: 666, type: !7)
!1007 = !DILocation(line: 0, scope: !1000)
!1008 = !DILocation(line: 667, column: 5, scope: !1000)
!1009 = !DILocation(line: 668, column: 5, scope: !1000)
!1010 = !DILocation(line: 669, column: 5, scope: !1000)
!1011 = !DILocation(line: 670, column: 1, scope: !1000)
!1012 = distinct !DISubprogram(name: "do_slabs_free", scope: !3, file: !3, line: 498, type: !1013, scopeLine: 498, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1015)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !125, !290, !7}
!1015 = !{!1016, !1017, !1018, !1019, !1020}
!1016 = !DILocalVariable(name: "ptr", arg: 1, scope: !1012, file: !3, line: 498, type: !125)
!1017 = !DILocalVariable(name: "size", arg: 2, scope: !1012, file: !3, line: 498, type: !290)
!1018 = !DILocalVariable(name: "id", arg: 3, scope: !1012, file: !3, line: 498, type: !7)
!1019 = !DILocalVariable(name: "p", scope: !1012, file: !3, line: 499, type: !346)
!1020 = !DILocalVariable(name: "it", scope: !1012, file: !3, line: 500, type: !87)
!1021 = !DILocation(line: 0, scope: !1012)
!1022 = !DILocation(line: 502, column: 5, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 502, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 502, column: 5)
!1025 = !DILocation(line: 502, column: 5, scope: !1024)
!1026 = !DILocation(line: 503, column: 32, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 503, column: 9)
!1028 = !DILocation(line: 507, column: 10, scope: !1012)
!1029 = !DILocation(line: 510, column: 14, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 510, column: 9)
!1031 = !DILocation(line: 510, column: 23, scope: !1030)
!1032 = !DILocation(line: 510, column: 39, scope: !1030)
!1033 = !DILocation(line: 510, column: 9, scope: !1012)
!1034 = !DILocation(line: 511, column: 22, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 510, column: 45)
!1036 = !DILocation(line: 512, column: 27, scope: !1035)
!1037 = !DILocation(line: 512, column: 13, scope: !1035)
!1038 = !DILocation(line: 512, column: 25, scope: !1035)
!1039 = !DILocation(line: 513, column: 13, scope: !1035)
!1040 = !DILocation(line: 513, column: 18, scope: !1035)
!1041 = !DILocation(line: 514, column: 23, scope: !1035)
!1042 = !DILocation(line: 514, column: 13, scope: !1035)
!1043 = !DILocation(line: 514, column: 18, scope: !1035)
!1044 = !DILocation(line: 515, column: 13, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 515, column: 13)
!1046 = !DILocation(line: 515, column: 13, scope: !1035)
!1047 = !DILocation(line: 515, column: 40, scope: !1045)
!1048 = !DILocation(line: 515, column: 27, scope: !1045)
!1049 = !DILocation(line: 515, column: 33, scope: !1045)
!1050 = !DILocation(line: 515, column: 38, scope: !1045)
!1051 = !DILocation(line: 515, column: 23, scope: !1045)
!1052 = !DILocation(line: 516, column: 20, scope: !1035)
!1053 = !DILocation(line: 516, column: 18, scope: !1035)
!1054 = !DILocation(line: 518, column: 12, scope: !1035)
!1055 = !DILocation(line: 518, column: 19, scope: !1035)
!1056 = !DILocation(line: 519, column: 5, scope: !1035)
!1057 = !DILocation(line: 509, column: 10, scope: !1012)
!1058 = !DILocation(line: 520, column: 31, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 519, column: 12)
!1060 = !DILocation(line: 520, column: 9, scope: !1059)
!1061 = !DILocation(line: 523, column: 1, scope: !1012)
!1062 = distinct !DISubprogram(name: "slabs_stats", scope: !3, file: !3, line: 672, type: !1063, scopeLine: 672, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1072)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{null, !1065, !125}
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADD_STAT", file: !15, line: 189, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !126, !1069, !126, !451, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1072 = !{!1073, !1074}
!1073 = !DILocalVariable(name: "add_stats", arg: 1, scope: !1062, file: !3, line: 672, type: !1065)
!1074 = !DILocalVariable(name: "c", arg: 2, scope: !1062, file: !3, line: 672, type: !125)
!1075 = !DILocation(line: 0, scope: !1062)
!1076 = !DILocation(line: 673, column: 5, scope: !1062)
!1077 = !DILocation(line: 674, column: 5, scope: !1062)
!1078 = !DILocation(line: 675, column: 5, scope: !1062)
!1079 = !DILocation(line: 676, column: 1, scope: !1062)
!1080 = distinct !DISubprogram(name: "do_slabs_stats", scope: !3, file: !3, line: 556, type: !1063, scopeLine: 556, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1139, !1143, !1146, !1147, !1151, !1152, !1153}
!1082 = !DILocalVariable(name: "add_stats", arg: 1, scope: !1080, file: !3, line: 556, type: !1065)
!1083 = !DILocalVariable(name: "c", arg: 2, scope: !1080, file: !3, line: 556, type: !125)
!1084 = !DILocalVariable(name: "i", scope: !1080, file: !3, line: 557, type: !99)
!1085 = !DILocalVariable(name: "total", scope: !1080, file: !3, line: 557, type: !99)
!1086 = !DILocalVariable(name: "thread_stats", scope: !1080, file: !3, line: 559, type: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !15, line: 356, size: 51584, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1132, !1136, !1137, !1138}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !1087, file: !15, line: 357, baseType: !187, size: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 704)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1024)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1280)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1344)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1408)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1472)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1536)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1600)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1664)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1728)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !1087, file: !15, line: 359, baseType: !117, size: 64, offset: 1792)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 1856)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 1920)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 1984)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 2048)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 2112)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !1087, file: !15, line: 361, baseType: !117, size: 64, offset: 2176)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !1087, file: !15, line: 367, baseType: !1121, size: 32768, offset: 2240)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 32768, elements: !164)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !15, line: 303, size: 512, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !1122, file: !15, line: 305, baseType: !117, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !1122, file: !15, line: 305, baseType: !117, size: 64, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !1087, file: !15, line: 368, baseType: !1133, size: 16384, offset: 35008)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 16384, elements: !1134)
!1134 = !{!1135}
!1135 = !DISubrange(count: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !1087, file: !15, line: 369, baseType: !117, size: 64, offset: 51392)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !1087, file: !15, line: 370, baseType: !117, size: 64, offset: 51456)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !1087, file: !15, line: 371, baseType: !117, size: 64, offset: 51520)
!1139 = !DILocalVariable(name: "p", scope: !1140, file: !3, line: 564, type: !346)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 563, column: 54)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 563, column: 5)
!1142 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 563, column: 5)
!1143 = !DILocalVariable(name: "perslab", scope: !1144, file: !3, line: 566, type: !452)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 565, column: 28)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 565, column: 13)
!1146 = !DILocalVariable(name: "slabs", scope: !1144, file: !3, line: 566, type: !452)
!1147 = !DILocalVariable(name: "key_str", scope: !1144, file: !3, line: 570, type: !1148)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1024, elements: !1149)
!1149 = !{!1150}
!1150 = !DISubrange(count: 128)
!1151 = !DILocalVariable(name: "val_str", scope: !1144, file: !3, line: 571, type: !1148)
!1152 = !DILocalVariable(name: "klen", scope: !1144, file: !3, line: 572, type: !99)
!1153 = !DILocalVariable(name: "vlen", scope: !1144, file: !3, line: 572, type: !99)
!1154 = !DILocation(line: 0, scope: !1080)
!1155 = !DILocation(line: 559, column: 5, scope: !1080)
!1156 = !DILocation(line: 559, column: 25, scope: !1080)
!1157 = !DILocation(line: 560, column: 5, scope: !1080)
!1158 = !DILocation(line: 563, column: 34, scope: !1141)
!1159 = !DILocation(line: 563, column: 31, scope: !1141)
!1160 = !DILocation(line: 563, column: 5, scope: !1142)
!1161 = !DILocation(line: 0, scope: !1140)
!1162 = !DILocation(line: 565, column: 16, scope: !1145)
!1163 = !DILocation(line: 565, column: 22, scope: !1145)
!1164 = !DILocation(line: 565, column: 13, scope: !1140)
!1165 = !DILocation(line: 566, column: 13, scope: !1144)
!1166 = !DILocation(line: 0, scope: !1144)
!1167 = !DILocation(line: 568, column: 26, scope: !1144)
!1168 = !DILocation(line: 570, column: 13, scope: !1144)
!1169 = !DILocation(line: 570, column: 18, scope: !1144)
!1170 = !DILocation(line: 571, column: 13, scope: !1144)
!1171 = !DILocation(line: 571, column: 18, scope: !1144)
!1172 = !DILocation(line: 574, column: 13, scope: !1144)
!1173 = !DILocation(line: 575, column: 13, scope: !1144)
!1174 = !DILocation(line: 576, column: 13, scope: !1144)
!1175 = !DILocation(line: 577, column: 13, scope: !1144)
!1176 = !DILocation(line: 578, column: 13, scope: !1144)
!1177 = !DILocation(line: 580, column: 13, scope: !1144)
!1178 = !DILocation(line: 582, column: 13, scope: !1144)
!1179 = !DILocation(line: 583, column: 13, scope: !1144)
!1180 = !{!1181, !302, i64 8}
!1181 = !{!"slab_stats", !302, i64 0, !302, i64 8, !302, i64 16, !302, i64 24, !302, i64 32, !302, i64 40, !302, i64 48, !302, i64 56}
!1182 = !DILocation(line: 585, column: 13, scope: !1144)
!1183 = !{!1181, !302, i64 0}
!1184 = !DILocation(line: 587, column: 13, scope: !1144)
!1185 = !{!1181, !302, i64 24}
!1186 = !DILocation(line: 589, column: 13, scope: !1144)
!1187 = !{!1181, !302, i64 48}
!1188 = !DILocation(line: 591, column: 13, scope: !1144)
!1189 = !{!1181, !302, i64 56}
!1190 = !DILocation(line: 593, column: 13, scope: !1144)
!1191 = !{!1181, !302, i64 32}
!1192 = !DILocation(line: 595, column: 13, scope: !1144)
!1193 = !{!1181, !302, i64 40}
!1194 = !DILocation(line: 597, column: 13, scope: !1144)
!1195 = !{!1181, !302, i64 16}
!1196 = !DILocation(line: 599, column: 18, scope: !1144)
!1197 = !DILocation(line: 600, column: 9, scope: !1145)
!1198 = !DILocation(line: 600, column: 9, scope: !1144)
!1199 = !DILocation(line: 563, column: 50, scope: !1141)
!1200 = distinct !{!1200, !1160, !1201, !325}
!1201 = !DILocation(line: 601, column: 5, scope: !1142)
!1202 = !DILocation(line: 605, column: 5, scope: !1080)
!1203 = !DILocation(line: 606, column: 5, scope: !1080)
!1204 = !DILocation(line: 607, column: 5, scope: !1080)
!1205 = !DILocation(line: 608, column: 1, scope: !1080)
!1206 = distinct !DISubprogram(name: "slabs_adjust_mem_limit", scope: !3, file: !3, line: 689, type: !1207, scopeLine: 689, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1209)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!184, !128}
!1209 = !{!1210, !1211}
!1210 = !DILocalVariable(name: "new_mem_limit", arg: 1, scope: !1206, file: !3, line: 689, type: !128)
!1211 = !DILocalVariable(name: "ret", scope: !1206, file: !3, line: 690, type: !184)
!1212 = !DILocation(line: 0, scope: !1206)
!1213 = !DILocation(line: 691, column: 5, scope: !1206)
!1214 = !DILocation(line: 692, column: 11, scope: !1206)
!1215 = !DILocation(line: 693, column: 5, scope: !1206)
!1216 = !DILocation(line: 694, column: 5, scope: !1206)
!1217 = distinct !DISubprogram(name: "do_slabs_adjust_mem_limit", scope: !3, file: !3, line: 678, type: !1207, scopeLine: 678, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1218)
!1218 = !{!1219}
!1219 = !DILocalVariable(name: "new_mem_limit", arg: 1, scope: !1217, file: !3, line: 678, type: !128)
!1220 = !DILocation(line: 0, scope: !1217)
!1221 = !DILocation(line: 680, column: 9, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 680, column: 9)
!1223 = !DILocation(line: 680, column: 18, scope: !1222)
!1224 = !DILocation(line: 680, column: 9, scope: !1217)
!1225 = !DILocation(line: 681, column: 9, scope: !1222)
!1226 = !DILocation(line: 682, column: 25, scope: !1217)
!1227 = !DILocation(line: 682, column: 23, scope: !1217)
!1228 = !{!301, !302, i64 0}
!1229 = !DILocation(line: 683, column: 15, scope: !1217)
!1230 = !DILocation(line: 685, column: 5, scope: !1217)
!1231 = !DILocation(line: 686, column: 5, scope: !1217)
!1232 = !DILocation(line: 687, column: 1, scope: !1217)
!1233 = distinct !DISubprogram(name: "slabs_available_chunks", scope: !3, file: !3, line: 697, type: !1234, scopeLine: 698, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1237)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!7, !412, !906, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1237 = !{!1238, !1239, !1240, !1241, !1242}
!1238 = !DILocalVariable(name: "id", arg: 1, scope: !1233, file: !3, line: 697, type: !412)
!1239 = !DILocalVariable(name: "mem_flag", arg: 2, scope: !1233, file: !3, line: 697, type: !906)
!1240 = !DILocalVariable(name: "chunks_perslab", arg: 3, scope: !1233, file: !3, line: 698, type: !1236)
!1241 = !DILocalVariable(name: "ret", scope: !1233, file: !3, line: 699, type: !7)
!1242 = !DILocalVariable(name: "p", scope: !1233, file: !3, line: 700, type: !346)
!1243 = !DILocation(line: 0, scope: !1233)
!1244 = !DILocation(line: 702, column: 5, scope: !1233)
!1245 = !DILocation(line: 703, column: 10, scope: !1233)
!1246 = !DILocation(line: 704, column: 14, scope: !1233)
!1247 = !DILocation(line: 705, column: 18, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 705, column: 9)
!1249 = !DILocation(line: 705, column: 9, scope: !1233)
!1250 = !DILocation(line: 706, column: 21, scope: !1248)
!1251 = !DILocation(line: 706, column: 37, scope: !1248)
!1252 = !DILocation(line: 706, column: 34, scope: !1248)
!1253 = !DILocation(line: 706, column: 19, scope: !1248)
!1254 = !DILocation(line: 706, column: 9, scope: !1248)
!1255 = !DILocation(line: 707, column: 24, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 707, column: 9)
!1257 = !DILocation(line: 707, column: 9, scope: !1233)
!1258 = !DILocation(line: 708, column: 27, scope: !1256)
!1259 = !DILocation(line: 708, column: 30, scope: !1256)
!1260 = !DILocation(line: 708, column: 25, scope: !1256)
!1261 = !DILocation(line: 708, column: 9, scope: !1256)
!1262 = !DILocation(line: 709, column: 5, scope: !1233)
!1263 = !DILocation(line: 710, column: 5, scope: !1233)
!1264 = distinct !DISubprogram(name: "slabs_mlock", scope: !3, file: !3, line: 719, type: !788, scopeLine: 719, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!1265 = !DILocation(line: 720, column: 5, scope: !1264)
!1266 = !DILocation(line: 721, column: 1, scope: !1264)
!1267 = distinct !DISubprogram(name: "slabs_munlock", scope: !3, file: !3, line: 723, type: !788, scopeLine: 723, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!1268 = !DILocation(line: 724, column: 5, scope: !1267)
!1269 = !DILocation(line: 725, column: 1, scope: !1267)
!1270 = distinct !DISubprogram(name: "slabs_reassign", scope: !3, file: !3, line: 1298, type: !1271, scopeLine: 1298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1273)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!5, !99, !99}
!1273 = !{!1274, !1275, !1276}
!1274 = !DILocalVariable(name: "src", arg: 1, scope: !1270, file: !3, line: 1298, type: !99)
!1275 = !DILocalVariable(name: "dst", arg: 2, scope: !1270, file: !3, line: 1298, type: !99)
!1276 = !DILocalVariable(name: "ret", scope: !1270, file: !3, line: 1299, type: !5)
!1277 = !DILocation(line: 0, scope: !1270)
!1278 = !DILocation(line: 1300, column: 9, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 1300, column: 9)
!1280 = !DILocation(line: 1300, column: 54, scope: !1279)
!1281 = !DILocation(line: 1300, column: 9, scope: !1270)
!1282 = !DILocation(line: 1301, column: 9, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1279, file: !3, line: 1300, column: 60)
!1284 = !DILocation(line: 1303, column: 29, scope: !1270)
!1285 = !DILocation(line: 1303, column: 11, scope: !1270)
!1286 = !DILocation(line: 1304, column: 5, scope: !1270)
!1287 = !DILocation(line: 1305, column: 5, scope: !1270)
!1288 = !DILocation(line: 1306, column: 1, scope: !1270)
!1289 = !DISubprogram(name: "pthread_mutex_trylock", scope: !898, file: !898, line: 734, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !742)
!1290 = distinct !DISubprogram(name: "do_slabs_reassign", scope: !3, file: !3, line: 1264, type: !1271, scopeLine: 1264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DILocalVariable(name: "src", arg: 1, scope: !1290, file: !3, line: 1264, type: !99)
!1293 = !DILocalVariable(name: "dst", arg: 2, scope: !1290, file: !3, line: 1264, type: !99)
!1294 = !DILocalVariable(name: "nospare", scope: !1290, file: !3, line: 1265, type: !184)
!1295 = !DILocation(line: 0, scope: !1290)
!1296 = !DILocation(line: 1266, column: 9, scope: !1297)
