; ModuleID = 'slab_automove.c'
source_filename = "slab_automove.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%struct.item_stats_automove = type { i64, i64, i32 }
%struct.slab_stats_automove = type { i32, i32, i64, i64 }
%struct.window_data = type { i64, i64, float, i64 }

@__llvm_gcov_ctr = internal global [3 x i64] zeroinitializer
@__llvm_gcov_ctr.1 = internal global [1 x i64] zeroinitializer
@__llvm_gcov_ctr.2 = internal global [20 x i64] zeroinitializer
@__llvm_gcov_ctr.3 = internal global [2 x i64] zeroinitializer
@0 = private unnamed_addr constant [61 x i8] c"/home/xuheng/blackbox/llvm-test/memcached/slab_automove.gcda\00", align 1
@llvm.global_ctors = appending global [1 x { i32, void ()*, i8* }] [{ i32, void ()*, i8* } { i32 0, void ()* @__llvm_gcov_init, i8* null }]

; Function Attrs: noinline nounwind uwtable
define dso_local i8* @slab_automove_init(%struct.settings* nocapture noundef readonly %settings) local_unnamed_addr #0 !dbg !69 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "slab_automove.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "534035e0cd8b3edc8051650b2b5a19ef")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !4, line: 231, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "ascii_prot", value: 3)
!8 = !DIEnumerator(name: "binary_prot", value: 4)
!9 = !DIEnumerator(name: "negotiating_prot", value: 5)
!10 = !{!11, !12, !28, !35}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_automove", file: !1, line: 32, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 23, size: 49344, elements: !15)
!15 = !{!16, !30, !33, !34, !36, !51, !52, !62}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "window_data", scope: !14, file: !1, line: 24, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_data", file: !1, line: 16, size: 256, elements: !19)
!19 = !{!20, !26, !27, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !18, file: !1, line: 17, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 45, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!25 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !18, file: !1, line: 18, baseType: !21, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "evicted_ratio", scope: !18, file: !1, line: 19, baseType: !28, size: 32, offset: 128)
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "evicted_seen", scope: !18, file: !1, line: 20, baseType: !21, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !14, file: !1, line: 25, baseType: !31, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !5)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "window_cur", scope: !14, file: !1, line: 26, baseType: !31, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_age_ratio", scope: !14, file: !1, line: 27, baseType: !35, size: 64, offset: 128)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "iam_before", scope: !14, file: !1, line: 28, baseType: !37, size: 12288, offset: 192)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 12288, elements: !49)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_stats_automove", file: !39, line: 71, baseType: !40)
!39 = !DIFile(filename: "./items.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "24f8c54717bd547418db2338c9044014")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 67, size: 192, elements: !41)
!41 = !{!42, !47, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "evicted", scope: !40, file: !39, line: 68, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !44, line: 27, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !46)
!46 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "outofmemory", scope: !40, file: !39, line: 69, baseType: !43, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !40, file: !39, line: 70, baseType: !31, size: 32, offset: 128)
!49 = !{!50}
!50 = !DISubrange(count: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "iam_after", scope: !14, file: !1, line: 29, baseType: !37, size: 12288, offset: 12480)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sam_before", scope: !14, file: !1, line: 30, baseType: !53, size: 12288, offset: 24768)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 12288, elements: !49)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_stats_automove", file: !55, line: 39, baseType: !56)
!55 = !DIFile(filename: "./slabs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "28867aba1f41c79140864d76faedcb32")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 34, size: 192, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "chunks_per_page", scope: !56, file: !55, line: 35, baseType: !5, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !56, file: !55, line: 36, baseType: !5, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "free_chunks", scope: !56, file: !55, line: 37, baseType: !46, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "total_pages", scope: !56, file: !55, line: 38, baseType: !46, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sam_after", scope: !14, file: !1, line: 31, baseType: !53, size: 12288, offset: 37056)
!63 = !{i32 7, !"Dwarf Version", i32 5}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{i32 7, !"uwtable", i32 1}
!67 = !{!"/home/xuheng/blackbox/llvm-test/memcached/slab_automove.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/slab_automove.gcda", !0}
!68 = !{!"clang version 14.0.0"}
!69 = distinct !DISubprogram(name: "slab_automove_init", scope: !1, file: !1, line: 34, type: !70, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !162)
!70 = !DISubroutineType(types: !71)
!71 = !{!11, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings", file: !4, line: 436, size: 2752, elements: !74)
!74 = !{!75, !78, !80, !81, !82, !85, !86, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !103, !104, !105, !106, !107, !108, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "maxbytes", scope: !73, file: !4, line: 437, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !25)
!77 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns", scope: !73, file: !4, line: 438, baseType: !79, size: 32, offset: 64)
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !73, file: !4, line: 439, baseType: !79, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "udpport", scope: !73, file: !4, line: 440, baseType: !79, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !73, file: !4, line: 441, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !73, file: !4, line: 442, baseType: !79, size: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_live", scope: !73, file: !4, line: 443, baseType: !87, size: 32, offset: 288)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !88, line: 14, baseType: !5)
!88 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_cas", scope: !73, file: !4, line: 444, baseType: !21, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "evict_to_free", scope: !73, file: !4, line: 445, baseType: !79, size: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "socketpath", scope: !73, file: !4, line: 446, baseType: !83, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "auth_file", scope: !73, file: !4, line: 447, baseType: !83, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !73, file: !4, line: 448, baseType: !79, size: 32, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !73, file: !4, line: 449, baseType: !35, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !73, file: !4, line: 450, baseType: !79, size: 32, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !73, file: !4, line: 451, baseType: !79, size: 32, offset: 736)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads_per_udp", scope: !73, file: !4, line: 452, baseType: !79, size: 32, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_delimiter", scope: !73, file: !4, line: 453, baseType: !84, size: 8, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "detail_enabled", scope: !73, file: !4, line: 454, baseType: !79, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reqs_per_event", scope: !73, file: !4, line: 455, baseType: !79, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "use_cas", scope: !73, file: !4, line: 457, baseType: !102, size: 8, offset: 896)
!102 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "binding_protocol", scope: !73, file: !4, line: 458, baseType: !3, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !73, file: !4, line: 459, baseType: !79, size: 32, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "item_size_max", scope: !73, file: !4, line: 460, baseType: !79, size: 32, offset: 992)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "slab_chunk_size_max", scope: !73, file: !4, line: 461, baseType: !79, size: 32, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "slab_page_size", scope: !73, file: !4, line: 462, baseType: !79, size: 32, offset: 1056)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sig_hup", scope: !73, file: !4, line: 463, baseType: !109, size: 32, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !111, line: 8, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !24, line: 214, baseType: !79)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sasl", scope: !73, file: !4, line: 464, baseType: !102, size: 8, offset: 1120)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns_fast", scope: !73, file: !4, line: 465, baseType: !102, size: 8, offset: 1128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler", scope: !73, file: !4, line: 466, baseType: !102, size: 8, offset: 1136)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lru_maintainer_thread", scope: !73, file: !4, line: 467, baseType: !102, size: 8, offset: 1144)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lru_segmented", scope: !73, file: !4, line: 468, baseType: !102, size: 8, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign", scope: !73, file: !4, line: 469, baseType: !102, size: 8, offset: 1160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove", scope: !73, file: !4, line: 470, baseType: !79, size: 32, offset: 1184)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_ratio", scope: !73, file: !4, line: 471, baseType: !35, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_window", scope: !73, file: !4, line: 472, baseType: !5, size: 32, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "hashpower_init", scope: !73, file: !4, line: 473, baseType: !79, size: 32, offset: 1312)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_command", scope: !73, file: !4, line: 474, baseType: !102, size: 8, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tail_repair_time", scope: !73, file: !4, line: 475, baseType: !79, size: 32, offset: 1376)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flush_enabled", scope: !73, file: !4, line: 476, baseType: !102, size: 8, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dump_enabled", scope: !73, file: !4, line: 477, baseType: !102, size: 8, offset: 1416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algorithm", scope: !73, file: !4, line: 478, baseType: !83, size: 64, offset: 1472)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_sleep", scope: !73, file: !4, line: 479, baseType: !79, size: 32, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_tocrawl", scope: !73, file: !4, line: 480, baseType: !31, size: 32, offset: 1568)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "hot_lru_pct", scope: !73, file: !4, line: 481, baseType: !79, size: 32, offset: 1600)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "warm_lru_pct", scope: !73, file: !4, line: 482, baseType: !79, size: 32, offset: 1632)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "hot_max_factor", scope: !73, file: !4, line: 483, baseType: !35, size: 64, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "warm_max_factor", scope: !73, file: !4, line: 484, baseType: !35, size: 64, offset: 1728)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "crawls_persleep", scope: !73, file: !4, line: 485, baseType: !79, size: 32, offset: 1792)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "temp_lru", scope: !73, file: !4, line: 486, baseType: !102, size: 8, offset: 1824)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "temporary_ttl", scope: !73, file: !4, line: 487, baseType: !31, size: 32, offset: 1856)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !73, file: !4, line: 488, baseType: !79, size: 32, offset: 1888)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "logger_watcher_buf_size", scope: !73, file: !4, line: 489, baseType: !5, size: 32, offset: 1920)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "logger_buf_size", scope: !73, file: !4, line: 490, baseType: !5, size: 32, offset: 1952)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_mem_limit", scope: !73, file: !4, line: 491, baseType: !5, size: 32, offset: 1984)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "drop_privileges", scope: !73, file: !4, line: 492, baseType: !102, size: 8, offset: 2016)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "watch_enabled", scope: !73, file: !4, line: 493, baseType: !102, size: 8, offset: 2024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "relaxed_privileges", scope: !73, file: !4, line: 494, baseType: !102, size: 8, offset: 2032)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "meta_response_old", scope: !73, file: !4, line: 495, baseType: !102, size: 8, offset: 2040)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ext_io_threadcount", scope: !73, file: !4, line: 497, baseType: !5, size: 32, offset: 2048)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ext_page_size", scope: !73, file: !4, line: 498, baseType: !5, size: 32, offset: 2080)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ext_item_size", scope: !73, file: !4, line: 499, baseType: !5, size: 32, offset: 2112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ext_item_age", scope: !73, file: !4, line: 500, baseType: !5, size: 32, offset: 2144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ext_low_ttl", scope: !73, file: !4, line: 501, baseType: !5, size: 32, offset: 2176)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ext_recache_rate", scope: !73, file: !4, line: 502, baseType: !5, size: 32, offset: 2208)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ext_wbuf_size", scope: !73, file: !4, line: 503, baseType: !5, size: 32, offset: 2240)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ext_compact_under", scope: !73, file: !4, line: 504, baseType: !5, size: 32, offset: 2272)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ext_drop_under", scope: !73, file: !4, line: 505, baseType: !5, size: 32, offset: 2304)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ext_max_sleep", scope: !73, file: !4, line: 506, baseType: !5, size: 32, offset: 2336)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ext_max_frag", scope: !73, file: !4, line: 507, baseType: !35, size: 64, offset: 2368)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_freeratio", scope: !73, file: !4, line: 508, baseType: !35, size: 64, offset: 2432)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ext_drop_unread", scope: !73, file: !4, line: 509, baseType: !102, size: 8, offset: 2496)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ext_global_pool_min", scope: !73, file: !4, line: 511, baseType: !5, size: 32, offset: 2528)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "num_napi_ids", scope: !73, file: !4, line: 528, baseType: !79, size: 32, offset: 2560)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "memory_file", scope: !73, file: !4, line: 529, baseType: !83, size: 64, offset: 2624)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sock_cookie_id", scope: !73, file: !4, line: 537, baseType: !31, size: 32, offset: 2688)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(name: "settings", arg: 1, scope: !69, file: !1, line: 34, type: !72)
!164 = !DILocalVariable(name: "window_size", scope: !69, file: !1, line: 35, type: !31)
!165 = !DILocalVariable(name: "max_age_ratio", scope: !69, file: !1, line: 36, type: !35)
!166 = !DILocalVariable(name: "a", scope: !69, file: !1, line: 37, type: !12)
!167 = !DILocation(line: 0, scope: !69)
!168 = !DILocation(line: 35, column: 38, scope: !69)
!169 = !{!170, !174, i64 160}
!170 = !{!"settings", !171, i64 0, !174, i64 8, !174, i64 12, !174, i64 16, !175, i64 24, !174, i64 32, !174, i64 36, !171, i64 40, !174, i64 48, !175, i64 56, !175, i64 64, !174, i64 72, !176, i64 80, !174, i64 88, !174, i64 92, !174, i64 96, !172, i64 100, !174, i64 104, !174, i64 108, !177, i64 112, !172, i64 116, !174, i64 120, !174, i64 124, !174, i64 128, !174, i64 132, !174, i64 136, !177, i64 140, !177, i64 141, !177, i64 142, !177, i64 143, !177, i64 144, !177, i64 145, !174, i64 148, !176, i64 152, !174, i64 160, !174, i64 164, !177, i64 168, !174, i64 172, !177, i64 176, !177, i64 177, !175, i64 184, !174, i64 192, !174, i64 196, !174, i64 200, !174, i64 204, !176, i64 208, !176, i64 216, !174, i64 224, !177, i64 228, !174, i64 232, !174, i64 236, !174, i64 240, !174, i64 244, !174, i64 248, !177, i64 252, !177, i64 253, !177, i64 254, !177, i64 255, !174, i64 256, !174, i64 260, !174, i64 264, !174, i64 268, !174, i64 272, !174, i64 276, !174, i64 280, !174, i64 284, !174, i64 288, !174, i64 292, !176, i64 296, !176, i64 304, !177, i64 312, !174, i64 316, !174, i64 320, !175, i64 328, !174, i64 336}
!171 = !{!"long", !172, i64 0}
!172 = !{!"omnipotent char", !173, i64 0}
!173 = !{!"Simple C/C++ TBAA"}
!174 = !{!"int", !172, i64 0}
!175 = !{!"any pointer", !172, i64 0}
!176 = !{!"double", !172, i64 0}
!177 = !{!"_Bool", !172, i64 0}
!178 = !DILocation(line: 36, column: 38, scope: !69)
!179 = !{!170, !176, i64 152}
!180 = !DILocation(line: 37, column: 24, scope: !69)
!181 = !DILocation(line: 38, column: 11, scope: !182)
!182 = distinct !DILexicalBlock(scope: !69, file: !1, line: 38, column: 9)
!183 = !DILocation(line: 38, column: 9, scope: !69)
!184 = !DILocation(line: 39, column: 9, scope: !182)
!185 = !DILocation(line: 40, column: 41, scope: !69)
!186 = !DILocation(line: 40, column: 29, scope: !69)
!187 = !DILocation(line: 40, column: 22, scope: !69)
!188 = !DILocation(line: 40, column: 20, scope: !69)
!189 = !{!190, !175, i64 0}
!190 = !{!"", !175, i64 0, !174, i64 8, !174, i64 12, !176, i64 16, !172, i64 24, !172, i64 1560, !172, i64 3096, !172, i64 4632}
!191 = !DILocation(line: 41, column: 8, scope: !69)
!192 = !DILocation(line: 41, column: 20, scope: !69)
!193 = !{!190, !174, i64 8}
!194 = !DILocation(line: 42, column: 8, scope: !69)
!195 = !DILocation(line: 42, column: 22, scope: !69)
!196 = !{!190, !176, i64 16}
!197 = !DILocation(line: 43, column: 24, scope: !198)
!198 = distinct !DILexicalBlock(scope: !69, file: !1, line: 43, column: 9)
!199 = !DILocation(line: 43, column: 9, scope: !69)
!200 = !DILocation(line: 44, column: 14, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !1, line: 43, column: 33)
!202 = !DILocation(line: 44, column: 9, scope: !201)
!203 = !DILocation(line: 45, column: 9, scope: !201)
!204 = !DILocation(line: 49, column: 30, scope: !69)
!205 = !DILocation(line: 49, column: 33, scope: !69)
!206 = !DILocation(line: 49, column: 5, scope: !69)
!207 = !DILocation(line: 50, column: 33, scope: !69)
!208 = !DILocation(line: 50, column: 30, scope: !69)
!209 = !DILocation(line: 50, column: 5, scope: !69)
!210 = !DILocation(line: 52, column: 5, scope: !69)
!211 = !DILocation(line: 53, column: 1, scope: !69)
!212 = !DISubprogram(name: "calloc", scope: !213, file: !213, line: 542, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !216)
