; ModuleID = 'slab_automove_extstore.c'
source_filename = "slab_automove_extstore.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%struct.item_stats_automove = type { i64, i64, i32 }
%struct.slab_stats_automove = type { i32, i32, i64, i64 }
%struct.window_data = type { i64, i64, i64, i32, i32 }
%struct.slab_automove = type { %struct.window_data*, %struct.settings*, i32, i32, i32, double, double, i8, i32, [64 x %struct.item_stats_automove], [64 x %struct.item_stats_automove], [64 x %struct.slab_stats_automove], [64 x %struct.slab_stats_automove] }

@settings = external dso_local local_unnamed_addr global %struct.settings, align 8
@__llvm_gcov_ctr = internal global [4 x i64] zeroinitializer
@__llvm_gcov_ctr.1 = internal global [1 x i64] zeroinitializer
@__llvm_gcov_ctr.2 = internal global [18 x i64] zeroinitializer
@__llvm_gcov_ctr.3 = internal global [3 x i64] zeroinitializer
@__llvm_gcov_ctr.4 = internal global [3 x i64] zeroinitializer

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "slab_automove_extstore.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "5ac442847ae9d5d39daa212c51ba7d9f")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !4, line: 231, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./memcached.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "9260b30e1b6ff2e5471cc4f8f6971051")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "ascii_prot", value: 3)
!8 = !DIEnumerator(name: "binary_prot", value: 4)
!9 = !DIEnumerator(name: "negotiating_prot", value: 5)
!10 = !{!11, !12}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_automove", file: !1, line: 39, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 25, size: 49600, elements: !15)
!15 = !{!16, !30, !124, !125, !126, !127, !128, !129, !130, !131, !146, !147, !157}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "window_data", scope: !14, file: !1, line: 26, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_data", file: !1, line: 17, size: 256, elements: !19)
!19 = !{!20, !26, !27, !28, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !18, file: !1, line: 18, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 45, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!25 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !18, file: !1, line: 19, baseType: !21, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "evicted", scope: !18, file: !1, line: 20, baseType: !21, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "excess_free", scope: !18, file: !1, line: 21, baseType: !5, size: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "relaxed", scope: !18, file: !1, line: 22, baseType: !5, size: 32, offset: 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !14, file: !1, line: 27, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings", file: !4, line: 436, size: 2752, elements: !33)
!33 = !{!34, !37, !39, !40, !41, !44, !45, !48, !49, !50, !51, !52, !53, !55, !56, !57, !58, !59, !60, !61, !63, !64, !65, !66, !67, !68, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxbytes", scope: !32, file: !4, line: 437, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 46, baseType: !25)
!36 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns", scope: !32, file: !4, line: 438, baseType: !38, size: 32, offset: 64)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !32, file: !4, line: 439, baseType: !38, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "udpport", scope: !32, file: !4, line: 440, baseType: !38, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !32, file: !4, line: 441, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !32, file: !4, line: 442, baseType: !38, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_live", scope: !32, file: !4, line: 443, baseType: !46, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !47, line: 14, baseType: !5)
!47 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_cas", scope: !32, file: !4, line: 444, baseType: !21, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "evict_to_free", scope: !32, file: !4, line: 445, baseType: !38, size: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "socketpath", scope: !32, file: !4, line: 446, baseType: !42, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "auth_file", scope: !32, file: !4, line: 447, baseType: !42, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !32, file: !4, line: 448, baseType: !38, size: 32, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !32, file: !4, line: 449, baseType: !54, size: 64, offset: 640)
!54 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !32, file: !4, line: 450, baseType: !38, size: 32, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !32, file: !4, line: 451, baseType: !38, size: 32, offset: 736)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads_per_udp", scope: !32, file: !4, line: 452, baseType: !38, size: 32, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_delimiter", scope: !32, file: !4, line: 453, baseType: !43, size: 8, offset: 800)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "detail_enabled", scope: !32, file: !4, line: 454, baseType: !38, size: 32, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reqs_per_event", scope: !32, file: !4, line: 455, baseType: !38, size: 32, offset: 864)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "use_cas", scope: !32, file: !4, line: 457, baseType: !62, size: 8, offset: 896)
!62 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "binding_protocol", scope: !32, file: !4, line: 458, baseType: !3, size: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !32, file: !4, line: 459, baseType: !38, size: 32, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "item_size_max", scope: !32, file: !4, line: 460, baseType: !38, size: 32, offset: 992)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "slab_chunk_size_max", scope: !32, file: !4, line: 461, baseType: !38, size: 32, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "slab_page_size", scope: !32, file: !4, line: 462, baseType: !38, size: 32, offset: 1056)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sig_hup", scope: !32, file: !4, line: 463, baseType: !69, size: 32, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !71, line: 8, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !24, line: 214, baseType: !38)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sasl", scope: !32, file: !4, line: 464, baseType: !62, size: 8, offset: 1120)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "maxconns_fast", scope: !32, file: !4, line: 465, baseType: !62, size: 8, offset: 1128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler", scope: !32, file: !4, line: 466, baseType: !62, size: 8, offset: 1136)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "lru_maintainer_thread", scope: !32, file: !4, line: 467, baseType: !62, size: 8, offset: 1144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "lru_segmented", scope: !32, file: !4, line: 468, baseType: !62, size: 8, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "slab_reassign", scope: !32, file: !4, line: 469, baseType: !62, size: 8, offset: 1160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove", scope: !32, file: !4, line: 470, baseType: !38, size: 32, offset: 1184)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_ratio", scope: !32, file: !4, line: 471, baseType: !54, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_window", scope: !32, file: !4, line: 472, baseType: !5, size: 32, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "hashpower_init", scope: !32, file: !4, line: 473, baseType: !38, size: 32, offset: 1312)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_command", scope: !32, file: !4, line: 474, baseType: !62, size: 8, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tail_repair_time", scope: !32, file: !4, line: 475, baseType: !38, size: 32, offset: 1376)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flush_enabled", scope: !32, file: !4, line: 476, baseType: !62, size: 8, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dump_enabled", scope: !32, file: !4, line: 477, baseType: !62, size: 8, offset: 1416)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algorithm", scope: !32, file: !4, line: 478, baseType: !42, size: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_sleep", scope: !32, file: !4, line: 479, baseType: !38, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lru_crawler_tocrawl", scope: !32, file: !4, line: 480, baseType: !90, size: 32, offset: 1568)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !5)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "hot_lru_pct", scope: !32, file: !4, line: 481, baseType: !38, size: 32, offset: 1600)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "warm_lru_pct", scope: !32, file: !4, line: 482, baseType: !38, size: 32, offset: 1632)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hot_max_factor", scope: !32, file: !4, line: 483, baseType: !54, size: 64, offset: 1664)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "warm_max_factor", scope: !32, file: !4, line: 484, baseType: !54, size: 64, offset: 1728)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "crawls_persleep", scope: !32, file: !4, line: 485, baseType: !38, size: 32, offset: 1792)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "temp_lru", scope: !32, file: !4, line: 486, baseType: !62, size: 8, offset: 1824)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "temporary_ttl", scope: !32, file: !4, line: 487, baseType: !90, size: 32, offset: 1856)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !32, file: !4, line: 488, baseType: !38, size: 32, offset: 1888)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "logger_watcher_buf_size", scope: !32, file: !4, line: 489, baseType: !5, size: 32, offset: 1920)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "logger_buf_size", scope: !32, file: !4, line: 490, baseType: !5, size: 32, offset: 1952)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_mem_limit", scope: !32, file: !4, line: 491, baseType: !5, size: 32, offset: 1984)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "drop_privileges", scope: !32, file: !4, line: 492, baseType: !62, size: 8, offset: 2016)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "watch_enabled", scope: !32, file: !4, line: 493, baseType: !62, size: 8, offset: 2024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "relaxed_privileges", scope: !32, file: !4, line: 494, baseType: !62, size: 8, offset: 2032)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "meta_response_old", scope: !32, file: !4, line: 495, baseType: !62, size: 8, offset: 2040)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ext_io_threadcount", scope: !32, file: !4, line: 497, baseType: !5, size: 32, offset: 2048)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ext_page_size", scope: !32, file: !4, line: 498, baseType: !5, size: 32, offset: 2080)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ext_item_size", scope: !32, file: !4, line: 499, baseType: !5, size: 32, offset: 2112)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ext_item_age", scope: !32, file: !4, line: 500, baseType: !5, size: 32, offset: 2144)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ext_low_ttl", scope: !32, file: !4, line: 501, baseType: !5, size: 32, offset: 2176)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ext_recache_rate", scope: !32, file: !4, line: 502, baseType: !5, size: 32, offset: 2208)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ext_wbuf_size", scope: !32, file: !4, line: 503, baseType: !5, size: 32, offset: 2240)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ext_compact_under", scope: !32, file: !4, line: 504, baseType: !5, size: 32, offset: 2272)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ext_drop_under", scope: !32, file: !4, line: 505, baseType: !5, size: 32, offset: 2304)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ext_max_sleep", scope: !32, file: !4, line: 506, baseType: !5, size: 32, offset: 2336)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ext_max_frag", scope: !32, file: !4, line: 507, baseType: !54, size: 64, offset: 2368)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "slab_automove_freeratio", scope: !32, file: !4, line: 508, baseType: !54, size: 64, offset: 2432)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ext_drop_unread", scope: !32, file: !4, line: 509, baseType: !62, size: 8, offset: 2496)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ext_global_pool_min", scope: !32, file: !4, line: 511, baseType: !5, size: 32, offset: 2528)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "num_napi_ids", scope: !32, file: !4, line: 528, baseType: !38, size: 32, offset: 2560)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memory_file", scope: !32, file: !4, line: 529, baseType: !42, size: 64, offset: 2624)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sock_cookie_id", scope: !32, file: !4, line: 537, baseType: !90, size: 32, offset: 2688)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !14, file: !1, line: 28, baseType: !90, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "window_cur", scope: !14, file: !1, line: 29, baseType: !90, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !14, file: !1, line: 30, baseType: !90, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "max_age_ratio", scope: !14, file: !1, line: 31, baseType: !54, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "free_ratio", scope: !14, file: !1, line: 32, baseType: !54, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pool_filled_once", scope: !14, file: !1, line: 33, baseType: !62, size: 8, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "global_pool_watermark", scope: !14, file: !1, line: 34, baseType: !5, size: 32, offset: 416)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "iam_before", scope: !14, file: !1, line: 35, baseType: !132, size: 12288, offset: 448)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 12288, elements: !144)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_stats_automove", file: !134, line: 71, baseType: !135)
!134 = !DIFile(filename: "./items.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "24f8c54717bd547418db2338c9044014")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 67, size: 192, elements: !136)
!136 = !{!137, !142, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "evicted", scope: !135, file: !134, line: 68, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !139, line: 27, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !141)
!141 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "outofmemory", scope: !135, file: !134, line: 69, baseType: !138, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !135, file: !134, line: 70, baseType: !90, size: 32, offset: 128)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "iam_after", scope: !14, file: !1, line: 36, baseType: !132, size: 12288, offset: 12736)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sam_before", scope: !14, file: !1, line: 37, baseType: !148, size: 12288, offset: 25024)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 12288, elements: !144)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "slab_stats_automove", file: !150, line: 39, baseType: !151)
!150 = !DIFile(filename: "./slabs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "28867aba1f41c79140864d76faedcb32")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 34, size: 192, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chunks_per_page", scope: !151, file: !150, line: 35, baseType: !5, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !151, file: !150, line: 36, baseType: !5, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "free_chunks", scope: !151, file: !150, line: 37, baseType: !141, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "total_pages", scope: !151, file: !150, line: 38, baseType: !141, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sam_after", scope: !14, file: !1, line: 38, baseType: !148, size: 12288, offset: 37312)
!158 = !{i32 7, !"Dwarf Version", i32 5}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{i32 1, !"wchar_size", i32 4}
!161 = !{i32 7, !"uwtable", i32 1}
!162 = !{!"/home/xuheng/blackbox/llvm-test/memcached/slab_automove_extstore.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/slab_automove_extstore.gcda", !0}
!163 = !{!"clang version 14.0.0"}
!164 = distinct !DISubprogram(name: "slab_automove_extstore_init", scope: !1, file: !1, line: 41, type: !165, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !167)
!165 = !DISubroutineType(types: !166)
!166 = !{!11, !31}
!167 = !{!168, !169, !170, !171}
!168 = !DILocalVariable(name: "settings", arg: 1, scope: !164, file: !1, line: 41, type: !31)
!169 = !DILocalVariable(name: "window_size", scope: !164, file: !1, line: 42, type: !90)
!170 = !DILocalVariable(name: "max_age_ratio", scope: !164, file: !1, line: 43, type: !54)
!171 = !DILocalVariable(name: "a", scope: !164, file: !1, line: 44, type: !12)
!172 = !DILocation(line: 0, scope: !164)
!173 = !DILocation(line: 42, column: 38, scope: !164)
!174 = !{!175, !179, i64 160}
!175 = !{!"settings", !176, i64 0, !179, i64 8, !179, i64 12, !179, i64 16, !180, i64 24, !179, i64 32, !179, i64 36, !176, i64 40, !179, i64 48, !180, i64 56, !180, i64 64, !179, i64 72, !181, i64 80, !179, i64 88, !179, i64 92, !179, i64 96, !177, i64 100, !179, i64 104, !179, i64 108, !182, i64 112, !177, i64 116, !179, i64 120, !179, i64 124, !179, i64 128, !179, i64 132, !179, i64 136, !182, i64 140, !182, i64 141, !182, i64 142, !182, i64 143, !182, i64 144, !182, i64 145, !179, i64 148, !181, i64 152, !179, i64 160, !179, i64 164, !182, i64 168, !179, i64 172, !182, i64 176, !182, i64 177, !180, i64 184, !179, i64 192, !179, i64 196, !179, i64 200, !179, i64 204, !181, i64 208, !181, i64 216, !179, i64 224, !182, i64 228, !179, i64 232, !179, i64 236, !179, i64 240, !179, i64 244, !179, i64 248, !182, i64 252, !182, i64 253, !182, i64 254, !182, i64 255, !179, i64 256, !179, i64 260, !179, i64 264, !179, i64 268, !179, i64 272, !179, i64 276, !179, i64 280, !179, i64 284, !179, i64 288, !179, i64 292, !181, i64 296, !181, i64 304, !182, i64 312, !179, i64 316, !179, i64 320, !180, i64 328, !179, i64 336}
!176 = !{!"long", !177, i64 0}
!177 = !{!"omnipotent char", !178, i64 0}
!178 = !{!"Simple C/C++ TBAA"}
!179 = !{!"int", !177, i64 0}
!180 = !{!"any pointer", !177, i64 0}
!181 = !{!"double", !177, i64 0}
!182 = !{!"_Bool", !177, i64 0}
!183 = !DILocation(line: 43, column: 38, scope: !164)
!184 = !{!175, !181, i64 152}
!185 = !DILocation(line: 44, column: 24, scope: !164)
!186 = !DILocation(line: 45, column: 11, scope: !187)
!187 = distinct !DILexicalBlock(scope: !164, file: !1, line: 45, column: 9)
!188 = !DILocation(line: 45, column: 9, scope: !164)
!189 = !DILocation(line: 46, column: 9, scope: !187)
!190 = !DILocation(line: 47, column: 41, scope: !164)
!191 = !DILocation(line: 47, column: 29, scope: !164)
!192 = !DILocation(line: 47, column: 22, scope: !164)
!193 = !DILocation(line: 47, column: 20, scope: !164)
!194 = !{!195, !180, i64 0}
!195 = !{!"", !180, i64 0, !180, i64 8, !179, i64 16, !179, i64 20, !179, i64 24, !181, i64 32, !181, i64 40, !182, i64 48, !179, i64 52, !177, i64 56, !177, i64 1592, !177, i64 3128, !177, i64 4664}
!196 = !DILocation(line: 48, column: 8, scope: !164)
!197 = !DILocation(line: 48, column: 20, scope: !164)
!198 = !{!195, !179, i64 16}
!199 = !DILocation(line: 49, column: 8, scope: !164)
!200 = !DILocation(line: 49, column: 22, scope: !164)
!201 = !{!195, !181, i64 32}
!202 = !DILocation(line: 50, column: 31, scope: !164)
!203 = !{!175, !181, i64 304}
!204 = !DILocation(line: 50, column: 8, scope: !164)
!205 = !DILocation(line: 50, column: 19, scope: !164)
!206 = !{!195, !181, i64 40}
