; ModuleID = 'storage.c'
source_filename = "storage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stats = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, %struct.timeval, i64, i64 }
%struct.timeval = type { i64, i64 }
%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%emit_function_args_ty = type { i32, i32, i32 }

!29 = !DIEnumerator(name: "bin_reading_get_key", value: 4)
!30 = !DIEnumerator(name: "bin_reading_stat", value: 5)
!31 = !DIEnumerator(name: "bin_reading_del_header", value: 6)
!32 = !DIEnumerator(name: "bin_reading_incr_header", value: 7)
!33 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!34 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!35 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!36 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_entry_type", file: !38, line: 16, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!40 = !DIEnumerator(name: "LOGGER_ASCII_CMD", value: 0)
!41 = !DIEnumerator(name: "LOGGER_EVICTION", value: 1)
!42 = !DIEnumerator(name: "LOGGER_ITEM_GET", value: 2)
!43 = !DIEnumerator(name: "LOGGER_ITEM_STORE", value: 3)
!44 = !DIEnumerator(name: "LOGGER_CRAWLER_STATUS", value: 4)
!45 = !DIEnumerator(name: "LOGGER_SLAB_MOVE", value: 5)
!46 = !DIEnumerator(name: "LOGGER_CONNECTION_NEW", value: 6)
!47 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!48 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!49 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!50 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!51 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!52 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!53 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!54 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !6, line: 231, baseType: !7, size: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "ascii_prot", value: 3)
!58 = !DIEnumerator(name: "binary_prot", value: 4)
!59 = !DIEnumerator(name: "negotiating_prot", value: 5)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !6, line: 240, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "local_transport", value: 0)
!63 = !DIEnumerator(name: "tcp_transport", value: 1)
!64 = !DIEnumerator(name: "udp_transport", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !6, line: 259, baseType: !7, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!68 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!69 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!70 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "obj_io_mode", file: !72, line: 65, baseType: !7, size: 32, elements: !73)
!72 = !DIFile(filename: "./extstore.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "89218fefe8c4dc299a86fedbd8729747")
!73 = !{!74, !75}
!74 = !DIEnumerator(name: "OBJ_IO_READ", value: 0)
!75 = !DIEnumerator(name: "OBJ_IO_WRITE", value: 1)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "extstore_res", file: !72, line: 92, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85}
!78 = !DIEnumerator(name: "EXTSTORE_INIT_BAD_WBUF_SIZE", value: 1)
!79 = !DIEnumerator(name: "EXTSTORE_INIT_NEED_MORE_WBUF", value: 2)
!80 = !DIEnumerator(name: "EXTSTORE_INIT_NEED_MORE_BUCKETS", value: 3)
!81 = !DIEnumerator(name: "EXTSTORE_INIT_PAGE_WBUF_ALIGNMENT", value: 4)
!82 = !DIEnumerator(name: "EXTSTORE_INIT_TOO_MANY_PAGES", value: 5)
!83 = !DIEnumerator(name: "EXTSTORE_INIT_OOM", value: 6)
!84 = !DIEnumerator(name: "EXTSTORE_INIT_OPEN_FAIL", value: 7)
!85 = !DIEnumerator(name: "EXTSTORE_INIT_THREAD_FAIL", value: 8)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 62, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!89 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_SUCCESS", value: 0)
!90 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_ENOENT", value: 1)
!91 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_EEXISTS", value: 2)
!92 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_E2BIG", value: 3)
!93 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_EINVAL", value: 4)
!94 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_NOT_STORED", value: 5)
!95 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_DELTA_BADVAL", value: 6)
!96 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_ERROR", value: 32)
!97 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_CONTINUE", value: 33)
!98 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_UNKNOWN_COMMAND", value: 129)
!99 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_ENOMEM", value: 130)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "logger_ret_type", file: !38, line: 44, baseType: !7, size: 32, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "LOGGER_RET_OK", value: 0)
!103 = !DIEnumerator(name: "LOGGER_RET_NOSPACE", value: 1)
!104 = !DIEnumerator(name: "LOGGER_RET_ERR", value: 2)
!105 = !{!106, !114, !116, !117, !118, !123, !171, !676, !141, !435, !119, !711, !144, !145, !156, !493, !728, !736, !737}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_hdr", file: !6, line: 659, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 655, size: 96, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "page_version", scope: !108, file: !6, line: 656, baseType: !7, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !108, file: !6, line: 657, baseType: !7, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "page_id", scope: !108, file: !6, line: 658, baseType: !113, size: 16, offset: 64)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !120, line: 26, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !122, line: 42, baseType: !7)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "item_chunk", file: !6, line: 635, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_strchunk", file: !6, line: 623, size: 384, elements: !126)
!126 = !{!127, !129, !130, !162, !163, !164, !165, !166, !167, !168, !169}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !6, line: 624, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !6, line: 625, baseType: !128, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !6, line: 626, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !6, line: 575, size: 384, elements: !133)
!133 = !{!134, !135, !136, !137, !139, !140, !142, !143, !146, !150, !151}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !6, line: 577, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !6, line: 578, baseType: !131, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !132, file: !6, line: 580, baseType: !131, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !132, file: !6, line: 581, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !38, line: 14, baseType: !7)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !132, file: !6, line: 582, baseType: !138, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !132, file: !6, line: 583, baseType: !141, size: 32, offset: 256)
!141 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !132, file: !6, line: 584, baseType: !113, size: 16, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !132, file: !6, line: 585, baseType: !144, size: 16, offset: 304)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !120, line: 25, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !122, line: 40, baseType: !113)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !132, file: !6, line: 586, baseType: !147, size: 8, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !120, line: 24, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !122, line: 38, baseType: !149)
!149 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !132, file: !6, line: 587, baseType: !147, size: 8, offset: 328)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !132, file: !6, line: 593, baseType: !152, offset: 384)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, elements: !160)
!153 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !6, line: 590, size: 64, elements: !154)
!154 = !{!155, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !153, file: !6, line: 591, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !120, line: 27, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !122, line: 45, baseType: !158)
!158 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !153, file: !6, line: 592, baseType: !115, size: 8)
!160 = !{!161}
!161 = !DISubrange(count: -1)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !6, line: 627, baseType: !141, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !125, file: !6, line: 628, baseType: !141, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !125, file: !6, line: 629, baseType: !141, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !125, file: !6, line: 630, baseType: !113, size: 16, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !125, file: !6, line: 631, baseType: !144, size: 16, offset: 304)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !125, file: !6, line: 632, baseType: !147, size: 8, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "orig_clsid", scope: !125, file: !6, line: 633, baseType: !147, size: 8, offset: 328)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !6, line: 634, baseType: !170, offset: 336)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, elements: !160)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !6, line: 668, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !6, line: 783, size: 1216, elements: !174)
!174 = !{!175, !176, !566, !671, !672}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !173, file: !6, line: 784, baseType: !141, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !173, file: !6, line: 785, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !6, line: 737, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 704, size: 54464, elements: !180)
!180 = !{!181, !184, !188, !269, !270, !352, !381, !384, !412, !490, !491, !492, !564, !565}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !179, file: !6, line: 705, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !183, line: 27, baseType: !158)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !179, file: !6, line: 706, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !187, line: 122, flags: DIFlagFwdDecl)
!187 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !179, file: !6, line: 707, baseType: !189, size: 1024, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !187, line: 123, size: 1024, elements: !190)
!190 = !{!191, !223, !233, !234, !235, !266, !267, !268}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !189, file: !187, line: 124, baseType: !192, size: 320)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !187, line: 107, size: 320, elements: !193)
!193 = !{!194, !201, !203, !204, !205, !222}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !192, file: !187, line: 108, baseType: !195, size: 128)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !187, line: 108, size: 128, elements: !196)
!196 = !{!197, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !195, file: !187, line: 108, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !195, file: !187, line: 108, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !192, file: !187, line: 109, baseType: !202, size: 16, offset: 128)
!202 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !192, file: !187, line: 110, baseType: !147, size: 8, offset: 144)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !192, file: !187, line: 111, baseType: !147, size: 8, offset: 152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !192, file: !187, line: 118, baseType: !206, size: 64, offset: 192)
!206 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !187, line: 113, size: 64, elements: !207)
!207 = !{!208, !212, !216, !221}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !206, file: !187, line: 114, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !141, !202, !116}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !206, file: !187, line: 115, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !198, !116}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !206, file: !187, line: 116, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220, !116}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !206, file: !187, line: 117, baseType: !213, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !192, file: !187, line: 119, baseType: !116, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !189, file: !187, line: 130, baseType: !224, size: 128, offset: 320)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !187, line: 127, size: 128, elements: !225)
!225 = !{!226, !232}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !224, file: !187, line: 128, baseType: !227, size: 128)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !187, line: 128, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !227, file: !187, line: 128, baseType: !220, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !227, file: !187, line: 128, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !224, file: !187, line: 129, baseType: !141, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !189, file: !187, line: 131, baseType: !141, size: 32, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !189, file: !187, line: 133, baseType: !185, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !189, file: !187, line: 149, baseType: !236, size: 256, offset: 576)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !187, line: 135, size: 256, elements: !237)
!237 = !{!238, !255}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !236, file: !187, line: 140, baseType: !239, size: 256)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !187, line: 137, size: 256, elements: !240)
!240 = !{!241, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !239, file: !187, line: 138, baseType: !242, size: 128)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !187, line: 138, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !242, file: !187, line: 138, baseType: !220, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !242, file: !187, line: 138, baseType: !231, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !239, file: !187, line: 139, baseType: !247, size: 128, offset: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !248, line: 8, size: 128, elements: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!249 = !{!250, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !247, file: !248, line: 10, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !122, line: 160, baseType: !252)
!252 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !247, file: !248, line: 11, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !122, line: 162, baseType: !252)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !236, file: !187, line: 148, baseType: !256, size: 256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !187, line: 143, size: 256, elements: !257)
!257 = !{!258, !263, !264}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !256, file: !187, line: 144, baseType: !259, size: 128)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !256, file: !187, line: 144, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !259, file: !187, line: 144, baseType: !220, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !259, file: !187, line: 144, baseType: !231, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !256, file: !187, line: 145, baseType: !202, size: 16, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !256, file: !187, line: 147, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !189, file: !187, line: 151, baseType: !202, size: 16, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !189, file: !187, line: 152, baseType: !202, size: 16, offset: 848)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !189, file: !187, line: 153, baseType: !247, size: 128, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !179, file: !6, line: 709, baseType: !141, size: 32, offset: 1152)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !179, file: !6, line: 714, baseType: !271, size: 51584, offset: 1216)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !6, line: 356, size: 51584, elements: !272)
!272 = !{!273, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !345, !349, !350, !351}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !271, file: !6, line: 357, baseType: !274, size: 320)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !183, line: 72, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !183, line: 67, size: 320, elements: !276)
!276 = !{!277, !296, !300}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !275, file: !183, line: 69, baseType: !278, size: 320)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !279, line: 22, size: 320, elements: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !278, file: !279, line: 24, baseType: !141, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !278, file: !279, line: 25, baseType: !7, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !278, file: !279, line: 26, baseType: !141, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !278, file: !279, line: 28, baseType: !7, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !278, file: !279, line: 32, baseType: !141, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !278, file: !279, line: 34, baseType: !202, size: 16, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !278, file: !279, line: 35, baseType: !202, size: 16, offset: 176)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !278, file: !279, line: 36, baseType: !289, size: 128, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !290, line: 53, baseType: !291)
!290 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !290, line: 49, size: 128, elements: !292)
!292 = !{!293, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !291, file: !290, line: 51, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !291, file: !290, line: 52, baseType: !294, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !275, file: !183, line: 70, baseType: !297, size: 320)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 40)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !275, file: !183, line: 71, baseType: !252, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1600)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1664)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !271, file: !6, line: 359, baseType: !156, size: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 1856)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 1984)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !271, file: !6, line: 361, baseType: !156, size: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !271, file: !6, line: 367, baseType: !332, size: 32768, offset: 2240)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 32768, elements: !343)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !6, line: 303, size: 512, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !333, file: !6, line: 305, baseType: !156, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !333, file: !6, line: 305, baseType: !156, size: 64, offset: 448)
!343 = !{!344}
!344 = !DISubrange(count: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !271, file: !6, line: 368, baseType: !346, size: 16384, offset: 35008)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 16384, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !271, file: !6, line: 369, baseType: !156, size: 64, offset: 51392)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !271, file: !6, line: 370, baseType: !156, size: 64, offset: 51456)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !271, file: !6, line: 371, baseType: !156, size: 64, offset: 51520)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !179, file: !6, line: 715, baseType: !353, size: 1152, offset: 52800)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 1152, elements: !379)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !6, line: 701, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !6, line: 694, size: 384, elements: !356)
!356 = !{!357, !358, !371, !372, !377, !378}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !355, file: !6, line: 695, baseType: !116, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !355, file: !6, line: 696, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !6, line: 670, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !6, line: 669, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !6, line: 687, size: 192, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !365, file: !6, line: 688, baseType: !116, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !365, file: !6, line: 689, baseType: !116, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !365, file: !6, line: 690, baseType: !141, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !6, line: 691, baseType: !141, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !355, file: !6, line: 697, baseType: !359, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !355, file: !6, line: 698, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !6, line: 671, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !171}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !355, file: !6, line: 699, baseType: !373, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !6, line: 700, baseType: !141, size: 32, offset: 320)
!379 = !{!380}
!380 = !DISubrange(count: 3)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !179, file: !6, line: 716, baseType: !382, size: 64, offset: 53952)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !6, line: 716, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !179, file: !6, line: 717, baseType: !385, size: 64, offset: 54016)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !387, line: 39, baseType: !388)
!387 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 22, size: 704, elements: !389)
!389 = !{!390, !391, !392, !405, !408, !409, !410, !411}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !388, file: !387, line: 24, baseType: !274, size: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !388, file: !387, line: 26, baseType: !114, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !388, file: !387, line: 28, baseType: !393, size: 128, offset: 384)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !387, line: 28, size: 128, elements: !394)
!394 = !{!395, !403}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !393, file: !387, line: 28, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !387, line: 12, size: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !397, file: !387, line: 13, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !387, line: 13, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !400, file: !387, line: 13, baseType: !396, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !393, file: !387, line: 28, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !388, file: !387, line: 30, baseType: !406, size: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !407, line: 46, baseType: !158)
!407 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !388, file: !387, line: 32, baseType: !141, size: 32, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !388, file: !387, line: 34, baseType: !141, size: 32, offset: 608)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !388, file: !387, line: 36, baseType: !141, size: 32, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !388, file: !387, line: 38, baseType: !141, size: 32, offset: 672)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !179, file: !6, line: 718, baseType: !413, size: 64, offset: 54080)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !6, line: 703, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !6, line: 773, size: 192, elements: !416)
!416 = !{!417, !418, !419, !421, !422}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !415, file: !6, line: 774, baseType: !147, size: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !415, file: !6, line: 775, baseType: !147, size: 8, offset: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !6, line: 776, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !415, file: !6, line: 777, baseType: !420, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !415, file: !6, line: 778, baseType: !423, offset: 192)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, elements: !160)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !6, line: 770, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !6, line: 743, size: 9472, elements: !426)
!426 = !{!427, !428, !430, !431, !432, !433, !434, !437, !446, !447, !448, !449, !451, !452, !453, !454, !455, !482, !486}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !425, file: !6, line: 744, baseType: !413, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !6, line: 745, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !425, file: !6, line: 746, baseType: !141, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !425, file: !6, line: 747, baseType: !141, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !425, file: !6, line: 748, baseType: !116, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !425, file: !6, line: 749, baseType: !171, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !425, file: !6, line: 751, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !6, line: 598, baseType: !132)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !425, file: !6, line: 752, baseType: !438, size: 512, offset: 384)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 512, elements: !444)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !440, line: 26, size: 128, elements: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !439, file: !440, line: 28, baseType: !116, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !439, file: !440, line: 29, baseType: !406, size: 64, offset: 64)
!444 = !{!445}
!445 = !DISubrange(count: 4)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !425, file: !6, line: 753, baseType: !141, size: 32, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !425, file: !6, line: 754, baseType: !147, size: 8, offset: 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !425, file: !6, line: 755, baseType: !147, size: 8, offset: 936)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !425, file: !6, line: 760, baseType: !450, size: 8, offset: 944)
!450 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !425, file: !6, line: 761, baseType: !450, size: 8, offset: 952)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !425, file: !6, line: 763, baseType: !144, size: 16, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !425, file: !6, line: 764, baseType: !144, size: 16, offset: 976)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !425, file: !6, line: 765, baseType: !144, size: 16, offset: 992)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !425, file: !6, line: 766, baseType: !456, size: 224, offset: 1024)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !457, line: 253, size: 224, elements: !458)
!457 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!458 = !{!459, !462, !464, !465, !481}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !456, file: !457, line: 255, baseType: !460, size: 16)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !461, line: 28, baseType: !113)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !456, file: !457, line: 256, baseType: !463, size: 16, offset: 16)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !457, line: 119, baseType: !144)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !456, file: !457, line: 257, baseType: !119, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !456, file: !457, line: 258, baseType: !466, size: 128, offset: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !457, line: 212, size: 128, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !466, file: !457, line: 219, baseType: !469, size: 128)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !457, line: 214, size: 128, elements: !470)
!470 = !{!471, !475, !479}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !469, file: !457, line: 216, baseType: !472, size: 128)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !469, file: !457, line: 217, baseType: !476, size: 128)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !469, file: !457, line: 218, baseType: !480, size: 128)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !444)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !456, file: !457, line: 259, baseType: !119, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !425, file: !6, line: 767, baseType: !483, size: 32, offset: 1248)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !484, line: 33, baseType: !485)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !122, line: 209, baseType: !7)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !425, file: !6, line: 769, baseType: !487, size: 8192, offset: 1280)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !179, file: !6, line: 719, baseType: !385, size: 64, offset: 54144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !179, file: !6, line: 721, baseType: !116, size: 64, offset: 54208)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !179, file: !6, line: 723, baseType: !493, size: 64, offset: 54272)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !38, line: 171, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !38, line: 159, size: 832, elements: !496)
!496 = !{!497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !520}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !495, file: !38, line: 160, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !38, line: 161, baseType: !498, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !495, file: !38, line: 162, baseType: !274, size: 320, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !495, file: !38, line: 163, baseType: !156, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !495, file: !38, line: 164, baseType: !156, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !495, file: !38, line: 165, baseType: !156, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !495, file: !38, line: 166, baseType: !144, size: 16, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !495, file: !38, line: 167, baseType: !144, size: 16, offset: 656)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !495, file: !38, line: 168, baseType: !144, size: 16, offset: 672)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !495, file: !38, line: 169, baseType: !508, size: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !510, line: 18, baseType: !511)
!510 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 4, size: 192, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !510, line: 6, baseType: !158, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !511, file: !510, line: 9, baseType: !7, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !511, file: !510, line: 9, baseType: !7, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !511, file: !510, line: 12, baseType: !7, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !511, file: !510, line: 15, baseType: !141, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !510, line: 17, baseType: !519, offset: 192)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, elements: !160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !495, file: !38, line: 170, baseType: !521, size: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !38, line: 57, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !38, line: 62, size: 256, elements: !525)
!525 = !{!526, !527, !528, !558, !563}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !524, file: !38, line: 63, baseType: !141, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !524, file: !38, line: 64, baseType: !144, size: 16, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !524, file: !38, line: 65, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !38, line: 59, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !533, !521, !548, !550}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !38, line: 56, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !38, line: 135, size: 320, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !535, file: !38, line: 136, baseType: !37, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !535, file: !38, line: 137, baseType: !147, size: 8, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !535, file: !38, line: 138, baseType: !144, size: 16, offset: 48)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !535, file: !38, line: 139, baseType: !156, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !535, file: !38, line: 140, baseType: !247, size: 128, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !535, file: !38, line: 141, baseType: !141, size: 32, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !38, line: 144, baseType: !544, offset: 288)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, elements: !160)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !38, line: 142, size: 8, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !545, file: !38, line: 143, baseType: !115, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !552)
!552 = !{!553, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !551, file: !554, line: 55, baseType: !7, size: 32)
!554 = !DIFile(filename: "storage.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !551, file: !554, line: 55, baseType: !7, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !551, file: !554, line: 55, baseType: !116, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !551, file: !554, line: 55, baseType: !116, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !524, file: !38, line: 66, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !38, line: 60, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!141, !533, !114}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !524, file: !38, line: 67, baseType: !114, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !179, file: !6, line: 724, baseType: !116, size: 64, offset: 54336)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !179, file: !6, line: 728, baseType: !141, size: 32, offset: 54400)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !173, file: !6, line: 786, baseType: !567, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !6, line: 781, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 794, size: 3968, elements: !570)
!570 = !{!571, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !597, !598, !599, !600, !601, !603, !604, !605, !606, !607, !608, !609, !610, !611, !617, !637, !638, !639, !640, !641, !642, !643, !644, !648, !655, !670}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !569, file: !6, line: 795, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !574, line: 16, baseType: !116)
!574 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !569, file: !6, line: 796, baseType: !141, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !569, file: !6, line: 797, baseType: !450, size: 8, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !569, file: !6, line: 798, baseType: !450, size: 8, offset: 104)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !569, file: !6, line: 799, baseType: !450, size: 8, offset: 112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !569, file: !6, line: 800, baseType: !450, size: 8, offset: 120)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !569, file: !6, line: 801, baseType: !450, size: 8, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !569, file: !6, line: 802, baseType: !450, size: 8, offset: 136)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !569, file: !6, line: 803, baseType: !450, size: 8, offset: 144)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !569, file: !6, line: 809, baseType: !5, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !569, file: !6, line: 810, baseType: !23, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !569, file: !6, line: 811, baseType: !138, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !569, file: !6, line: 812, baseType: !189, size: 1024, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !569, file: !6, line: 813, baseType: !202, size: 16, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !569, file: !6, line: 814, baseType: !202, size: 16, offset: 1296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !569, file: !6, line: 816, baseType: !114, size: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !569, file: !6, line: 817, baseType: !114, size: 64, offset: 1408)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !569, file: !6, line: 818, baseType: !141, size: 32, offset: 1472)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !569, file: !6, line: 819, baseType: !141, size: 32, offset: 1504)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !569, file: !6, line: 821, baseType: !594, size: 64, offset: 1536)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !569, file: !6, line: 822, baseType: !594, size: 64, offset: 1600)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !569, file: !6, line: 823, baseType: !114, size: 64, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !569, file: !6, line: 824, baseType: !141, size: 32, offset: 1728)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !569, file: !6, line: 832, baseType: !116, size: 64, offset: 1792)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !569, file: !6, line: 835, baseType: !141, size: 32, offset: 1856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !569, file: !6, line: 837, baseType: !141, size: 32, offset: 1888)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !569, file: !6, line: 838, baseType: !602, size: 576, offset: 1920)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 576, elements: !379)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !569, file: !6, line: 843, baseType: !7, size: 32, offset: 2496)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !569, file: !6, line: 845, baseType: !55, size: 32, offset: 2528)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !569, file: !6, line: 846, baseType: !60, size: 32, offset: 2560)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !569, file: !6, line: 847, baseType: !65, size: 32, offset: 2592)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !569, file: !6, line: 850, baseType: !141, size: 32, offset: 2624)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !569, file: !6, line: 851, baseType: !456, size: 224, offset: 2656)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !569, file: !6, line: 852, baseType: !483, size: 32, offset: 2880)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !569, file: !6, line: 854, baseType: !450, size: 8, offset: 2912)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !569, file: !6, line: 860, baseType: !612, size: 192, offset: 2944)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !6, line: 856, size: 192, elements: !613)
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !612, file: !6, line: 857, baseType: !114, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !612, file: !6, line: 858, baseType: !406, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !612, file: !6, line: 859, baseType: !406, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !569, file: !6, line: 864, baseType: !618, size: 192, offset: 3136)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !87, line: 164, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !87, line: 151, size: 192, elements: !620)
!620 = !{!621, !633}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !619, file: !87, line: 162, baseType: !622, size: 192)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !619, file: !87, line: 152, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !622, file: !87, line: 153, baseType: !147, size: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !622, file: !87, line: 154, baseType: !147, size: 8, offset: 8)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !622, file: !87, line: 155, baseType: !144, size: 16, offset: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !622, file: !87, line: 156, baseType: !147, size: 8, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !622, file: !87, line: 157, baseType: !147, size: 8, offset: 40)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !622, file: !87, line: 158, baseType: !144, size: 16, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !622, file: !87, line: 159, baseType: !119, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !622, file: !87, line: 160, baseType: !119, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !622, file: !87, line: 161, baseType: !156, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !619, file: !87, line: 163, baseType: !634, size: 192)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 24)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !569, file: !6, line: 865, baseType: !156, size: 64, offset: 3328)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !569, file: !6, line: 866, baseType: !156, size: 64, offset: 3392)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !569, file: !6, line: 867, baseType: !202, size: 16, offset: 3456)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !569, file: !6, line: 868, baseType: !141, size: 32, offset: 3488)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !569, file: !6, line: 869, baseType: !141, size: 32, offset: 3520)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !6, line: 870, baseType: !567, size: 64, offset: 3584)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !569, file: !6, line: 871, baseType: !177, size: 64, offset: 3648)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !569, file: !6, line: 872, baseType: !645, size: 64, offset: 3712)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!141, !567}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !569, file: !6, line: 873, baseType: !649, size: 64, offset: 3776)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !567, !116, !406}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !653, line: 108, baseType: !654)
!653 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !122, line: 193, baseType: !252)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !569, file: !6, line: 874, baseType: !656, size: 64, offset: 3840)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!652, !567, !659, !141}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !484, line: 257, size: 448, elements: !661)
!661 = !{!662, !663, !664, !666, !667, !668, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !660, file: !484, line: 259, baseType: !116, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !660, file: !484, line: 260, baseType: !483, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !660, file: !484, line: 262, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !660, file: !484, line: 263, baseType: !406, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !660, file: !484, line: 265, baseType: !116, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !660, file: !484, line: 266, baseType: !406, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !660, file: !484, line: 271, baseType: !141, size: 32, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !569, file: !6, line: 875, baseType: !649, size: 64, offset: 3904)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !173, file: !6, line: 787, baseType: !594, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !6, line: 788, baseType: !673, size: 960, offset: 256)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 960, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 120)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_storage_t", file: !3, line: 37, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_storage_t", file: !3, line: 25, size: 896, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !706, !707, !708, !709, !710}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !678, file: !3, line: 26, baseType: !141, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !678, file: !3, line: 27, baseType: !177, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !678, file: !3, line: 28, baseType: !567, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !678, file: !3, line: 29, baseType: !594, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_it", scope: !678, file: !3, line: 30, baseType: !435, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "io_ctx", scope: !678, file: !3, line: 31, baseType: !686, size: 512, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "obj_io", file: !72, line: 70, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obj_io", file: !72, line: 77, size: 512, elements: !688)
!688 = !{!689, !690, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !687, file: !72, line: 78, baseType: !116, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !687, file: !72, line: 79, baseType: !691, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !687, file: !72, line: 80, baseType: !114, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !687, file: !72, line: 81, baseType: !665, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !687, file: !72, line: 82, baseType: !7, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "page_version", scope: !687, file: !72, line: 83, baseType: !7, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !687, file: !72, line: 84, baseType: !7, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !687, file: !72, line: 85, baseType: !7, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "page_id", scope: !687, file: !72, line: 86, baseType: !113, size: 16, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !687, file: !72, line: 87, baseType: !71, size: 32, offset: 416)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !687, file: !72, line: 89, baseType: !701, size: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "obj_io_cb", file: !72, line: 71, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !116, !705, !141}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iovec_data", scope: !678, file: !3, line: 32, baseType: !7, size: 32, offset: 832)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !678, file: !3, line: 33, baseType: !450, size: 8, offset: 864)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !678, file: !3, line: 34, baseType: !450, size: 8, offset: 872)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc", scope: !678, file: !3, line: 35, baseType: !450, size: 8, offset: 880)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !678, file: !3, line: 36, baseType: !450, size: 8, offset: 888)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_response_header", file: !87, line: 183, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !87, line: 170, size: 192, elements: !714)
!714 = !{!715, !727}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !713, file: !87, line: 181, baseType: !716, size: 192)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !87, line: 171, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !716, file: !87, line: 172, baseType: !147, size: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !716, file: !87, line: 173, baseType: !147, size: 8, offset: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !716, file: !87, line: 174, baseType: !144, size: 16, offset: 16)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !716, file: !87, line: 175, baseType: !147, size: 8, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !716, file: !87, line: 176, baseType: !147, size: 8, offset: 40)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !716, file: !87, line: 177, baseType: !144, size: 16, offset: 48)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !716, file: !87, line: 178, baseType: !119, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !716, file: !87, line: 179, baseType: !119, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !716, file: !87, line: 180, baseType: !156, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !713, file: !87, line: 182, baseType: !634, size: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storage_compact_wrap", file: !3, line: 770, size: 896, elements: !730)
!730 = !{!731, !732, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !729, file: !3, line: 771, baseType: !686, size: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !729, file: !3, line: 772, baseType: !274, size: 320, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !729, file: !3, line: 773, baseType: !450, size: 8, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "submitted", scope: !729, file: !3, line: 774, baseType: !450, size: 8, offset: 840)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !729, file: !3, line: 775, baseType: !450, size: 8, offset: 848)
!736 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!738 = !{!739, !0, !741, !743}
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "storage_write_tid", scope: !2, file: !3, line: 572, type: !182, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "storage_compact_tid", scope: !2, file: !3, line: 766, type: !182, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "storage_compact_plock", scope: !2, file: !3, line: 767, type: !274, isLocal: true, isDefinition: true)
!745 = !{i32 7, !"Dwarf Version", i32 5}
!746 = !{i32 2, !"Debug Info Version", i32 3}
!747 = !{i32 1, !"wchar_size", i32 4}
!748 = !{i32 7, !"uwtable", i32 1}
!749 = !{!"/home/xuheng/blackbox/llvm-test/memcached/storage.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/storage.gcda", !2}
!750 = !{!"clang version 14.0.0"}
!751 = distinct !DISubprogram(name: "storage_validate_item", scope: !3, file: !3, line: 40, type: !752, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!450, !116, !435}
!754 = !{!755, !756, !757}
!755 = !DILocalVariable(name: "e", arg: 1, scope: !751, file: !3, line: 40, type: !116)
!756 = !DILocalVariable(name: "it", arg: 2, scope: !751, file: !3, line: 40, type: !435)
!757 = !DILocalVariable(name: "hdr", scope: !751, file: !3, line: 41, type: !106)
!758 = !DILocation(line: 0, scope: !751)
!759 = !DILocation(line: 41, column: 33, scope: !751)
!760 = !{!761, !761, i64 0}
!761 = !{!"omnipotent char", !762, i64 0}
!762 = !{!"Simple C/C++ TBAA"}
!763 = !{!764, !764, i64 0}
!764 = !{!"short", !761, i64 0}
!765 = !DILocation(line: 42, column: 32, scope: !766)
!766 = distinct !DILexicalBlock(scope: !751, file: !3, line: 42, column: 9)
!767 = !{!768, !764, i64 8}
!768 = !{!"", !769, i64 0, !769, i64 4, !764, i64 8}
!769 = !{!"int", !761, i64 0}
!770 = !DILocation(line: 42, column: 27, scope: !766)
!771 = !DILocation(line: 42, column: 46, scope: !766)
!772 = !{!768, !769, i64 0}
!773 = !DILocation(line: 42, column: 41, scope: !766)
!774 = !DILocation(line: 42, column: 9, scope: !766)
!775 = !DILocation(line: 42, column: 60, scope: !766)
!776 = !DILocation(line: 0, scope: !766)
!777 = !DILocation(line: 47, column: 1, scope: !751)
!778 = !DISubprogram(name: "extstore_check", scope: !72, file: !72, line: 112, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!141, !116, !7, !156}
!781 = !{}
!782 = distinct !DISubprogram(name: "storage_delete", scope: !3, file: !3, line: 49, type: !783, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !116, !435}
!785 = !{!786, !787, !788}
!786 = !DILocalVariable(name: "e", arg: 1, scope: !782, file: !3, line: 49, type: !116)
!787 = !DILocalVariable(name: "it", arg: 2, scope: !782, file: !3, line: 49, type: !435)
!788 = !DILocalVariable(name: "hdr", scope: !789, file: !3, line: 51, type: !106)
!789 = distinct !DILexicalBlock(scope: !790, file: !3, line: 50, column: 34)
!790 = distinct !DILexicalBlock(scope: !782, file: !3, line: 50, column: 9)
!791 = !DILocation(line: 0, scope: !782)
!792 = !DILocation(line: 50, column: 13, scope: !790)
!793 = !DILocation(line: 50, column: 22, scope: !790)
!794 = !DILocation(line: 50, column: 9, scope: !782)
!795 = !DILocation(line: 51, column: 9, scope: !789)
!796 = !DILocation(line: 51, column: 37, scope: !789)
!797 = !DILocation(line: 0, scope: !789)
!798 = !DILocation(line: 52, column: 33, scope: !789)
!799 = !DILocation(line: 52, column: 28, scope: !789)
!800 = !DILocation(line: 52, column: 47, scope: !789)
!801 = !DILocation(line: 52, column: 42, scope: !789)
!802 = !DILocation(line: 53, column: 20, scope: !789)
!803 = !{!769, !769, i64 0}
!804 = !DILocation(line: 52, column: 9, scope: !789)
!805 = !DILocation(line: 54, column: 5, scope: !789)
!806 = !DILocation(line: 55, column: 1, scope: !782)
!807 = !DISubprogram(name: "extstore_delete", scope: !72, file: !72, line: 113, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!808 = !DISubroutineType(types: !809)
!809 = !{!141, !116, !7, !156, !7, !7}
!810 = distinct !DISubprogram(name: "process_extstore_stats", scope: !3, file: !3, line: 63, type: !811, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !821)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !813, !567}
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADD_STAT", file: !6, line: 189, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !817, !819, !817, !820, !548}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!821 = !{!822, !823, !824, !825, !829, !830, !831, !832, !860}
!822 = !DILocalVariable(name: "add_stats", arg: 1, scope: !810, file: !3, line: 63, type: !813)
!823 = !DILocalVariable(name: "c", arg: 2, scope: !810, file: !3, line: 63, type: !567)
!824 = !DILocalVariable(name: "i", scope: !810, file: !3, line: 64, type: !141)
!825 = !DILocalVariable(name: "key_str", scope: !810, file: !3, line: 65, type: !826)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1024, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 128)
!829 = !DILocalVariable(name: "val_str", scope: !810, file: !3, line: 66, type: !826)
!830 = !DILocalVariable(name: "klen", scope: !810, file: !3, line: 67, type: !141)
!831 = !DILocalVariable(name: "vlen", scope: !810, file: !3, line: 67, type: !141)
!832 = !DILocalVariable(name: "st", scope: !810, file: !3, line: 68, type: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_stats", file: !72, line: 20, size: 1152, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "page_allocs", scope: !833, file: !72, line: 21, baseType: !156, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "page_count", scope: !833, file: !72, line: 22, baseType: !156, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "page_evictions", scope: !833, file: !72, line: 23, baseType: !156, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "page_reclaims", scope: !833, file: !72, line: 24, baseType: !156, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !833, file: !72, line: 25, baseType: !156, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pages_free", scope: !833, file: !72, line: 26, baseType: !156, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pages_used", scope: !833, file: !72, line: 27, baseType: !156, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "objects_evicted", scope: !833, file: !72, line: 28, baseType: !156, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "objects_read", scope: !833, file: !72, line: 29, baseType: !156, size: 64, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "objects_written", scope: !833, file: !72, line: 30, baseType: !156, size: 64, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "objects_used", scope: !833, file: !72, line: 31, baseType: !156, size: 64, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_evicted", scope: !833, file: !72, line: 32, baseType: !156, size: 64, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !833, file: !72, line: 33, baseType: !156, size: 64, offset: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !833, file: !72, line: 34, baseType: !156, size: 64, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !833, file: !72, line: 35, baseType: !156, size: 64, offset: 896)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_fragmented", scope: !833, file: !72, line: 36, baseType: !156, size: 64, offset: 960)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue", scope: !833, file: !72, line: 37, baseType: !156, size: 64, offset: 1024)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "page_data", scope: !833, file: !72, line: 38, baseType: !853, size: 64, offset: 1088)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extstore_page_data", file: !72, line: 7, size: 192, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !854, file: !72, line: 8, baseType: !156, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !854, file: !72, line: 9, baseType: !156, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !854, file: !72, line: 10, baseType: !7, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "free_bucket", scope: !854, file: !72, line: 11, baseType: !7, size: 32, offset: 160)
!860 = !DILocalVariable(name: "storage", scope: !810, file: !3, line: 72, type: !116)
!861 = !DILocation(line: 0, scope: !810)
!862 = !DILocation(line: 65, column: 5, scope: !810)
!863 = !DILocation(line: 65, column: 10, scope: !810)
!864 = !DILocation(line: 66, column: 5, scope: !810)
!865 = !DILocation(line: 66, column: 10, scope: !810)
!866 = !DILocation(line: 68, column: 5, scope: !810)
!867 = !DILocation(line: 68, column: 27, scope: !810)
!868 = !DILocation(line: 70, column: 5, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 70, column: 5)
!870 = distinct !DILexicalBlock(scope: !810, file: !3, line: 70, column: 5)
!871 = !DILocation(line: 70, column: 5, scope: !870)
!872 = !DILocation(line: 72, column: 24, scope: !810)
!873 = !{!874, !875, i64 456}
!874 = !{!"conn", !875, i64 0, !769, i64 8, !876, i64 12, !876, i64 13, !876, i64 14, !876, i64 15, !876, i64 16, !876, i64 17, !876, i64 18, !761, i64 20, !761, i64 24, !769, i64 28, !877, i64 32, !764, i64 160, !764, i64 162, !875, i64 168, !875, i64 176, !769, i64 184, !769, i64 188, !875, i64 192, !875, i64 200, !875, i64 208, !769, i64 216, !875, i64 224, !769, i64 232, !769, i64 236, !761, i64 240, !769, i64 312, !761, i64 316, !761, i64 320, !761, i64 324, !769, i64 328, !882, i64 332, !769, i64 360, !876, i64 364, !884, i64 368, !761, i64 392, !881, i64 416, !881, i64 424, !764, i64 432, !769, i64 436, !769, i64 440, !875, i64 448, !875, i64 456, !875, i64 464, !875, i64 472, !875, i64 480, !875, i64 488}
!875 = !{!"any pointer", !761, i64 0}
!876 = !{!"_Bool", !761, i64 0}
!877 = !{!"event", !878, i64 0, !761, i64 40, !769, i64 56, !875, i64 64, !761, i64 72, !764, i64 104, !764, i64 106, !880, i64 112}
!878 = !{!"event_callback", !879, i64 0, !764, i64 16, !761, i64 18, !761, i64 19, !761, i64 24, !875, i64 32}
!879 = !{!"", !875, i64 0, !875, i64 8}
!880 = !{!"timeval", !881, i64 0, !881, i64 8}
!881 = !{!"long", !761, i64 0}
!882 = !{!"sockaddr_in6", !764, i64 0, !764, i64 2, !769, i64 4, !883, i64 8, !769, i64 24}
!883 = !{!"in6_addr", !761, i64 0}
!884 = !{!"", !875, i64 0, !881, i64 8, !881, i64 16}
!885 = !DILocation(line: 72, column: 32, scope: !810)
!886 = !{!887, !875, i64 6776}
!887 = !{!"", !881, i64 0, !875, i64 8, !877, i64 16, !769, i64 144, !888, i64 152, !761, i64 6600, !875, i64 6744, !875, i64 6752, !875, i64 6760, !875, i64 6768, !875, i64 6776, !875, i64 6784, !875, i64 6792, !769, i64 6800}
!888 = !{!"thread_stats", !761, i64 0, !881, i64 40, !881, i64 48, !881, i64 56, !881, i64 64, !881, i64 72, !881, i64 80, !881, i64 88, !881, i64 96, !881, i64 104, !881, i64 112, !881, i64 120, !881, i64 128, !881, i64 136, !881, i64 144, !881, i64 152, !881, i64 160, !881, i64 168, !881, i64 176, !881, i64 184, !881, i64 192, !881, i64 200, !881, i64 208, !881, i64 216, !881, i64 224, !881, i64 232, !881, i64 240, !881, i64 248, !881, i64 256, !881, i64 264, !881, i64 272, !761, i64 280, !761, i64 4376, !881, i64 6424, !881, i64 6432, !881, i64 6440}
!889 = !DILocation(line: 73, column: 17, scope: !890)
!890 = distinct !DILexicalBlock(scope: !810, file: !3, line: 73, column: 9)
!891 = !DILocation(line: 73, column: 9, scope: !810)
!892 = !DILocation(line: 76, column: 5, scope: !810)
!893 = !DILocation(line: 77, column: 30, scope: !810)
!894 = !{!895, !881, i64 8}
!895 = !{!"extstore_stats", !881, i64 0, !881, i64 8, !881, i64 16, !881, i64 24, !881, i64 32, !881, i64 40, !881, i64 48, !881, i64 56, !881, i64 64, !881, i64 72, !881, i64 80, !881, i64 88, !881, i64 96, !881, i64 104, !881, i64 112, !881, i64 120, !881, i64 128, !875, i64 136}
!896 = !DILocation(line: 77, column: 20, scope: !810)
!897 = !DILocation(line: 77, column: 8, scope: !810)
!898 = !DILocation(line: 77, column: 18, scope: !810)
!899 = !{!895, !875, i64 136}
!900 = !DILocation(line: 78, column: 5, scope: !810)
!901 = !DILocation(line: 80, column: 24, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 80, column: 5)
!903 = distinct !DILexicalBlock(scope: !810, file: !3, line: 80, column: 5)
!904 = !DILocation(line: 80, column: 19, scope: !902)
!905 = !DILocation(line: 80, column: 5, scope: !903)
!906 = !DILocation(line: 81, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !902, file: !3, line: 80, column: 41)
!908 = !{!909, !881, i64 0}
!909 = !{!"extstore_page_data", !881, i64 0, !881, i64 8, !769, i64 16, !769, i64 20}
!910 = !DILocation(line: 83, column: 9, scope: !907)
!911 = !{!909, !881, i64 8}
!912 = !DILocation(line: 85, column: 9, scope: !907)
!913 = !{!909, !769, i64 16}
!914 = !DILocation(line: 87, column: 9, scope: !907)
!915 = !{!909, !769, i64 20}
!916 = !DILocation(line: 80, column: 37, scope: !902)
!917 = distinct !{!917, !905, !918, !919}
!918 = !DILocation(line: 89, column: 5, scope: !903)
!919 = !{!"llvm.loop.mustprogress"}
!920 = !DILocation(line: 90, column: 1, scope: !810)
!921 = !DISubprogram(name: "extstore_get_stats", scope: !72, file: !72, line: 114, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !116, !924}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!925 = !DISubprogram(name: "calloc", scope: !926, file: !926, line: 542, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!926 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!927 = !DISubroutineType(types: !928)
!928 = !{!116, !406, !406}
!929 = !DISubprogram(name: "extstore_get_page_data", scope: !72, file: !72, line: 118, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!930 = !DISubprogram(name: "snprintf", scope: !931, file: !931, line: 354, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!931 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!932 = !DISubroutineType(types: !933)
!933 = !{!141, !934, !406, !935, null}
!934 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !114)
!935 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !817)
!936 = distinct !DISubprogram(name: "storage_stats", scope: !3, file: !3, line: 93, type: !811, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !937)
!937 = !{!938, !939, !940}
!938 = !DILocalVariable(name: "add_stats", arg: 1, scope: !936, file: !3, line: 93, type: !813)
!939 = !DILocalVariable(name: "c", arg: 2, scope: !936, file: !3, line: 93, type: !567)
!940 = !DILocalVariable(name: "st", scope: !936, file: !3, line: 94, type: !833)
!941 = !DILocation(line: 0, scope: !936)
!942 = !DILocation(line: 94, column: 5, scope: !936)
!943 = !DILocation(line: 94, column: 27, scope: !936)
!944 = !DILocation(line: 95, column: 12, scope: !945)
!945 = distinct !DILexicalBlock(scope: !936, file: !3, line: 95, column: 9)
!946 = !DILocation(line: 95, column: 20, scope: !945)
!947 = !DILocation(line: 95, column: 9, scope: !945)
!948 = !DILocation(line: 95, column: 9, scope: !936)
!949 = !DILocation(line: 96, column: 9, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !3, line: 95, column: 29)
!951 = !DILocation(line: 97, column: 9, scope: !950)
!952 = !{!953, !881, i64 152}
!953 = !{!"stats", !881, i64 0, !881, i64 8, !881, i64 16, !881, i64 24, !881, i64 32, !881, i64 40, !881, i64 48, !881, i64 56, !881, i64 64, !881, i64 72, !881, i64 80, !881, i64 88, !881, i64 96, !881, i64 104, !881, i64 112, !881, i64 120, !881, i64 128, !881, i64 136, !881, i64 144, !881, i64 152, !881, i64 160, !881, i64 168, !880, i64 176, !881, i64 192, !881, i64 200}
!954 = !DILocation(line: 98, column: 9, scope: !950)
!955 = !{!953, !881, i64 160}
!956 = !DILocation(line: 99, column: 9, scope: !950)
!957 = !{!953, !881, i64 168}
!958 = !DILocation(line: 100, column: 9, scope: !950)
!959 = !DILocation(line: 101, column: 31, scope: !950)
!960 = !DILocation(line: 101, column: 39, scope: !950)
!961 = !DILocation(line: 101, column: 9, scope: !950)
!962 = !DILocation(line: 102, column: 9, scope: !950)
!963 = !{!895, !881, i64 0}
!964 = !DILocation(line: 103, column: 9, scope: !950)
!965 = !{!895, !881, i64 16}
!966 = !DILocation(line: 104, column: 9, scope: !950)
!967 = !{!895, !881, i64 24}
!968 = !DILocation(line: 105, column: 9, scope: !950)
!969 = !{!895, !881, i64 40}
!970 = !DILocation(line: 106, column: 9, scope: !950)
!971 = !{!895, !881, i64 48}
!972 = !DILocation(line: 107, column: 9, scope: !950)
!973 = !{!895, !881, i64 56}
!974 = !DILocation(line: 108, column: 9, scope: !950)
!975 = !{!895, !881, i64 64}
!976 = !DILocation(line: 109, column: 9, scope: !950)
!977 = !{!895, !881, i64 72}
!978 = !DILocation(line: 110, column: 9, scope: !950)
!979 = !{!895, !881, i64 80}
!980 = !DILocation(line: 111, column: 9, scope: !950)
!981 = !{!895, !881, i64 88}
!982 = !DILocation(line: 112, column: 9, scope: !950)
!983 = !{!895, !881, i64 96}
!984 = !DILocation(line: 113, column: 9, scope: !950)
!985 = !{!895, !881, i64 104}
!986 = !DILocation(line: 114, column: 9, scope: !950)
!987 = !{!895, !881, i64 112}
!988 = !DILocation(line: 115, column: 9, scope: !950)
!989 = !{!895, !881, i64 120}
!990 = !DILocation(line: 116, column: 9, scope: !950)
!991 = !{!895, !881, i64 32}
!992 = !DILocation(line: 117, column: 9, scope: !950)
!993 = !{!895, !881, i64 128}
!994 = !DILocation(line: 118, column: 5, scope: !950)
!995 = !DILocation(line: 120, column: 1, scope: !936)
!996 = !DISubprogram(name: "STATS_LOCK", scope: !6, file: !6, line: 991, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!997 = !DISubroutineType(types: !998)
!998 = !{null}
!999 = !DISubprogram(name: "append_stat", scope: !6, file: !6, line: 1001, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, !817, !813, !567, !817, null}
!1002 = !DISubprogram(name: "STATS_UNLOCK", scope: !6, file: !6, line: 992, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !781)
!1003 = distinct !DISubprogram(name: "storage_get_item", scope: !3, file: !3, line: 239, type: !1004, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!141, !567, !435, !594}
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1019, !1020, !1021, !1024, !1025, !1026}
!1007 = !DILocalVariable(name: "c", arg: 1, scope: !1003, file: !3, line: 239, type: !567)
!1008 = !DILocalVariable(name: "it", arg: 2, scope: !1003, file: !3, line: 239, type: !435)
!1009 = !DILocalVariable(name: "resp", arg: 3, scope: !1003, file: !3, line: 239, type: !594)
!1010 = !DILocalVariable(name: "hdr", scope: !1003, file: !3, line: 244, type: !106)
!1011 = !DILocalVariable(name: "q", scope: !1003, file: !3, line: 246, type: !363)
!1012 = !DILocalVariable(name: "ntotal", scope: !1003, file: !3, line: 247, type: !406)
!1013 = !DILocalVariable(name: "clsid", scope: !1003, file: !3, line: 248, type: !7)
!1014 = !DILocalVariable(name: "new_it", scope: !1003, file: !3, line: 249, type: !435)
!1015 = !DILocalVariable(name: "chunked", scope: !1003, file: !3, line: 250, type: !450)
!1016 = !DILocalVariable(name: "flags", scope: !1017, file: !3, line: 253, type: !119)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 251, column: 48)
!1018 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 251, column: 9)
!1019 = !DILocalVariable(name: "p", scope: !1003, file: !3, line: 266, type: !676)
!1020 = !DILocalVariable(name: "eio", scope: !1003, file: !3, line: 278, type: !705)
!1021 = !DILocalVariable(name: "ciovcnt", scope: !1022, file: !3, line: 282, type: !7)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 281, column: 18)
!1023 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 281, column: 9)
!1024 = !DILocalVariable(name: "remain", scope: !1022, file: !3, line: 283, type: !406)
!1025 = !DILocalVariable(name: "chunk", scope: !1022, file: !3, line: 284, type: !123)
!1026 = !DILocalVariable(name: "iovtotal", scope: !1003, file: !3, line: 324, type: !141)
!1027 = !DILocation(line: 0, scope: !1003)
!1028 = !DILocation(line: 244, column: 33, scope: !1003)
!1029 = !DILocation(line: 246, column: 21, scope: !1003)
!1030 = !DILocation(line: 247, column: 21, scope: !1003)
!1031 = !DILocation(line: 248, column: 26, scope: !1003)
!1032 = !DILocation(line: 251, column: 27, scope: !1018)
!1033 = !{!1034, !769, i64 128}
!1034 = !{!"settings", !881, i64 0, !769, i64 8, !769, i64 12, !769, i64 16, !875, i64 24, !769, i64 32, !769, i64 36, !881, i64 40, !769, i64 48, !875, i64 56, !875, i64 64, !769, i64 72, !1035, i64 80, !769, i64 88, !769, i64 92, !769, i64 96, !761, i64 100, !769, i64 104, !769, i64 108, !876, i64 112, !761, i64 116, !769, i64 120, !769, i64 124, !769, i64 128, !769, i64 132, !769, i64 136, !876, i64 140, !876, i64 141, !876, i64 142, !876, i64 143, !876, i64 144, !876, i64 145, !769, i64 148, !1035, i64 152, !769, i64 160, !769, i64 164, !876, i64 168, !769, i64 172, !876, i64 176, !876, i64 177, !875, i64 184, !769, i64 192, !769, i64 196, !769, i64 200, !769, i64 204, !1035, i64 208, !1035, i64 216, !769, i64 224, !876, i64 228, !769, i64 232, !769, i64 236, !769, i64 240, !769, i64 244, !769, i64 248, !876, i64 252, !876, i64 253, !876, i64 254, !876, i64 255, !769, i64 256, !769, i64 260, !769, i64 264, !769, i64 268, !769, i64 272, !769, i64 276, !769, i64 280, !769, i64 284, !769, i64 288, !769, i64 292, !1035, i64 296, !1035, i64 304, !876, i64 312, !769, i64 316, !769, i64 320, !875, i64 328, !769, i64 336}
!1035 = !{!"double", !761, i64 0}
!1036 = !DILocation(line: 251, column: 18, scope: !1018)
!1037 = !DILocation(line: 251, column: 16, scope: !1018)
!1038 = !DILocation(line: 251, column: 9, scope: !1003)
!1039 = !DILocation(line: 254, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 254, column: 9)
!1041 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 254, column: 9)
!1042 = !DILocation(line: 254, column: 9, scope: !1041)
!1043 = !DILocation(line: 254, column: 9, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 254, column: 9)
!1045 = !DILocation(line: 0, scope: !1017)
!1046 = !DILocation(line: 254, column: 9, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 254, column: 9)
!1048 = !DILocation(line: 255, column: 47, scope: !1017)
!1049 = !DILocation(line: 255, column: 29, scope: !1017)
!1050 = !DILocation(line: 255, column: 43, scope: !1017)
!1051 = !DILocation(line: 0, scope: !1040)
!1052 = !DILocation(line: 255, column: 64, scope: !1017)
