; ModuleID = 'testapp.c'
source_filename = "testapp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.testcase = type { i8*, i32 ()* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.conn = type { i32, i64 (%struct.conn*, i8*, i64)*, i64 (%struct.conn*, i8*, i64)* }
%struct.cache_t = type { %union.pthread_mutex_t, i8*, %struct.cache_head, i64, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.cache_head = type { %struct.cache_free_s*, %struct.cache_free_s** }
%struct.cache_free_s = type { %struct.anon }
%struct.anon = type { %struct.cache_free_s* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct._prefix_stats = type { i8*, i64, i64, i64, i64, i64, %struct._prefix_stats* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "testcases", scope: !2, file: !3, line: 2248, type: !179, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, globals: !156, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "testapp.c", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "17d65064597a8305c334fe76bc0da477")
!4 = !{!5, !11, !74, !125, !138, !142}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "test_return", file: !3, line: 35, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "TEST_SKIP", value: 0)
!9 = !DIEnumerator(name: "TEST_PASS", value: 1)
!10 = !DIEnumerator(name: "TEST_FAIL", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !12, file: !3, line: 2159, baseType: !6, size: 32, elements: !72)
!12 = distinct !DISubprogram(name: "test_issue_101", scope: !3, file: !3, line: 2158, type: !13, scopeLine: 2158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !15)
!13 = !DISubroutineType(types: !14)
!14 = !{!5}
!15 = !{!16, !17, !45, !46, !50, !54, !55, !60, !62, !66, !67, !71}
!16 = !DILocalVariable(name: "ret", scope: !12, file: !3, line: 2160, type: !5)
!17 = !DILocalVariable(name: "conns", scope: !12, file: !3, line: 2161, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !43)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !3, line: 37, size: 192, elements: !21)
!21 = !{!22, !24, !37}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !20, file: !3, line: 38, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !20, file: !3, line: 43, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !19, !33, !34}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !29, line: 108, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 193, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!32 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!36 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !20, file: !3, line: 44, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!28, !19, !41, !34}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !{!44}
!44 = !DISubrange(count: 2)
!45 = !DILocalVariable(name: "ii", scope: !12, file: !3, line: 2162, type: !23)
!46 = !DILocalVariable(name: "child", scope: !12, file: !3, line: 2163, type: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !48, line: 38, baseType: !49)
!48 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "58e12bcb11143fdc5cf2ef5376462456")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !31, line: 154, baseType: !23)
!50 = !DILocalVariable(name: "command", scope: !12, file: !3, line: 2169, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DILocalVariable(name: "cmdlen", scope: !12, file: !3, line: 2170, type: !34)
!55 = !DILocalVariable(name: "more", scope: !56, file: !3, line: 2183, type: !59)
!56 = distinct !DILexicalBlock(scope: !57, file: !3, line: 2182, column: 34)
!57 = distinct !DILexicalBlock(scope: !58, file: !3, line: 2182, column: 5)
!58 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2182, column: 5)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DILocalVariable(name: "err", scope: !61, file: !3, line: 2185, type: !28)
!61 = distinct !DILexicalBlock(scope: !56, file: !3, line: 2184, column: 12)
!62 = !DILocalVariable(name: "stat", scope: !63, file: !3, line: 2206, type: !23)
!63 = distinct !DILexicalBlock(scope: !64, file: !3, line: 2205, column: 27)
!64 = distinct !DILexicalBlock(scope: !65, file: !3, line: 2205, column: 16)
!65 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2203, column: 9)
!66 = !DILocalVariable(name: "c", scope: !63, file: !3, line: 2207, type: !47)
!67 = !DILocalVariable(name: "c", scope: !68, file: !3, line: 2222, type: !19)
!68 = distinct !DILexicalBlock(scope: !69, file: !3, line: 2221, column: 34)
!69 = distinct !DILexicalBlock(scope: !70, file: !3, line: 2221, column: 5)
!70 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2221, column: 5)
!71 = !DILabel(scope: !12, name: "cleanup", file: !3, line: 2219)
!72 = !{!73}
!73 = !DIEnumerator(name: "max", value: 2)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 80, baseType: !6, size: 32, elements: !76)
!75 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!77 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GET", value: 0)
!78 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SET", value: 1)
!79 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADD", value: 2)
!80 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACE", value: 3)
!81 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETE", value: 4)
!82 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENT", value: 5)
!83 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENT", value: 6)
!84 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUIT", value: 7)
!85 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSH", value: 8)
!86 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETQ", value: 9)
!87 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_NOOP", value: 10)
!88 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_VERSION", value: 11)
!89 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETK", value: 12)
!90 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GETKQ", value: 13)
!91 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPEND", value: 14)
!92 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPEND", value: 15)
!93 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_STAT", value: 16)
!94 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SETQ", value: 17)
!95 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_ADDQ", value: 18)
!96 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_REPLACEQ", value: 19)
!97 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DELETEQ", value: 20)
!98 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_INCREMENTQ", value: 21)
!99 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_DECREMENTQ", value: 22)
!100 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_QUITQ", value: 23)
!101 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_FLUSHQ", value: 24)
!102 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_APPENDQ", value: 25)
!103 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_PREPENDQ", value: 26)
!104 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_TOUCH", value: 28)
!105 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GAT", value: 29)
!106 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATQ", value: 30)
!107 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATK", value: 35)
!108 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_GATKQ", value: 36)
!109 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_LIST_MECHS", value: 32)
!110 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_AUTH", value: 33)
!111 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_SASL_STEP", value: 34)
!112 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RGET", value: 48)
!113 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSET", value: 49)
!114 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RSETQ", value: 50)
!115 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPEND", value: 51)
!116 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RAPPENDQ", value: 52)
!117 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPEND", value: 53)
!118 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RPREPENDQ", value: 54)
!119 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETE", value: 55)
!120 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDELETEQ", value: 56)
!121 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCR", value: 57)
!122 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RINCRQ", value: 58)
!123 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECR", value: 59)
!124 = !DIEnumerator(name: "PROTOCOL_BINARY_CMD_RDECRQ", value: 60)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 62, baseType: !6, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!127 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_SUCCESS", value: 0)
!128 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_ENOENT", value: 1)
!129 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_KEY_EEXISTS", value: 2)
!130 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_E2BIG", value: 3)
!131 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_EINVAL", value: 4)
!132 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_NOT_STORED", value: 5)
!133 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_DELTA_BADVAL", value: 6)
!134 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_ERROR", value: 32)
!135 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_AUTH_CONTINUE", value: 33)
!136 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_UNKNOWN_COMMAND", value: 129)
!137 = !DIEnumerator(name: "PROTOCOL_BINARY_RESPONSE_ENOMEM", value: 130)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 53, baseType: !6, size: 32, elements: !139)
!139 = !{!140, !141}
!140 = !DIEnumerator(name: "PROTOCOL_BINARY_REQ", value: 128)
!141 = !DIEnumerator(name: "PROTOCOL_BINARY_RES", value: 129)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 143, baseType: !6, size: 32, elements: !143)
!143 = !{!144}
!144 = !DIEnumerator(name: "PROTOCOL_BINARY_RAW_BYTES", value: 0)
!145 = !{!33, !32, !146, !47, !19, !6, !150, !152, !23, !153}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !147, line: 119, baseType: !148)
!147 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !149, line: 25, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !151)
!151 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !149, line: 24, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !{!0, !157, !166, !169, !171, !173, !175, !177}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "hash", scope: !2, file: !3, line: 47, type: !159, isLocal: false, isDefinition: true)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_func", file: !160, line: 4, baseType: !161)
!160 = !DIFile(filename: "./hash.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7bf64ed462fb4e5d2a6ceb2b3243c634")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !41, !34}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !149, line: 26, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !6)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "hickup_thread_running", scope: !2, file: !3, line: 1996, type: !168, isLocal: false, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "port", scope: !2, file: !3, line: 78, type: !146, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "server_pid", scope: !2, file: !3, line: 77, type: !47, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "enable_ssl", scope: !2, file: !3, line: 81, type: !59, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "con", scope: !2, file: !3, line: 79, type: !19, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "allow_closed_read", scope: !2, file: !3, line: 80, type: !59, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 7296, elements: !186)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "testcase", file: !3, line: 2243, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !180, file: !3, line: 2244, baseType: !51, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !180, file: !3, line: 2245, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEST_FUNC", file: !3, line: 2242, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!186 = !{!187}
!187 = !DISubrange(count: 57)
!188 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!189 = !{i32 7, !"Dwarf Version", i32 5}
!190 = !{i32 2, !"Debug Info Version", i32 3}
!191 = !{i32 1, !"wchar_size", i32 4}
!192 = !{i32 7, !"uwtable", i32 1}
!193 = !{!"clang version 14.0.0"}
!194 = distinct !DISubprogram(name: "cache_create_test", scope: !3, file: !3, line: 98, type: !13, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !195)
!195 = !{!196}
!196 = !DILocalVariable(name: "cache", scope: !194, file: !3, line: 100, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !199, line: 39, baseType: !200)
!199 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 22, size: 704, elements: !201)
!201 = !{!202, !232, !233, !246, !247, !248, !249, !250}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !200, file: !199, line: 24, baseType: !203, size: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !204, line: 72, baseType: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !204, line: 67, size: 320, elements: !206)
!206 = !{!207, !227, !231}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !205, file: !204, line: 69, baseType: !208, size: 320)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !209, line: 22, size: 320, elements: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!210 = !{!211, !212, !213, !214, !215, !216, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !208, file: !209, line: 24, baseType: !23, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !208, file: !209, line: 25, baseType: !6, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !208, file: !209, line: 26, baseType: !23, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !208, file: !209, line: 28, baseType: !6, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !208, file: !209, line: 32, baseType: !23, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !208, file: !209, line: 34, baseType: !217, size: 16, offset: 160)
!217 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !208, file: !209, line: 35, baseType: !217, size: 16, offset: 176)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !208, file: !209, line: 36, baseType: !220, size: 128, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !221, line: 53, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !221, line: 49, size: 128, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !222, file: !221, line: 51, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !222, file: !221, line: 52, baseType: !225, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !205, file: !204, line: 70, baseType: !228, size: 320)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 40)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !205, file: !204, line: 71, baseType: !32, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !199, line: 26, baseType: !152, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !200, file: !199, line: 28, baseType: !234, size: 128, offset: 384)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !199, line: 28, size: 128, elements: !235)
!235 = !{!236, !244}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !234, file: !199, line: 28, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !199, line: 12, size: 64, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !238, file: !199, line: 13, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !199, line: 13, size: 64, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !241, file: !199, line: 13, baseType: !237, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !234, file: !199, line: 28, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !200, file: !199, line: 30, baseType: !34, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !200, file: !199, line: 32, baseType: !23, size: 32, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !200, file: !199, line: 34, baseType: !23, size: 32, offset: 608)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !200, file: !199, line: 36, baseType: !23, size: 32, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !200, file: !199, line: 38, baseType: !23, size: 32, offset: 672)
!251 = !DILocation(line: 100, column: 22, scope: !194)
!252 = !DILocation(line: 0, scope: !194)
!253 = !DILocation(line: 101, column: 5, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 101, column: 5)
!255 = distinct !DILexicalBlock(scope: !194, file: !3, line: 101, column: 5)
!256 = !DILocation(line: 101, column: 5, scope: !255)
!257 = !DILocation(line: 102, column: 5, scope: !194)
!258 = !DILocation(line: 103, column: 5, scope: !194)
!259 = distinct !DISubprogram(name: "cache_reuse_test", scope: !3, file: !3, line: 106, type: !13, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DILocalVariable(name: "ii", scope: !259, file: !3, line: 108, type: !23)
!262 = !DILocalVariable(name: "cache", scope: !259, file: !3, line: 109, type: !197)
!263 = !DILocalVariable(name: "ptr", scope: !259, file: !3, line: 113, type: !152)
!264 = !DILocalVariable(name: "p", scope: !265, file: !3, line: 116, type: !152)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 115, column: 34)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 115, column: 5)
!267 = distinct !DILexicalBlock(scope: !259, file: !3, line: 115, column: 5)
!268 = !DILocation(line: 109, column: 22, scope: !259)
!269 = !DILocation(line: 0, scope: !259)
!270 = !DILocation(line: 110, column: 15, scope: !271)
!271 = distinct !DILexicalBlock(scope: !259, file: !3, line: 110, column: 9)
!272 = !DILocation(line: 110, column: 9, scope: !259)
!273 = !DILocation(line: 113, column: 17, scope: !259)
!274 = !DILocation(line: 114, column: 5, scope: !259)
!275 = !DILocation(line: 115, column: 5, scope: !267)
!276 = !DILocation(line: 116, column: 19, scope: !265)
!277 = !DILocation(line: 0, scope: !265)
!278 = !DILocation(line: 117, column: 9, scope: !279)
!279 = distinct !DILexicalBlock(scope: !280, file: !3, line: 117, column: 9)
!280 = distinct !DILexicalBlock(scope: !265, file: !3, line: 117, column: 9)
!281 = !DILocation(line: 117, column: 9, scope: !280)
!282 = !DILocation(line: 118, column: 9, scope: !265)
!283 = !DILocation(line: 115, column: 28, scope: !266)
!284 = !DILocation(line: 115, column: 21, scope: !266)
!285 = distinct !{!285, !275, !286, !287}
!286 = !DILocation(line: 119, column: 5, scope: !267)
!287 = !{!"llvm.loop.mustprogress"}
!288 = !DILocation(line: 120, column: 5, scope: !259)
!289 = !DILocation(line: 122, column: 1, scope: !259)
!290 = distinct !DISubprogram(name: "cache_redzone_test", scope: !3, file: !3, line: 159, type: !13, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !291)
!291 = !{!292, !293, !398, !399, !400}
!292 = !DILocalVariable(name: "cache", scope: !290, file: !3, line: 162, type: !197)
!293 = !DILocalVariable(name: "old_action", scope: !290, file: !3, line: 168, type: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !295, line: 27, size: 1216, elements: !296)
!295 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "1805cae78f5d4b57699d05e93bbc6a62")
!296 = !{!297, !384, !393, !394}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !294, file: !295, line: 38, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !295, line: 31, size: 64, elements: !299)
!299 = !{!300, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !298, file: !295, line: 34, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !302, line: 72, baseType: !303)
!302 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ccc98b488c777571beae1a47763d91")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !23}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !298, file: !295, line: 36, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !23, !310, !33}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !312, line: 124, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 36, size: 1024, elements: !314)
!314 = !{!315, !316, !317, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !313, file: !312, line: 38, baseType: !23, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !313, file: !312, line: 40, baseType: !23, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !313, file: !312, line: 42, baseType: !23, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !313, file: !312, line: 48, baseType: !23, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !313, file: !312, line: 123, baseType: !320, size: 896, offset: 128)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !312, line: 51, size: 896, elements: !321)
!321 = !{!322, !326, !332, !344, !350, !359, !373, !378}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !320, file: !312, line: 53, baseType: !323, size: 896)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 896, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 28)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !320, file: !312, line: 60, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 56, size: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !327, file: !312, line: 58, baseType: !49, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !327, file: !312, line: 59, baseType: !331, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !31, line: 146, baseType: !6)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !320, file: !312, line: 68, baseType: !333, size: 128)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 63, size: 128, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !333, file: !312, line: 65, baseType: !23, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !333, file: !312, line: 66, baseType: !23, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !333, file: !312, line: 67, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !339, line: 30, baseType: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "b8454a73bc9e55d1e2fd22e496f3e023")
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !339, line: 24, size: 64, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !340, file: !339, line: 26, baseType: !23, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !340, file: !339, line: 27, baseType: !33, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !320, file: !312, line: 76, baseType: !345, size: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 71, size: 128, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !345, file: !312, line: 73, baseType: !49, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !345, file: !312, line: 74, baseType: !331, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !345, file: !312, line: 75, baseType: !338, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !320, file: !312, line: 86, baseType: !351, size: 256)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 79, size: 256, elements: !352)
!352 = !{!353, !354, !355, !356, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !351, file: !312, line: 81, baseType: !49, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !351, file: !312, line: 82, baseType: !331, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !351, file: !312, line: 83, baseType: !23, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !351, file: !312, line: 84, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !31, line: 156, baseType: !32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !351, file: !312, line: 85, baseType: !357, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !320, file: !312, line: 105, baseType: !360, size: 256)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 89, size: 256, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !360, file: !312, line: 91, baseType: !33, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !360, file: !312, line: 93, baseType: !217, size: 16, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !360, file: !312, line: 104, baseType: !365, size: 128, offset: 128)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !360, file: !312, line: 94, size: 128, elements: !366)
!366 = !{!367, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !365, file: !312, line: 101, baseType: !368, size: 128)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !312, line: 97, size: 128, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !368, file: !312, line: 99, baseType: !33, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !368, file: !312, line: 100, baseType: !33, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !365, file: !312, line: 103, baseType: !165, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !320, file: !312, line: 112, baseType: !374, size: 128)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 108, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !374, file: !312, line: 110, baseType: !32, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !374, file: !312, line: 111, baseType: !23, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !320, file: !312, line: 121, baseType: !379, size: 128)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !312, line: 116, size: 128, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !379, file: !312, line: 118, baseType: !33, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !379, file: !312, line: 119, baseType: !23, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !379, file: !312, line: 120, baseType: !6, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !294, file: !295, line: 46, baseType: !385, size: 1024, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !386, line: 8, baseType: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 5, size: 1024, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !387, file: !386, line: 7, baseType: !390, size: 1024)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1024, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !294, file: !295, line: 49, baseType: !23, size: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !294, file: !295, line: 52, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null}
!398 = !DILocalVariable(name: "action", scope: !290, file: !3, line: 169, type: !294)
!399 = !DILocalVariable(name: "p", scope: !290, file: !3, line: 174, type: !152)
!400 = !DILocalVariable(name: "old", scope: !290, file: !3, line: 175, type: !53)
!401 = !DILocation(line: 162, column: 22, scope: !290)
!402 = !DILocation(line: 0, scope: !290)
!403 = !DILocation(line: 164, column: 15, scope: !404)
!404 = distinct !DILexicalBlock(scope: !290, file: !3, line: 164, column: 9)
!405 = !DILocation(line: 164, column: 9, scope: !290)
!406 = !DILocation(line: 168, column: 5, scope: !290)
!407 = !DILocation(line: 168, column: 22, scope: !290)
!408 = !DILocation(line: 169, column: 5, scope: !290)
!409 = !DILocation(line: 169, column: 22, scope: !290)
!410 = !DILocation(line: 170, column: 25, scope: !290)
!411 = !DILocation(line: 170, column: 5, scope: !290)
!412 = !DILocation(line: 171, column: 5, scope: !290)
!413 = !DILocation(line: 174, column: 15, scope: !290)
!414 = !DILocation(line: 175, column: 20, scope: !290)
!415 = !DILocation(line: 175, column: 16, scope: !290)
!416 = !{!417, !417, i64 0}
!417 = !{!"omnipotent char", !418, i64 0}
!418 = !{!"Simple C/C++ TBAA"}
!419 = !DILocation(line: 176, column: 14, scope: !290)
!420 = !DILocation(line: 177, column: 5, scope: !290)
!421 = !DILocation(line: 178, column: 5, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !3, line: 178, column: 5)
!423 = distinct !DILexicalBlock(scope: !290, file: !3, line: 178, column: 5)
!424 = !{!425, !425, i64 0}
!425 = !{!"int", !417, i64 0}
!426 = !DILocation(line: 178, column: 5, scope: !423)
!427 = !DILocation(line: 179, column: 14, scope: !290)
!428 = !DILocation(line: 181, column: 5, scope: !290)
!429 = !DILocation(line: 181, column: 25, scope: !290)
!430 = !DILocation(line: 182, column: 5, scope: !290)
!431 = !DILocation(line: 183, column: 5, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !3, line: 183, column: 5)
!433 = distinct !DILexicalBlock(scope: !290, file: !3, line: 183, column: 5)
!434 = !DILocation(line: 183, column: 5, scope: !433)
!435 = !DILocation(line: 186, column: 5, scope: !290)
!436 = !DILocation(line: 188, column: 5, scope: !290)
!437 = !DILocation(line: 194, column: 1, scope: !290)
!438 = distinct !DISubprogram(name: "cache_limit_revised_downward_test", scope: !3, file: !3, line: 196, type: !13, scopeLine: 197, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !439)
!439 = !{!440, !441, !442, !443, !445}
!440 = !DILocalVariable(name: "limit", scope: !438, file: !3, line: 198, type: !23)
!441 = !DILocalVariable(name: "allocated_num", scope: !438, file: !3, line: 198, type: !23)
!442 = !DILocalVariable(name: "i", scope: !438, file: !3, line: 198, type: !23)
!443 = !DILocalVariable(name: "alloc_objs", scope: !438, file: !3, line: 199, type: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!445 = !DILocalVariable(name: "cache", scope: !438, file: !3, line: 201, type: !197)
!446 = !DILocation(line: 0, scope: !438)
!447 = !DILocation(line: 199, column: 26, scope: !438)
!448 = !DILocation(line: 201, column: 22, scope: !438)
!449 = !DILocation(line: 202, column: 5, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !3, line: 202, column: 5)
!451 = distinct !DILexicalBlock(scope: !438, file: !3, line: 202, column: 5)
!452 = !DILocation(line: 202, column: 5, scope: !451)
!453 = !DILocation(line: 206, column: 25, scope: !454)
!454 = distinct !DILexicalBlock(scope: !455, file: !3, line: 205, column: 41)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 205, column: 5)
!456 = distinct !DILexicalBlock(scope: !438, file: !3, line: 205, column: 5)
!457 = !DILocation(line: 206, column: 23, scope: !454)
!458 = !{!459, !459, i64 0}
!459 = !{!"any pointer", !417, i64 0}
!460 = !DILocation(line: 207, column: 9, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 207, column: 9)
!462 = distinct !DILexicalBlock(scope: !454, file: !3, line: 207, column: 9)
!463 = !DILocation(line: 207, column: 9, scope: !462)
!464 = !DILocation(line: 206, column: 9, scope: !454)
!465 = !DILocation(line: 209, column: 5, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !3, line: 209, column: 5)
!467 = distinct !DILexicalBlock(scope: !438, file: !3, line: 209, column: 5)
!468 = !{!469, !425, i64 76}
!469 = !{!"", !417, i64 0, !459, i64 40, !470, i64 48, !471, i64 64, !425, i64 72, !425, i64 76, !425, i64 80, !425, i64 84}
!470 = !{!"cache_head", !459, i64 0, !459, i64 8}
!471 = !{!"long", !417, i64 0}
!472 = !DILocation(line: 209, column: 5, scope: !467)
!473 = !DILocation(line: 212, column: 5, scope: !438)
!474 = !DILocation(line: 215, column: 5, scope: !438)
!475 = !DILocation(line: 217, column: 5, scope: !476)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 217, column: 5)
!477 = distinct !DILexicalBlock(scope: !438, file: !3, line: 217, column: 5)
!478 = !DILocation(line: 217, column: 5, scope: !477)
!479 = !DILocation(line: 218, column: 5, scope: !438)
!480 = !DILocation(line: 220, column: 5, scope: !438)
!481 = !DILocation(line: 222, column: 5, scope: !438)
!482 = distinct !DISubprogram(name: "test_stats_prefix_find", scope: !3, file: !3, line: 225, type: !13, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !483)
!483 = !{!484, !499}
!484 = !DILocalVariable(name: "pfs1", scope: !482, file: !3, line: 226, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PREFIX_STATS", file: !487, line: 41, baseType: !488)
!487 = !DIFile(filename: "./stats_prefix.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "c26de3f3a40668b5f799218415be0cc4")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_prefix_stats", file: !487, line: 42, size: 448, elements: !489)
!489 = !{!490, !491, !492, !495, !496, !497, !498}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !488, file: !487, line: 43, baseType: !152, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !488, file: !487, line: 44, baseType: !34, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "num_gets", scope: !488, file: !487, line: 45, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !149, line: 27, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 45, baseType: !36)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_sets", scope: !488, file: !487, line: 46, baseType: !493, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "num_deletes", scope: !488, file: !487, line: 47, baseType: !493, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_hits", scope: !488, file: !487, line: 48, baseType: !493, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !487, line: 49, baseType: !485, size: 64, offset: 384)
!499 = !DILocalVariable(name: "pfs2", scope: !482, file: !3, line: 226, type: !485)
!500 = !DILocation(line: 228, column: 5, scope: !482)
!501 = !DILocation(line: 229, column: 12, scope: !482)
!502 = !DILocation(line: 0, scope: !482)
!503 = !DILocation(line: 230, column: 5, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 230, column: 5)
!505 = distinct !DILexicalBlock(scope: !482, file: !3, line: 230, column: 5)
!506 = !DILocation(line: 230, column: 5, scope: !505)
!507 = !DILocation(line: 231, column: 12, scope: !482)
!508 = !DILocation(line: 232, column: 5, scope: !509)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 232, column: 5)
!510 = distinct !DILexicalBlock(scope: !482, file: !3, line: 232, column: 5)
!511 = !DILocation(line: 232, column: 5, scope: !510)
!512 = !DILocation(line: 234, column: 12, scope: !482)
!513 = !DILocation(line: 235, column: 5, scope: !514)
!514 = distinct !DILexicalBlock(scope: !515, file: !3, line: 235, column: 5)
!515 = distinct !DILexicalBlock(scope: !482, file: !3, line: 235, column: 5)
!516 = !DILocation(line: 235, column: 5, scope: !515)
!517 = !DILocation(line: 236, column: 5, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !3, line: 236, column: 5)
!519 = distinct !DILexicalBlock(scope: !482, file: !3, line: 236, column: 5)
!520 = !{!521, !471, i64 16}
!521 = !{!"_prefix_stats", !459, i64 0, !471, i64 8, !471, i64 16, !471, i64 24, !471, i64 32, !471, i64 40, !459, i64 48}
!522 = !{!521, !471, i64 24}
!523 = !{!521, !471, i64 32}
!524 = !{!521, !471, i64 40}
!525 = !DILocation(line: 236, column: 5, scope: !519)
!526 = !DILocation(line: 237, column: 12, scope: !482)
!527 = !DILocation(line: 238, column: 5, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !3, line: 238, column: 5)
!529 = distinct !DILexicalBlock(scope: !482, file: !3, line: 238, column: 5)
!530 = !DILocation(line: 238, column: 5, scope: !529)
!531 = !DILocation(line: 239, column: 12, scope: !482)
!532 = !DILocation(line: 240, column: 5, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !3, line: 240, column: 5)
!534 = distinct !DILexicalBlock(scope: !482, file: !3, line: 240, column: 5)
!535 = !DILocation(line: 240, column: 5, scope: !534)
!536 = !DILocation(line: 241, column: 12, scope: !482)
!537 = !DILocation(line: 242, column: 5, scope: !538)
!538 = distinct !DILexicalBlock(scope: !539, file: !3, line: 242, column: 5)
!539 = distinct !DILexicalBlock(scope: !482, file: !3, line: 242, column: 5)
!540 = !DILocation(line: 242, column: 5, scope: !539)
!541 = !DILocation(line: 243, column: 12, scope: !482)
!542 = !DILocation(line: 244, column: 5, scope: !543)
!543 = distinct !DILexicalBlock(scope: !544, file: !3, line: 244, column: 5)
!544 = distinct !DILexicalBlock(scope: !482, file: !3, line: 244, column: 5)
!545 = !DILocation(line: 244, column: 5, scope: !544)
!546 = !DILocation(line: 245, column: 5, scope: !482)
!547 = distinct !DISubprogram(name: "test_stats_prefix_record_get", scope: !3, file: !3, line: 248, type: !13, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !548)
!548 = !{!549}
!549 = !DILocalVariable(name: "pfs", scope: !547, file: !3, line: 249, type: !485)
!550 = !DILocation(line: 250, column: 5, scope: !547)
!551 = !DILocation(line: 252, column: 5, scope: !547)
!552 = !DILocation(line: 253, column: 11, scope: !547)
!553 = !DILocation(line: 0, scope: !547)
!554 = !DILocation(line: 254, column: 13, scope: !555)
!555 = distinct !DILexicalBlock(scope: !547, file: !3, line: 254, column: 9)
!556 = !DILocation(line: 254, column: 9, scope: !547)
!557 = !DILocation(line: 257, column: 5, scope: !558)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 257, column: 5)
!559 = distinct !DILexicalBlock(scope: !547, file: !3, line: 257, column: 5)
!560 = !DILocation(line: 257, column: 5, scope: !559)
!561 = !DILocation(line: 258, column: 5, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !3, line: 258, column: 5)
!563 = distinct !DILexicalBlock(scope: !547, file: !3, line: 258, column: 5)
!564 = !DILocation(line: 258, column: 5, scope: !563)
!565 = !DILocation(line: 259, column: 5, scope: !547)
!566 = !DILocation(line: 260, column: 5, scope: !567)
!567 = distinct !DILexicalBlock(scope: !568, file: !3, line: 260, column: 5)
!568 = distinct !DILexicalBlock(scope: !547, file: !3, line: 260, column: 5)
!569 = !DILocation(line: 260, column: 5, scope: !568)
!570 = !DILocation(line: 261, column: 5, scope: !571)
!571 = distinct !DILexicalBlock(scope: !572, file: !3, line: 261, column: 5)
!572 = distinct !DILexicalBlock(scope: !547, file: !3, line: 261, column: 5)
!573 = !DILocation(line: 261, column: 5, scope: !572)
!574 = !DILocation(line: 262, column: 5, scope: !547)
!575 = !DILocation(line: 263, column: 5, scope: !576)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 263, column: 5)
!577 = distinct !DILexicalBlock(scope: !547, file: !3, line: 263, column: 5)
!578 = !DILocation(line: 263, column: 5, scope: !577)
!579 = !DILocation(line: 264, column: 5, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !3, line: 264, column: 5)
!581 = distinct !DILexicalBlock(scope: !547, file: !3, line: 264, column: 5)
!582 = !DILocation(line: 264, column: 5, scope: !581)
!583 = !DILocation(line: 265, column: 5, scope: !547)
!584 = !DILocation(line: 266, column: 5, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 266, column: 5)
!586 = distinct !DILexicalBlock(scope: !547, file: !3, line: 266, column: 5)
!587 = !DILocation(line: 266, column: 5, scope: !586)
!588 = !DILocation(line: 267, column: 5, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !3, line: 267, column: 5)
!590 = distinct !DILexicalBlock(scope: !547, file: !3, line: 267, column: 5)
!591 = !DILocation(line: 267, column: 5, scope: !590)
!592 = !DILocation(line: 269, column: 1, scope: !547)
!593 = distinct !DISubprogram(name: "test_stats_prefix_record_delete", scope: !3, file: !3, line: 271, type: !13, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !594)
!594 = !{!595}
!595 = !DILocalVariable(name: "pfs", scope: !593, file: !3, line: 272, type: !485)
!596 = !DILocation(line: 273, column: 5, scope: !593)
!597 = !DILocation(line: 275, column: 5, scope: !593)
!598 = !DILocation(line: 276, column: 11, scope: !593)
!599 = !DILocation(line: 0, scope: !593)
!600 = !DILocation(line: 277, column: 13, scope: !601)
!601 = distinct !DILexicalBlock(scope: !593, file: !3, line: 277, column: 9)
!602 = !DILocation(line: 277, column: 9, scope: !593)
!603 = !DILocation(line: 280, column: 5, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !3, line: 280, column: 5)
!605 = distinct !DILexicalBlock(scope: !593, file: !3, line: 280, column: 5)
!606 = !DILocation(line: 280, column: 5, scope: !605)
!607 = !DILocation(line: 281, column: 5, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 281, column: 5)
!609 = distinct !DILexicalBlock(scope: !593, file: !3, line: 281, column: 5)
!610 = !DILocation(line: 281, column: 5, scope: !609)
!611 = !DILocation(line: 282, column: 5, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 282, column: 5)
!613 = distinct !DILexicalBlock(scope: !593, file: !3, line: 282, column: 5)
!614 = !DILocation(line: 282, column: 5, scope: !613)
!615 = !DILocation(line: 283, column: 5, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !3, line: 283, column: 5)
!617 = distinct !DILexicalBlock(scope: !593, file: !3, line: 283, column: 5)
!618 = !DILocation(line: 283, column: 5, scope: !617)
!619 = !DILocation(line: 284, column: 5, scope: !593)
!620 = !DILocation(line: 285, column: 5, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 285, column: 5)
!622 = distinct !DILexicalBlock(scope: !593, file: !3, line: 285, column: 5)
!623 = !DILocation(line: 285, column: 5, scope: !622)
!624 = !DILocation(line: 287, column: 1, scope: !593)
!625 = distinct !DISubprogram(name: "test_stats_prefix_record_set", scope: !3, file: !3, line: 289, type: !13, scopeLine: 289, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!626 = !{!627}
!627 = !DILocalVariable(name: "pfs", scope: !625, file: !3, line: 290, type: !485)
!628 = !DILocation(line: 291, column: 5, scope: !625)
!629 = !DILocation(line: 293, column: 5, scope: !625)
!630 = !DILocation(line: 294, column: 11, scope: !625)
!631 = !DILocation(line: 0, scope: !625)
!632 = !DILocation(line: 295, column: 13, scope: !633)
!633 = distinct !DILexicalBlock(scope: !625, file: !3, line: 295, column: 9)
!634 = !DILocation(line: 295, column: 9, scope: !625)
!635 = !DILocation(line: 298, column: 5, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 298, column: 5)
!637 = distinct !DILexicalBlock(scope: !625, file: !3, line: 298, column: 5)
!638 = !DILocation(line: 298, column: 5, scope: !637)
!639 = !DILocation(line: 299, column: 5, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !3, line: 299, column: 5)
!641 = distinct !DILexicalBlock(scope: !625, file: !3, line: 299, column: 5)
!642 = !DILocation(line: 299, column: 5, scope: !641)
!643 = !DILocation(line: 300, column: 5, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !3, line: 300, column: 5)
!645 = distinct !DILexicalBlock(scope: !625, file: !3, line: 300, column: 5)
!646 = !DILocation(line: 300, column: 5, scope: !645)
!647 = !DILocation(line: 301, column: 5, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 301, column: 5)
!649 = distinct !DILexicalBlock(scope: !625, file: !3, line: 301, column: 5)
!650 = !DILocation(line: 301, column: 5, scope: !649)
!651 = !DILocation(line: 302, column: 5, scope: !625)
!652 = !DILocation(line: 303, column: 5, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !3, line: 303, column: 5)
!654 = distinct !DILexicalBlock(scope: !625, file: !3, line: 303, column: 5)
!655 = !DILocation(line: 303, column: 5, scope: !654)
!656 = !DILocation(line: 305, column: 1, scope: !625)
!657 = distinct !DISubprogram(name: "test_stats_prefix_dump", scope: !3, file: !3, line: 307, type: !13, scopeLine: 307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !658)
!658 = !{!659, !660, !664, !665, !666, !667, !668}
!659 = !DILocalVariable(name: "hashval", scope: !657, file: !3, line: 308, type: !23)
!660 = !DILocalVariable(name: "tmp", scope: !657, file: !3, line: 309, type: !661)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4000, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 500)
!664 = !DILocalVariable(name: "buf", scope: !657, file: !3, line: 310, type: !152)
!665 = !DILocalVariable(name: "expected", scope: !657, file: !3, line: 311, type: !51)
!666 = !DILocalVariable(name: "keynum", scope: !657, file: !3, line: 312, type: !23)
!667 = !DILocalVariable(name: "length", scope: !657, file: !3, line: 313, type: !23)
!668 = !DILocalVariable(name: "found_match", scope: !657, file: !3, line: 351, type: !59)
!669 = !DILocation(line: 308, column: 19, scope: !657)
!670 = !DILocation(line: 0, scope: !657)
!671 = !DILocation(line: 309, column: 5, scope: !657)
!672 = !DILocation(line: 309, column: 10, scope: !657)
!673 = !DILocation(line: 313, column: 5, scope: !657)
!674 = !DILocation(line: 315, column: 5, scope: !657)
!675 = !DILocation(line: 317, column: 5, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !3, line: 317, column: 5)
!677 = distinct !DILexicalBlock(scope: !657, file: !3, line: 317, column: 5)
!678 = !DILocation(line: 317, column: 5, scope: !677)
!679 = !DILocation(line: 318, column: 5, scope: !680)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 318, column: 5)
!681 = distinct !DILexicalBlock(scope: !657, file: !3, line: 318, column: 5)
!682 = !DILocation(line: 318, column: 5, scope: !681)
!683 = !DILocation(line: 319, column: 5, scope: !657)
!684 = !DILocation(line: 320, column: 5, scope: !657)
!685 = !DILocation(line: 322, column: 5, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 322, column: 5)
!687 = distinct !DILexicalBlock(scope: !657, file: !3, line: 322, column: 5)
!688 = !DILocation(line: 322, column: 5, scope: !687)
!689 = !DILocation(line: 323, column: 5, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !3, line: 323, column: 5)
!691 = distinct !DILexicalBlock(scope: !657, file: !3, line: 323, column: 5)
!692 = !DILocation(line: 323, column: 5, scope: !691)
!693 = !DILocation(line: 324, column: 5, scope: !657)
!694 = !DILocation(line: 325, column: 5, scope: !657)
!695 = !DILocation(line: 327, column: 5, scope: !696)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 327, column: 5)
!697 = distinct !DILexicalBlock(scope: !657, file: !3, line: 327, column: 5)
!698 = !DILocation(line: 327, column: 5, scope: !697)
!699 = !DILocation(line: 328, column: 5, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 328, column: 5)
!701 = distinct !DILexicalBlock(scope: !657, file: !3, line: 328, column: 5)
!702 = !DILocation(line: 328, column: 5, scope: !701)
!703 = !DILocation(line: 329, column: 5, scope: !657)
!704 = !DILocation(line: 330, column: 5, scope: !657)
!705 = !DILocation(line: 332, column: 5, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 332, column: 5)
!707 = distinct !DILexicalBlock(scope: !657, file: !3, line: 332, column: 5)
!708 = !DILocation(line: 332, column: 5, scope: !707)
!709 = !DILocation(line: 333, column: 5, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 333, column: 5)
!711 = distinct !DILexicalBlock(scope: !657, file: !3, line: 333, column: 5)
!712 = !DILocation(line: 333, column: 5, scope: !711)
!713 = !DILocation(line: 334, column: 5, scope: !657)
!714 = !DILocation(line: 335, column: 5, scope: !657)
!715 = !DILocation(line: 337, column: 5, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !3, line: 337, column: 5)
!717 = distinct !DILexicalBlock(scope: !657, file: !3, line: 337, column: 5)
!718 = !DILocation(line: 337, column: 5, scope: !717)
!719 = !DILocation(line: 338, column: 5, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !3, line: 338, column: 5)
!721 = distinct !DILexicalBlock(scope: !657, file: !3, line: 338, column: 5)
!722 = !DILocation(line: 338, column: 5, scope: !721)
!723 = !DILocation(line: 340, column: 5, scope: !657)
!724 = !DILocation(line: 341, column: 5, scope: !657)
!725 = !DILocation(line: 344, column: 11, scope: !657)
!726 = !DILocation(line: 345, column: 5, scope: !727)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 345, column: 5)
!728 = distinct !DILexicalBlock(scope: !657, file: !3, line: 345, column: 5)
!729 = !DILocation(line: 345, column: 5, scope: !728)
!730 = !DILocation(line: 346, column: 5, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 346, column: 5)
!732 = distinct !DILexicalBlock(scope: !657, file: !3, line: 346, column: 5)
!733 = !DILocation(line: 346, column: 5, scope: !732)
!734 = !DILocation(line: 347, column: 5, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !3, line: 347, column: 5)
!736 = distinct !DILexicalBlock(scope: !657, file: !3, line: 347, column: 5)
!737 = !DILocation(line: 347, column: 5, scope: !736)
!738 = !DILocation(line: 348, column: 5, scope: !657)
!739 = !DILocation(line: 352, column: 5, scope: !740)
!740 = distinct !DILexicalBlock(scope: !657, file: !3, line: 352, column: 5)
!741 = !DILocation(line: 353, column: 9, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 352, column: 65)
!743 = distinct !DILexicalBlock(scope: !740, file: !3, line: 352, column: 5)
!744 = !DILocation(line: 355, column: 24, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !3, line: 355, column: 13)
!746 = !DILocation(line: 355, column: 34, scope: !745)
!747 = !DILocation(line: 355, column: 46, scope: !745)
!748 = !DILocation(line: 355, column: 21, scope: !745)
!749 = !DILocation(line: 355, column: 13, scope: !742)
!750 = !DILocation(line: 352, column: 61, scope: !743)
!751 = !DILocation(line: 352, column: 29, scope: !743)
!752 = distinct !{!752, !739, !753, !287}
!753 = !DILocation(line: 359, column: 5, scope: !740)
!754 = !DILocation(line: 360, column: 5, scope: !755)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 360, column: 5)
!756 = distinct !DILexicalBlock(scope: !657, file: !3, line: 360, column: 5)
!757 = !DILocation(line: 361, column: 34, scope: !657)
!758 = !DILocation(line: 361, column: 5, scope: !657)
!759 = !DILocation(line: 362, column: 11, scope: !657)
!760 = !DILocation(line: 363, column: 5, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !3, line: 363, column: 5)
!762 = distinct !DILexicalBlock(scope: !657, file: !3, line: 363, column: 5)
!763 = !DILocation(line: 363, column: 5, scope: !762)
!764 = !DILocation(line: 364, column: 5, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !3, line: 364, column: 5)
!766 = distinct !DILexicalBlock(scope: !657, file: !3, line: 364, column: 5)
!767 = !DILocation(line: 364, column: 5, scope: !766)
!768 = !DILocation(line: 365, column: 5, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !3, line: 365, column: 5)
!770 = distinct !DILexicalBlock(scope: !657, file: !3, line: 365, column: 5)
!771 = !DILocation(line: 365, column: 5, scope: !770)
!772 = !DILocation(line: 366, column: 5, scope: !657)
!773 = !DILocation(line: 367, column: 5, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 367, column: 5)
!775 = distinct !DILexicalBlock(scope: !657, file: !3, line: 367, column: 5)
!776 = !DILocation(line: 367, column: 5, scope: !775)
!777 = !DILocation(line: 368, column: 5, scope: !657)
!778 = !DILocation(line: 371, column: 5, scope: !657)
!779 = !DILocation(line: 374, column: 1, scope: !657)
!780 = !DILocation(line: 373, column: 5, scope: !657)
!781 = distinct !DISubprogram(name: "test_issue_161", scope: !3, file: !3, line: 149, type: !13, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !782)
!782 = !{!783}
!783 = !DILocalVariable(name: "ret", scope: !781, file: !3, line: 151, type: !5)
!784 = !DILocation(line: 151, column: 28, scope: !781)
!785 = !DILocation(line: 0, scope: !781)
!786 = !DILocation(line: 152, column: 13, scope: !787)
!787 = distinct !DILexicalBlock(scope: !781, file: !3, line: 152, column: 9)
!788 = !DILocation(line: 152, column: 9, scope: !781)
!789 = !DILocation(line: 153, column: 15, scope: !790)
!790 = distinct !DILexicalBlock(scope: !787, file: !3, line: 152, column: 27)
!791 = !DILocation(line: 154, column: 5, scope: !790)
!792 = !DILocation(line: 156, column: 5, scope: !781)
!793 = distinct !DISubprogram(name: "test_safe_strtol", scope: !3, file: !3, line: 448, type: !13, scopeLine: 448, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !794)
!794 = !{!795}
!795 = !DILocalVariable(name: "val", scope: !793, file: !3, line: 449, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !797, line: 26, baseType: !798)
!797 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 41, baseType: !23)
!799 = !DILocation(line: 449, column: 5, scope: !793)
!800 = !DILocation(line: 0, scope: !793)
!801 = !DILocation(line: 450, column: 5, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 450, column: 5)
!803 = distinct !DILexicalBlock(scope: !793, file: !3, line: 450, column: 5)
!804 = !DILocation(line: 450, column: 5, scope: !803)
!805 = !DILocation(line: 451, column: 5, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 451, column: 5)
!807 = distinct !DILexicalBlock(scope: !793, file: !3, line: 451, column: 5)
!808 = !DILocation(line: 451, column: 5, scope: !807)
!809 = !DILocation(line: 452, column: 5, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 452, column: 5)
!811 = distinct !DILexicalBlock(scope: !793, file: !3, line: 452, column: 5)
!812 = !DILocation(line: 452, column: 5, scope: !811)
!813 = !DILocation(line: 453, column: 5, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 453, column: 5)
!815 = distinct !DILexicalBlock(scope: !793, file: !3, line: 453, column: 5)
!816 = !DILocation(line: 453, column: 5, scope: !815)
!817 = !DILocation(line: 454, column: 5, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 454, column: 5)
!819 = distinct !DILexicalBlock(scope: !793, file: !3, line: 454, column: 5)
!820 = !DILocation(line: 454, column: 5, scope: !819)
!821 = !DILocation(line: 455, column: 5, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !3, line: 455, column: 5)
!823 = distinct !DILexicalBlock(scope: !793, file: !3, line: 455, column: 5)
!824 = !DILocation(line: 455, column: 5, scope: !823)
!825 = !DILocation(line: 456, column: 5, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 456, column: 5)
!827 = distinct !DILexicalBlock(scope: !793, file: !3, line: 456, column: 5)
!828 = !DILocation(line: 456, column: 5, scope: !827)
!829 = !DILocation(line: 457, column: 5, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 457, column: 5)
!831 = distinct !DILexicalBlock(scope: !793, file: !3, line: 457, column: 5)
!832 = !DILocation(line: 457, column: 5, scope: !831)
!833 = !DILocation(line: 458, column: 5, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 458, column: 5)
!835 = distinct !DILexicalBlock(scope: !793, file: !3, line: 458, column: 5)
!836 = !DILocation(line: 458, column: 5, scope: !835)
!837 = !DILocation(line: 459, column: 5, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !3, line: 459, column: 5)
!839 = distinct !DILexicalBlock(scope: !793, file: !3, line: 459, column: 5)
!840 = !DILocation(line: 459, column: 5, scope: !839)
!841 = !DILocation(line: 465, column: 5, scope: !842)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 465, column: 5)
!843 = distinct !DILexicalBlock(scope: !793, file: !3, line: 465, column: 5)
!844 = !DILocation(line: 465, column: 5, scope: !843)
!845 = !DILocation(line: 466, column: 5, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 466, column: 5)
!847 = distinct !DILexicalBlock(scope: !793, file: !3, line: 466, column: 5)
!848 = !DILocation(line: 466, column: 5, scope: !847)
!849 = !DILocation(line: 472, column: 5, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 472, column: 5)
!851 = distinct !DILexicalBlock(scope: !793, file: !3, line: 472, column: 5)
!852 = !DILocation(line: 472, column: 5, scope: !851)
!853 = !DILocation(line: 473, column: 5, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 473, column: 5)
!855 = distinct !DILexicalBlock(scope: !793, file: !3, line: 473, column: 5)
!856 = !DILocation(line: 473, column: 5, scope: !855)
!857 = !DILocation(line: 475, column: 1, scope: !793)
!858 = !DILocation(line: 474, column: 5, scope: !793)
!859 = distinct !DISubprogram(name: "test_safe_strtoll", scope: !3, file: !3, line: 419, type: !13, scopeLine: 419, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!860 = !{!861}
!861 = !DILocalVariable(name: "val", scope: !859, file: !3, line: 420, type: !862)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !797, line: 27, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !31, line: 44, baseType: !32)
!864 = !DILocation(line: 420, column: 5, scope: !859)
!865 = !DILocation(line: 0, scope: !859)
!866 = !DILocation(line: 421, column: 5, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 421, column: 5)
!868 = distinct !DILexicalBlock(scope: !859, file: !3, line: 421, column: 5)
!869 = !DILocation(line: 421, column: 5, scope: !868)
!870 = !DILocation(line: 422, column: 5, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 422, column: 5)
!872 = distinct !DILexicalBlock(scope: !859, file: !3, line: 422, column: 5)
!873 = !{!471, !471, i64 0}
!874 = !DILocation(line: 422, column: 5, scope: !872)
!875 = !DILocation(line: 423, column: 5, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !3, line: 423, column: 5)
!877 = distinct !DILexicalBlock(scope: !859, file: !3, line: 423, column: 5)
!878 = !DILocation(line: 423, column: 5, scope: !877)
!879 = !DILocation(line: 424, column: 5, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 424, column: 5)
!881 = distinct !DILexicalBlock(scope: !859, file: !3, line: 424, column: 5)
!882 = !DILocation(line: 424, column: 5, scope: !881)
!883 = !DILocation(line: 425, column: 5, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 425, column: 5)
!885 = distinct !DILexicalBlock(scope: !859, file: !3, line: 425, column: 5)
!886 = !DILocation(line: 425, column: 5, scope: !885)
!887 = !DILocation(line: 426, column: 5, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !3, line: 426, column: 5)
!889 = distinct !DILexicalBlock(scope: !859, file: !3, line: 426, column: 5)
!890 = !DILocation(line: 426, column: 5, scope: !889)
!891 = !DILocation(line: 427, column: 5, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !3, line: 427, column: 5)
!893 = distinct !DILexicalBlock(scope: !859, file: !3, line: 427, column: 5)
!894 = !DILocation(line: 427, column: 5, scope: !893)
!895 = !DILocation(line: 428, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !3, line: 428, column: 5)
!897 = distinct !DILexicalBlock(scope: !859, file: !3, line: 428, column: 5)
!898 = !DILocation(line: 428, column: 5, scope: !897)
!899 = !DILocation(line: 429, column: 5, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !3, line: 429, column: 5)
!901 = distinct !DILexicalBlock(scope: !859, file: !3, line: 429, column: 5)
!902 = !DILocation(line: 429, column: 5, scope: !901)
!903 = !DILocation(line: 430, column: 5, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 430, column: 5)
!905 = distinct !DILexicalBlock(scope: !859, file: !3, line: 430, column: 5)
!906 = !DILocation(line: 430, column: 5, scope: !905)
!907 = !DILocation(line: 433, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !3, line: 433, column: 5)
!909 = distinct !DILexicalBlock(scope: !859, file: !3, line: 433, column: 5)
!910 = !DILocation(line: 433, column: 5, scope: !909)
!911 = !DILocation(line: 434, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 434, column: 5)
!913 = distinct !DILexicalBlock(scope: !859, file: !3, line: 434, column: 5)
!914 = !DILocation(line: 434, column: 5, scope: !913)
!915 = !DILocation(line: 435, column: 5, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 435, column: 5)
!917 = distinct !DILexicalBlock(scope: !859, file: !3, line: 435, column: 5)
!918 = !DILocation(line: 435, column: 5, scope: !917)
!919 = !DILocation(line: 440, column: 5, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 440, column: 5)
!921 = distinct !DILexicalBlock(scope: !859, file: !3, line: 440, column: 5)
!922 = !DILocation(line: 440, column: 5, scope: !921)
!923 = !DILocation(line: 443, column: 5, scope: !924)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 443, column: 5)
!925 = distinct !DILexicalBlock(scope: !859, file: !3, line: 443, column: 5)
!926 = !DILocation(line: 443, column: 5, scope: !925)
!927 = !DILocation(line: 444, column: 5, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 444, column: 5)
!929 = distinct !DILexicalBlock(scope: !859, file: !3, line: 444, column: 5)
!930 = !DILocation(line: 444, column: 5, scope: !929)
!931 = !DILocation(line: 446, column: 1, scope: !859)
!932 = !DILocation(line: 445, column: 5, scope: !859)
!933 = distinct !DISubprogram(name: "test_safe_strtoul", scope: !3, file: !3, line: 376, type: !13, scopeLine: 376, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !934)
!934 = !{!935}
!935 = !DILocalVariable(name: "val", scope: !933, file: !3, line: 377, type: !164)
!936 = !DILocation(line: 377, column: 5, scope: !933)
!937 = !DILocation(line: 0, scope: !933)
!938 = !DILocation(line: 378, column: 5, scope: !939)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 378, column: 5)
!940 = distinct !DILexicalBlock(scope: !933, file: !3, line: 378, column: 5)
!941 = !DILocation(line: 378, column: 5, scope: !940)
!942 = !DILocation(line: 379, column: 5, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 379, column: 5)
!944 = distinct !DILexicalBlock(scope: !933, file: !3, line: 379, column: 5)
!945 = !DILocation(line: 379, column: 5, scope: !944)
!946 = !DILocation(line: 380, column: 5, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 380, column: 5)
!948 = distinct !DILexicalBlock(scope: !933, file: !3, line: 380, column: 5)
!949 = !DILocation(line: 380, column: 5, scope: !948)
!950 = !DILocation(line: 381, column: 5, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 381, column: 5)
!952 = distinct !DILexicalBlock(scope: !933, file: !3, line: 381, column: 5)
!953 = !DILocation(line: 381, column: 5, scope: !952)
!954 = !DILocation(line: 382, column: 5, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 382, column: 5)
!956 = distinct !DILexicalBlock(scope: !933, file: !3, line: 382, column: 5)
!957 = !DILocation(line: 382, column: 5, scope: !956)
!958 = !DILocation(line: 383, column: 5, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 383, column: 5)
!960 = distinct !DILexicalBlock(scope: !933, file: !3, line: 383, column: 5)
!961 = !DILocation(line: 383, column: 5, scope: !960)
!962 = !DILocation(line: 384, column: 5, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 384, column: 5)
!964 = distinct !DILexicalBlock(scope: !933, file: !3, line: 384, column: 5)
!965 = !DILocation(line: 384, column: 5, scope: !964)
!966 = !DILocation(line: 390, column: 5, scope: !967)
!967 = distinct !DILexicalBlock(scope: !968, file: !3, line: 390, column: 5)
!968 = distinct !DILexicalBlock(scope: !933, file: !3, line: 390, column: 5)
!969 = !DILocation(line: 390, column: 5, scope: !968)
!970 = !DILocation(line: 391, column: 5, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !3, line: 391, column: 5)
!972 = distinct !DILexicalBlock(scope: !933, file: !3, line: 391, column: 5)
!973 = !DILocation(line: 391, column: 5, scope: !972)
!974 = !DILocation(line: 395, column: 5, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 395, column: 5)
!976 = distinct !DILexicalBlock(scope: !933, file: !3, line: 395, column: 5)
!977 = !DILocation(line: 395, column: 5, scope: !976)
!978 = !DILocation(line: 397, column: 1, scope: !933)
!979 = !DILocation(line: 396, column: 5, scope: !933)
!980 = distinct !DISubprogram(name: "test_safe_strtoull", scope: !3, file: !3, line: 400, type: !13, scopeLine: 400, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !981)
!981 = !{!982}
!982 = !DILocalVariable(name: "val", scope: !980, file: !3, line: 401, type: !493)
!983 = !DILocation(line: 401, column: 5, scope: !980)
!984 = !DILocation(line: 0, scope: !980)
!985 = !DILocation(line: 402, column: 5, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 402, column: 5)
!987 = distinct !DILexicalBlock(scope: !980, file: !3, line: 402, column: 5)
!988 = !DILocation(line: 402, column: 5, scope: !987)
!989 = !DILocation(line: 403, column: 5, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !3, line: 403, column: 5)
!991 = distinct !DILexicalBlock(scope: !980, file: !3, line: 403, column: 5)
!992 = !DILocation(line: 403, column: 5, scope: !991)
!993 = !DILocation(line: 404, column: 5, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 404, column: 5)
!995 = distinct !DILexicalBlock(scope: !980, file: !3, line: 404, column: 5)
!996 = !DILocation(line: 404, column: 5, scope: !995)
!997 = !DILocation(line: 405, column: 5, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 405, column: 5)
!999 = distinct !DILexicalBlock(scope: !980, file: !3, line: 405, column: 5)
!1000 = !DILocation(line: 405, column: 5, scope: !999)
!1001 = !DILocation(line: 406, column: 5, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 406, column: 5)
!1003 = distinct !DILexicalBlock(scope: !980, file: !3, line: 406, column: 5)
!1004 = !DILocation(line: 406, column: 5, scope: !1003)
!1005 = !DILocation(line: 407, column: 5, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 407, column: 5)
!1007 = distinct !DILexicalBlock(scope: !980, file: !3, line: 407, column: 5)
!1008 = !DILocation(line: 407, column: 5, scope: !1007)
!1009 = !DILocation(line: 408, column: 5, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 408, column: 5)
!1011 = distinct !DILexicalBlock(scope: !980, file: !3, line: 408, column: 5)
!1012 = !DILocation(line: 408, column: 5, scope: !1011)
!1013 = !DILocation(line: 409, column: 5, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 409, column: 5)
!1015 = distinct !DILexicalBlock(scope: !980, file: !3, line: 409, column: 5)
!1016 = !DILocation(line: 409, column: 5, scope: !1015)
!1017 = !DILocation(line: 412, column: 5, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 412, column: 5)
!1019 = distinct !DILexicalBlock(scope: !980, file: !3, line: 412, column: 5)
!1020 = !DILocation(line: 412, column: 5, scope: !1019)
!1021 = !DILocation(line: 413, column: 5, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 413, column: 5)
!1023 = distinct !DILexicalBlock(scope: !980, file: !3, line: 413, column: 5)
!1024 = !DILocation(line: 413, column: 5, scope: !1023)
!1025 = !DILocation(line: 414, column: 5, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 414, column: 5)
!1027 = distinct !DILexicalBlock(scope: !980, file: !3, line: 414, column: 5)
!1028 = !DILocation(line: 414, column: 5, scope: !1027)
!1029 = !DILocation(line: 415, column: 5, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 415, column: 5)
!1031 = distinct !DILexicalBlock(scope: !980, file: !3, line: 415, column: 5)
!1032 = !DILocation(line: 415, column: 5, scope: !1031)
!1033 = !DILocation(line: 417, column: 1, scope: !980)
!1034 = !DILocation(line: 416, column: 5, scope: !980)
!1035 = distinct !DISubprogram(name: "test_issue_44", scope: !3, file: !3, line: 624, type: !13, scopeLine: 624, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1036)
!1036 = !{!1037, !1038}
!1037 = !DILocalVariable(name: "port", scope: !1035, file: !3, line: 625, type: !146)
!1038 = !DILocalVariable(name: "pid", scope: !1035, file: !3, line: 626, type: !47)
!1039 = !DILocation(line: 625, column: 5, scope: !1035)
!1040 = !DILocation(line: 0, scope: !1035)
!1041 = !DILocation(line: 626, column: 17, scope: !1035)
!1042 = !DILocation(line: 627, column: 5, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 627, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 627, column: 5)
!1045 = !DILocation(line: 627, column: 5, scope: !1044)
!1046 = !DILocation(line: 628, column: 5, scope: !1035)
!1047 = !DILocation(line: 629, column: 5, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 629, column: 5)
!1049 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 629, column: 5)
!1050 = !DILocation(line: 629, column: 5, scope: !1049)
!1051 = !DILocation(line: 632, column: 1, scope: !1035)
!1052 = !DILocation(line: 631, column: 5, scope: !1035)
!1053 = distinct !DISubprogram(name: "test_vperror", scope: !3, file: !3, line: 729, type: !13, scopeLine: 729, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1054)
!1054 = !{!1055, !1056, !1057, !1061, !1062, !1066, !1120, !1121}
!1055 = !DILocalVariable(name: "rv", scope: !1053, file: !3, line: 730, type: !23)
!1056 = !DILocalVariable(name: "oldstderr", scope: !1053, file: !3, line: 731, type: !23)
!1057 = !DILocalVariable(name: "tmpl", scope: !1053, file: !3, line: 733, type: !1058)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 192, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 24)
!1061 = !DILocalVariable(name: "newfile", scope: !1053, file: !3, line: 736, type: !23)
!1062 = !DILocalVariable(name: "buf", scope: !1053, file: !3, line: 752, type: !1063)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 640, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 80)
!1066 = !DILocalVariable(name: "efile", scope: !1053, file: !3, line: 753, type: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1069, line: 7, baseType: !1070)
!1069 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1071, line: 49, size: 1728, elements: !1072)
!1071 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1088, !1090, !1091, !1092, !1094, !1095, !1097, !1101, !1104, !1106, !1109, !1112, !1113, !1114, !1115, !1116}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1070, file: !1071, line: 51, baseType: !23, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1070, file: !1071, line: 54, baseType: !152, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1070, file: !1071, line: 55, baseType: !152, size: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1070, file: !1071, line: 56, baseType: !152, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1070, file: !1071, line: 57, baseType: !152, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1070, file: !1071, line: 58, baseType: !152, size: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1070, file: !1071, line: 59, baseType: !152, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1070, file: !1071, line: 60, baseType: !152, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1070, file: !1071, line: 61, baseType: !152, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1070, file: !1071, line: 64, baseType: !152, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1070, file: !1071, line: 65, baseType: !152, size: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1070, file: !1071, line: 66, baseType: !152, size: 64, offset: 704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1070, file: !1071, line: 68, baseType: !1086, size: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1071, line: 36, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1070, file: !1071, line: 70, baseType: !1089, size: 64, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1070, file: !1071, line: 72, baseType: !23, size: 32, offset: 896)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1070, file: !1071, line: 73, baseType: !23, size: 32, offset: 928)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1070, file: !1071, line: 74, baseType: !1093, size: 64, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 152, baseType: !32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1070, file: !1071, line: 77, baseType: !151, size: 16, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1070, file: !1071, line: 78, baseType: !1096, size: 8, offset: 1040)
!1096 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1070, file: !1071, line: 79, baseType: !1098, size: 8, offset: 1048)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 1)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1070, file: !1071, line: 81, baseType: !1102, size: 64, offset: 1088)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1071, line: 43, baseType: null)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1070, file: !1071, line: 89, baseType: !1105, size: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 153, baseType: !32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1070, file: !1071, line: 91, baseType: !1107, size: 64, offset: 1216)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1071, line: 37, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1070, file: !1071, line: 92, baseType: !1110, size: 64, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1071, line: 38, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1070, file: !1071, line: 93, baseType: !1089, size: 64, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1070, file: !1071, line: 94, baseType: !33, size: 64, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1070, file: !1071, line: 95, baseType: !34, size: 64, offset: 1472)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1070, file: !1071, line: 96, baseType: !23, size: 32, offset: 1536)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1070, file: !1071, line: 98, baseType: !1117, size: 160, offset: 1568)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 20)
!1120 = !DILocalVariable(name: "prv", scope: !1053, file: !3, line: 755, type: !152)
!1121 = !DILocalVariable(name: "expected", scope: !1053, file: !3, line: 761, type: !1063)
!1122 = !DILocation(line: 0, scope: !1053)
!1123 = !DILocation(line: 731, column: 21, scope: !1053)
!1124 = !DILocation(line: 732, column: 5, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 732, column: 5)
!1126 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 732, column: 5)
!1127 = !DILocation(line: 732, column: 5, scope: !1126)
!1128 = !DILocation(line: 733, column: 5, scope: !1053)
!1129 = !DILocation(line: 733, column: 10, scope: !1053)
!1130 = !DILocation(line: 734, column: 5, scope: !1053)
!1131 = !DILocation(line: 736, column: 19, scope: !1053)
!1132 = !DILocation(line: 737, column: 5, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 737, column: 5)
!1134 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 737, column: 5)
!1135 = !DILocation(line: 737, column: 5, scope: !1134)
!1136 = !DILocation(line: 738, column: 10, scope: !1053)
!1137 = !DILocation(line: 739, column: 5, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !3, line: 739, column: 5)
!1139 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 739, column: 5)
!1140 = !DILocation(line: 739, column: 5, scope: !1139)
!1141 = !DILocation(line: 740, column: 10, scope: !1053)
!1142 = !DILocation(line: 741, column: 5, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 741, column: 5)
!1144 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 741, column: 5)
!1145 = !DILocation(line: 741, column: 5, scope: !1144)
!1146 = !DILocation(line: 743, column: 5, scope: !1053)
!1147 = !DILocation(line: 743, column: 11, scope: !1053)
!1148 = !DILocation(line: 744, column: 5, scope: !1053)
!1149 = !DILocation(line: 747, column: 10, scope: !1053)
!1150 = !DILocation(line: 748, column: 5, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 748, column: 5)
!1152 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 748, column: 5)
!1153 = !DILocation(line: 748, column: 5, scope: !1152)
!1154 = !DILocation(line: 752, column: 5, scope: !1053)
!1155 = !DILocation(line: 752, column: 10, scope: !1053)
!1156 = !DILocation(line: 753, column: 19, scope: !1053)
!1157 = !DILocation(line: 754, column: 5, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !3, line: 754, column: 5)
!1159 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 754, column: 5)
!1160 = !DILocation(line: 754, column: 5, scope: !1159)
!1161 = !DILocation(line: 755, column: 17, scope: !1053)
!1162 = !DILocation(line: 756, column: 5, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 756, column: 5)
!1164 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 756, column: 5)
!1165 = !DILocation(line: 756, column: 5, scope: !1164)
!1166 = !DILocation(line: 757, column: 5, scope: !1053)
!1167 = !DILocation(line: 759, column: 5, scope: !1053)
!1168 = !DILocation(line: 761, column: 5, scope: !1053)
!1169 = !DILocation(line: 761, column: 10, scope: !1053)
!1170 = !DILocation(line: 763, column: 56, scope: !1053)
!1171 = !DILocation(line: 762, column: 5, scope: !1053)
!1172 = !DILocation(line: 771, column: 12, scope: !1053)
!1173 = !DILocation(line: 771, column: 34, scope: !1053)
!1174 = !DILocation(line: 772, column: 1, scope: !1053)
!1175 = !DILocation(line: 771, column: 5, scope: !1053)
!1176 = !DILocation(line: 0, scope: !12)
!1177 = !DILocation(line: 2165, column: 9, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2165, column: 9)
!1179 = !DILocation(line: 2165, column: 33, scope: !1178)
!1180 = !DILocation(line: 2165, column: 9, scope: !12)
!1181 = !DILocation(line: 2170, column: 21, scope: !12)
!1182 = !DILocation(line: 2172, column: 18, scope: !12)
!1183 = !DILocation(line: 2172, column: 16, scope: !12)
!1184 = !DILocation(line: 2176, column: 49, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 2174, column: 34)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 2174, column: 5)
!1187 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2174, column: 5)
!1188 = !{!1189, !1189, i64 0}
!1189 = !{!"short", !417, i64 0}
!1190 = !DILocation(line: 2176, column: 21, scope: !1185)
!1191 = !DILocation(line: 2177, column: 9, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 2177, column: 9)
!1193 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 2177, column: 9)
!1194 = !DILocation(line: 2177, column: 9, scope: !1193)
!1195 = !DILocation(line: 2178, column: 9, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 2178, column: 9)
!1197 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 2178, column: 9)
!1198 = !{!1199, !425, i64 0}
!1199 = !{!"conn", !425, i64 0, !459, i64 8, !459, i64 16}
!1200 = !DILocation(line: 2178, column: 9, scope: !1197)
!1201 = !DILocation(line: 2184, column: 9, scope: !56)
!1202 = !DILocation(line: 0, scope: !56)
!1203 = !DILocation(line: 2185, column: 38, scope: !61)
!1204 = !{!1199, !459, i64 16}
!1205 = !DILocation(line: 2185, column: 27, scope: !61)
!1206 = !DILocation(line: 0, scope: !61)
!1207 = !DILocation(line: 2186, column: 21, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !61, file: !3, line: 2186, column: 17)
!1209 = !DILocation(line: 2186, column: 17, scope: !61)
!1210 = distinct !{!1210, !1201, !1211, !287}
!1211 = !DILocation(line: 2199, column: 22, scope: !56)
!1212 = !DILocation(line: 2187, column: 25, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 2186, column: 28)
!1214 = !DILocation(line: 2187, column: 17, scope: !1213)
!1215 = !DILocation(line: 2202, column: 13, scope: !12)
!1216 = !DILocation(line: 2203, column: 15, scope: !65)
!1217 = !DILocation(line: 2203, column: 9, scope: !12)
!1218 = !DILocation(line: 2204, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !65, file: !3, line: 2203, column: 29)
!1220 = !DILocation(line: 2205, column: 22, scope: !64)
!1221 = !DILocation(line: 2205, column: 16, scope: !65)
!1222 = !DILocation(line: 2206, column: 9, scope: !63)
!1223 = !DILocation(line: 2208, column: 9, scope: !63)
!1224 = !DILocation(line: 0, scope: !63)
!1225 = !DILocation(line: 2208, column: 21, scope: !63)
!1226 = !DILocation(line: 2208, column: 47, scope: !63)
!1227 = !DILocation(line: 2208, column: 60, scope: !63)
!1228 = !DILocation(line: 2208, column: 63, scope: !63)
!1229 = !DILocation(line: 2208, column: 69, scope: !63)
!1230 = distinct !{!1230, !1223, !1231, !287}
!1231 = !DILocation(line: 2208, column: 78, scope: !63)
!1232 = !DILocation(line: 2209, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 2209, column: 9)
!1234 = distinct !DILexicalBlock(scope: !63, file: !3, line: 2209, column: 9)
!1235 = !DILocation(line: 2209, column: 9, scope: !1234)
!1236 = !DILocation(line: 2210, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !3, line: 2210, column: 9)
!1238 = distinct !DILexicalBlock(scope: !63, file: !3, line: 2210, column: 9)
!1239 = !DILocation(line: 2210, column: 9, scope: !1238)
!1240 = !DILocation(line: 2211, column: 5, scope: !64)
!1241 = !DILocation(line: 2203, column: 26, scope: !65)
!1242 = !DILocation(line: 2212, column: 43, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !64, file: !3, line: 2211, column: 12)
!1244 = !DILocation(line: 2212, column: 15, scope: !1243)
!1245 = !DILocation(line: 2212, column: 13, scope: !1243)
!1246 = !DILocation(line: 2213, column: 9, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1248, file: !3, line: 2213, column: 9)
!1248 = distinct !DILexicalBlock(scope: !1243, file: !3, line: 2213, column: 9)
!1249 = !DILocation(line: 2213, column: 9, scope: !1248)
!1250 = !DILocation(line: 2214, column: 15, scope: !1243)
!1251 = !DILocation(line: 2215, column: 9, scope: !1243)
!1252 = !DILocation(line: 2216, column: 9, scope: !1243)
!1253 = !DILocation(line: 2219, column: 2, scope: !12)
!1254 = !DILocation(line: 0, scope: !68)
!1255 = !DILocation(line: 2232, column: 16, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !68, file: !3, line: 2232, column: 13)
!1257 = !DILocation(line: 2232, column: 21, scope: !1256)
!1258 = !DILocation(line: 2232, column: 13, scope: !68)
!1259 = !DILocation(line: 2232, column: 26, scope: !1256)
!1260 = !DILocation(line: 2233, column: 14, scope: !68)
!1261 = !DILocation(line: 2233, column: 9, scope: !68)
!1262 = !DILocation(line: 2237, column: 5, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !3, line: 2237, column: 5)
!1264 = distinct !DILexicalBlock(scope: !12, file: !3, line: 2237, column: 5)
!1265 = !DILocation(line: 2237, column: 5, scope: !1264)
!1266 = !DILocation(line: 2240, column: 1, scope: !12)
!1267 = distinct !DISubprogram(name: "test_crc32c", scope: !3, file: !3, line: 842, type: !13, scopeLine: 842, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1268)
!1268 = !{!1269, !1270, !1271, !1275}
!1269 = !DILocalVariable(name: "crc_hw", scope: !1267, file: !3, line: 843, type: !164)
!1270 = !DILocalVariable(name: "crc_sw", scope: !1267, file: !3, line: 843, type: !164)
!1271 = !DILocalVariable(name: "buffer", scope: !1267, file: !3, line: 845, type: !1272)
!1272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !1273)
!1273 = !{!1274}
!1274 = !DISubrange(count: 256)
!1275 = !DILocalVariable(name: "x", scope: !1276, file: !3, line: 846, type: !23)
!1276 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 846, column: 5)
!1277 = !DILocation(line: 845, column: 5, scope: !1267)
!1278 = !DILocation(line: 845, column: 10, scope: !1267)
!1279 = !DILocation(line: 0, scope: !1276)
!1280 = !DILocation(line: 847, column: 19, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 846, column: 5)
!1282 = !DILocation(line: 846, column: 31, scope: !1281)
!1283 = !DILocation(line: 850, column: 14, scope: !1267)
!1284 = !DILocation(line: 0, scope: !1267)
!1285 = !DILocation(line: 851, column: 14, scope: !1267)
!1286 = !DILocation(line: 852, column: 5, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1288, file: !3, line: 852, column: 5)
!1288 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 852, column: 5)
!1289 = !DILocation(line: 852, column: 5, scope: !1288)
!1290 = !DILocation(line: 853, column: 5, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 853, column: 5)
!1292 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 853, column: 5)
!1293 = !DILocation(line: 853, column: 5, scope: !1292)
!1294 = !DILocation(line: 856, column: 14, scope: !1267)
!1295 = !DILocation(line: 857, column: 14, scope: !1267)
!1296 = !DILocation(line: 858, column: 5, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !3, line: 858, column: 5)
!1298 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 858, column: 5)
!1299 = !DILocation(line: 858, column: 5, scope: !1298)
!1300 = !DILocation(line: 859, column: 5, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1302, file: !3, line: 859, column: 5)
!1302 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 859, column: 5)
!1303 = !DILocation(line: 859, column: 5, scope: !1302)
