; ModuleID = 'thread.c'
source_filename = "thread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.settings = type { i64, i32, i32, i32, i8*, i32, i32, i64, i32, i8*, i8*, i32, double, i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i32, double, i32, i32, i8, i32, i8, i8, i8*, i32, i32, i32, i32, double, double, i32, i8, i32, i32, i32, i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i8, i32, i32, i8*, i32 }
%struct.LIBEVENT_THREAD = type { i64, %struct.event_base*, %struct.event, i32, %struct.thread_stats, [3 x %struct.io_queue_cb_s], %struct.conn_queue*, %struct.cache_t*, %struct._mc_resp_bundle*, %struct.cache_t*, i8*, %struct._logger*, i8*, i32 }

!47 = !DIEnumerator(name: "bin_read_flush_exptime", value: 8)
!48 = !DIEnumerator(name: "bin_reading_sasl_auth", value: 9)
!49 = !DIEnumerator(name: "bin_reading_sasl_auth_data", value: 10)
!50 = !DIEnumerator(name: "bin_reading_touch_key", value: 11)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol", file: !6, line: 231, baseType: !7, size: 32, elements: !52)
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "ascii_prot", value: 3)
!54 = !DIEnumerator(name: "binary_prot", value: 4)
!55 = !DIEnumerator(name: "negotiating_prot", value: 5)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "network_transport", file: !6, line: 240, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60}
!58 = !DIEnumerator(name: "local_transport", value: 0)
!59 = !DIEnumerator(name: "tcp_transport", value: 1)
!60 = !DIEnumerator(name: "udp_transport", value: 2)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "close_reasons", file: !6, line: 259, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "ERROR_CLOSE", value: 0)
!64 = !DIEnumerator(name: "NORMAL_CLOSE", value: 1)
!65 = !DIEnumerator(name: "IDLE_TIMEOUT_CLOSE", value: 2)
!66 = !DIEnumerator(name: "SHUTDOWN_CLOSE", value: 3)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_entry_type", file: !68, line: 16, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "./logger.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "920aeded0afd45e7ff5c610f1349e8a7")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!70 = !DIEnumerator(name: "LOGGER_ASCII_CMD", value: 0)
!71 = !DIEnumerator(name: "LOGGER_EVICTION", value: 1)
!72 = !DIEnumerator(name: "LOGGER_ITEM_GET", value: 2)
!73 = !DIEnumerator(name: "LOGGER_ITEM_STORE", value: 3)
!74 = !DIEnumerator(name: "LOGGER_CRAWLER_STATUS", value: 4)
!75 = !DIEnumerator(name: "LOGGER_SLAB_MOVE", value: 5)
!76 = !DIEnumerator(name: "LOGGER_CONNECTION_NEW", value: 6)
!77 = !DIEnumerator(name: "LOGGER_CONNECTION_CLOSE", value: 7)
!78 = !DIEnumerator(name: "LOGGER_EXTSTORE_WRITE", value: 8)
!79 = !DIEnumerator(name: "LOGGER_COMPACT_START", value: 9)
!80 = !DIEnumerator(name: "LOGGER_COMPACT_ABORT", value: 10)
!81 = !DIEnumerator(name: "LOGGER_COMPACT_READ_START", value: 11)
!82 = !DIEnumerator(name: "LOGGER_COMPACT_READ_END", value: 12)
!83 = !DIEnumerator(name: "LOGGER_COMPACT_END", value: 13)
!84 = !DIEnumerator(name: "LOGGER_COMPACT_FRAGINFO", value: 14)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "delta_result_type", file: !6, line: 280, baseType: !7, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIEnumerator(name: "OK", value: 0)
!88 = !DIEnumerator(name: "NON_NUMERIC", value: 1)
!89 = !DIEnumerator(name: "EOM", value: 2)
!90 = !DIEnumerator(name: "DELTA_ITEM_NOT_FOUND", value: 3)
!91 = !DIEnumerator(name: "DELTA_ITEM_CAS_MISMATCH", value: 4)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "store_item_type", file: !6, line: 276, baseType: !7, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99}
!94 = !DIEnumerator(name: "NOT_STORED", value: 0)
!95 = !DIEnumerator(name: "STORED", value: 1)
!96 = !DIEnumerator(name: "EXISTS", value: 2)
!97 = !DIEnumerator(name: "NOT_FOUND", value: 3)
!98 = !DIEnumerator(name: "TOO_LARGE", value: 4)
!99 = !DIEnumerator(name: "NO_MEMORY", value: 5)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 23, baseType: !7, size: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/eventfd.h", directory: "", checksumkind: CSK_MD5, checksum: "473917fad3019b47c1df6918db1ffe1f")
!102 = !{!103, !104, !105}
!103 = !DIEnumerator(name: "EFD_SEMAPHORE", value: 1)
!104 = !DIEnumerator(name: "EFD_CLOEXEC", value: 524288)
!105 = !DIEnumerator(name: "EFD_NONBLOCK", value: 2048)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event_base_config_flag", file: !107, line: 529, baseType: !7, size: 32, elements: !108)
!107 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!108 = !{!109, !110, !111, !112, !113, !114}
!109 = !DIEnumerator(name: "EVENT_BASE_FLAG_NOLOCK", value: 1)
!110 = !DIEnumerator(name: "EVENT_BASE_FLAG_IGNORE_ENV", value: 2)
!111 = !DIEnumerator(name: "EVENT_BASE_FLAG_STARTUP_IOCP", value: 4)
!112 = !DIEnumerator(name: "EVENT_BASE_FLAG_NO_CACHE_TIME", value: 8)
!113 = !DIEnumerator(name: "EVENT_BASE_FLAG_EPOLL_USE_CHANGELIST", value: 16)
!114 = !DIEnumerator(name: "EVENT_BASE_FLAG_PRECISE_TIMER", value: 32)
!115 = !{!116, !117, !118, !151, !152}
!116 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !120, line: 72, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!121 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !120, line: 67, size: 320, elements: !122)
!122 = !{!123, !144, !149}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !121, file: !120, line: 69, baseType: !124, size: 320)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !125, line: 22, size: 320, elements: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!126 = !{!127, !129, !130, !131, !132, !133, !135, !136}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !124, file: !125, line: 24, baseType: !128, size: 32)
!128 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !124, file: !125, line: 25, baseType: !7, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !124, file: !125, line: 26, baseType: !128, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !124, file: !125, line: 28, baseType: !7, size: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !124, file: !125, line: 32, baseType: !128, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !124, file: !125, line: 34, baseType: !134, size: 16, offset: 160)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !124, file: !125, line: 35, baseType: !134, size: 16, offset: 176)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !124, file: !125, line: 36, baseType: !137, size: 128, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !138, line: 53, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !138, line: 49, size: 128, elements: !140)
!140 = !{!141, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !139, file: !138, line: 51, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !139, file: !138, line: 52, baseType: !142, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !121, file: !120, line: 70, baseType: !145, size: 320)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 320, elements: !147)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !{!148}
!148 = !DISubrange(count: 40)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !121, file: !120, line: 71, baseType: !150, size: 64)
!150 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIBEVENT_THREAD", file: !6, line: 737, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 704, size: 54464, elements: !155)
!155 = !{!156, !158, !162, !246, !247, !304, !556, !611, !612, !613, !614, !615, !687, !688}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !154, file: !6, line: 705, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !120, line: 27, baseType: !116)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !6, line: 706, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !161, line: 122, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "005d89b34bed2ed9e30b0cc3160619c1")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event", scope: !154, file: !6, line: 707, baseType: !163, size: 1024, offset: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !161, line: 123, size: 1024, elements: !164)
!164 = !{!165, !201, !211, !212, !213, !243, !244, !245}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !163, file: !161, line: 124, baseType: !166, size: 320)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !161, line: 107, size: 320, elements: !167)
!167 = !{!168, !175, !176, !182, !183, !200}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !166, file: !161, line: 108, baseType: !169, size: 128)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !161, line: 108, size: 128, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !169, file: !161, line: 108, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !169, file: !161, line: 108, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !166, file: !161, line: 109, baseType: !134, size: 16, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !166, file: !161, line: 110, baseType: !177, size: 8, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !178, line: 24, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "d3ea318a915682aaf6645ec16ac9f991")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !180, line: 38, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !166, file: !161, line: 111, baseType: !177, size: 8, offset: 152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !166, file: !161, line: 118, baseType: !184, size: 64, offset: 192)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !161, line: 113, size: 64, elements: !185)
!185 = !{!186, !190, !194, !199}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !184, file: !161, line: 114, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !128, !134, !117}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !184, file: !161, line: 115, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !172, !117}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !184, file: !161, line: 116, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !117}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !184, file: !161, line: 117, baseType: !191, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !166, file: !161, line: 119, baseType: !117, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !163, file: !161, line: 130, baseType: !202, size: 128, offset: 320)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !161, line: 127, size: 128, elements: !203)
!203 = !{!204, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !202, file: !161, line: 128, baseType: !205, size: 128)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !161, line: 128, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !205, file: !161, line: 128, baseType: !198, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !205, file: !161, line: 128, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !202, file: !161, line: 129, baseType: !128, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !163, file: !161, line: 131, baseType: !128, size: 32, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !163, file: !161, line: 133, baseType: !159, size: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !163, file: !161, line: 149, baseType: !214, size: 256, offset: 576)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !161, line: 135, size: 256, elements: !215)
!215 = !{!216, !232}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !214, file: !161, line: 140, baseType: !217, size: 256)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !161, line: 137, size: 256, elements: !218)
!218 = !{!219, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !217, file: !161, line: 138, baseType: !220, size: 128)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !161, line: 138, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !220, file: !161, line: 138, baseType: !198, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !220, file: !161, line: 138, baseType: !209, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !217, file: !161, line: 139, baseType: !225, size: 128, offset: 128)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !226, line: 8, size: 128, elements: !227)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!227 = !{!228, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !225, file: !226, line: 10, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !180, line: 160, baseType: !150)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !225, file: !226, line: 11, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !180, line: 162, baseType: !150)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !214, file: !161, line: 148, baseType: !233, size: 256)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !161, line: 143, size: 256, elements: !234)
!234 = !{!235, !240, !241}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !233, file: !161, line: 144, baseType: !236, size: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !161, line: 144, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !236, file: !161, line: 144, baseType: !198, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !236, file: !161, line: 144, baseType: !209, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !233, file: !161, line: 145, baseType: !134, size: 16, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !233, file: !161, line: 147, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !163, file: !161, line: 151, baseType: !134, size: 16, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !163, file: !161, line: 152, baseType: !134, size: 16, offset: 848)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !163, file: !161, line: 153, baseType: !225, size: 128, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "notify_event_fd", scope: !154, file: !6, line: 709, baseType: !128, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !154, file: !6, line: 714, baseType: !248, size: 51584, offset: 1216)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_stats", file: !6, line: 356, size: 51584, elements: !249)
!249 = !{!250, !251, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !297, !301, !302, !303}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !248, file: !6, line: 357, baseType: !119, size: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "get_cmds", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !178, line: 27, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !180, line: 45, baseType: !116)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "get_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "get_expired", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "get_flushed", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "touch_cmds", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "touch_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "delete_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "incr_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "decr_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cas_misses", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "meta_cmds", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flush_cmds", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "conn_yields", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "auth_cmds", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "auth_errors", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "idle_kicks", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_oom", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_count", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "response_obj_bytes", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_oom", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1664)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "store_too_large", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1728)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "store_no_memory", scope: !248, file: !6, line: 359, baseType: !252, size: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "get_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 1856)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "get_aborted_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 1920)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "get_oom_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 1984)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recache_from_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 2048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "miss_from_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 2112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "badcrc_from_extstore", scope: !248, file: !6, line: 361, baseType: !252, size: 64, offset: 2176)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "slab_stats", scope: !248, file: !6, line: 367, baseType: !284, size: 32768, offset: 2240)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 32768, elements: !295)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slab_stats", file: !6, line: 303, size: 512, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "set_cmds", scope: !285, file: !6, line: 305, baseType: !252, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "get_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "touch_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "delete_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cas_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cas_badval", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "incr_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "decr_hits", scope: !285, file: !6, line: 305, baseType: !252, size: 64, offset: 448)
!295 = !{!296}
!296 = !DISubrange(count: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lru_hits", scope: !248, file: !6, line: 368, baseType: !298, size: 16384, offset: 35008)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 16384, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_count", scope: !248, file: !6, line: 369, baseType: !252, size: 64, offset: 51392)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes", scope: !248, file: !6, line: 370, baseType: !252, size: 64, offset: 51456)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf_bytes_free", scope: !248, file: !6, line: 371, baseType: !252, size: 64, offset: 51520)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !154, file: !6, line: 715, baseType: !305, size: 1152, offset: 52800)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 1152, elements: !478)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb_t", file: !6, line: 701, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_cb_s", file: !6, line: 694, size: 384, elements: !308)
!308 = !{!309, !310, !323, !324, !554, !555}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !307, file: !6, line: 695, baseType: !117, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit_cb", scope: !307, file: !6, line: 696, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_stack_cb", file: !6, line: 670, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_t", file: !6, line: 669, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "io_queue_s", file: !6, line: 687, size: 192, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !317, file: !6, line: 688, baseType: !117, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stack_ctx", scope: !317, file: !6, line: 689, baseType: !117, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !317, file: !6, line: 690, baseType: !128, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !6, line: 691, baseType: !128, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "complete_cb", scope: !307, file: !6, line: 697, baseType: !311, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "return_cb", scope: !307, file: !6, line: 698, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_queue_cb", file: !6, line: 671, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_pending_t", file: !6, line: 668, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_io_pending_t", file: !6, line: 783, size: 1216, elements: !332)
!332 = !{!333, !334, !335, !549, !550}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "io_queue_type", scope: !331, file: !6, line: 784, baseType: !128, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !331, file: !6, line: 785, baseType: !152, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !331, file: !6, line: 786, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn", file: !6, line: 781, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn", file: !6, line: 794, size: 3968, elements: !339)
!339 = !{!340, !344, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !357, !358, !359, !360, !361, !362, !363, !364, !470, !471, !472, !473, !474, !475, !476, !480, !481, !482, !483, !484, !485, !486, !487, !488, !494, !515, !516, !517, !518, !519, !520, !521, !522, !526, !533, !548}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_conn", scope: !338, file: !6, line: 795, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sasl_conn_t", file: !343, line: 16, baseType: !117)
!343 = !DIFile(filename: "./sasl_defs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "3a8678a43d09d8e311388b26eedc7a3e")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !338, file: !6, line: 796, baseType: !128, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_started", scope: !338, file: !6, line: 797, baseType: !346, size: 8, offset: 96)
!346 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !338, file: !6, line: 798, baseType: !346, size: 8, offset: 104)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "set_stale", scope: !338, file: !6, line: 799, baseType: !346, size: 8, offset: 112)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mset_res", scope: !338, file: !6, line: 800, baseType: !346, size: 8, offset: 120)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "close_after_write", scope: !338, file: !6, line: 801, baseType: !346, size: 8, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_malloced", scope: !338, file: !6, line: 802, baseType: !346, size: 8, offset: 136)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "item_malloced", scope: !338, file: !6, line: 803, baseType: !346, size: 8, offset: 144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !6, line: 809, baseType: !21, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "substate", scope: !338, file: !6, line: 810, baseType: !37, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd_time", scope: !338, file: !6, line: 811, baseType: !356, size: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "rel_time_t", file: !68, line: 14, baseType: !7)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !338, file: !6, line: 812, baseType: !163, size: 1024, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flags", scope: !338, file: !6, line: 813, baseType: !134, size: 16, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !338, file: !6, line: 814, baseType: !134, size: 16, offset: 1296)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !338, file: !6, line: 816, baseType: !151, size: 64, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rcurr", scope: !338, file: !6, line: 817, baseType: !151, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !338, file: !6, line: 818, baseType: !128, size: 32, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rbytes", scope: !338, file: !6, line: 819, baseType: !128, size: 32, offset: 1504)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !338, file: !6, line: 821, baseType: !365, size: 64, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp", file: !6, line: 770, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp", file: !6, line: 743, size: 9472, elements: !368)
!368 = !{!369, !383, !385, !386, !387, !388, !389, !414, !425, !426, !427, !428, !429, !430, !431, !432, !433, !462, !466}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bundle", scope: !367, file: !6, line: 744, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mc_resp_bundle", file: !6, line: 703, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mc_resp_bundle", file: !6, line: 773, size: 192, elements: !373)
!373 = !{!374, !375, !376, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !372, file: !6, line: 774, baseType: !177, size: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next_check", scope: !372, file: !6, line: 775, baseType: !177, size: 8, offset: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !6, line: 776, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !372, file: !6, line: 777, baseType: !377, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !372, file: !6, line: 778, baseType: !380, offset: 192)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: -1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !6, line: 745, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "wbytes", scope: !367, file: !6, line: 746, baseType: !128, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !367, file: !6, line: 747, baseType: !128, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "write_and_free", scope: !367, file: !6, line: 748, baseType: !117, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "io_pending", scope: !367, file: !6, line: 749, baseType: !329, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !367, file: !6, line: 751, baseType: !390, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "item", file: !6, line: 598, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stritem", file: !6, line: 575, size: 384, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !403, !406, !407, !408}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !6, line: 577, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !392, file: !6, line: 578, baseType: !395, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "h_next", scope: !392, file: !6, line: 580, baseType: !395, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !392, file: !6, line: 581, baseType: !356, size: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "exptime", scope: !392, file: !6, line: 582, baseType: !356, size: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !392, file: !6, line: 583, baseType: !128, size: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !392, file: !6, line: 584, baseType: !402, size: 16, offset: 288)
!402 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "it_flags", scope: !392, file: !6, line: 585, baseType: !404, size: 16, offset: 304)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !178, line: 25, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !180, line: 40, baseType: !402)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "slabs_clsid", scope: !392, file: !6, line: 586, baseType: !177, size: 8, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nkey", scope: !392, file: !6, line: 587, baseType: !177, size: 8, offset: 328)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !6, line: 593, baseType: !409, offset: 384)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, elements: !381)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !6, line: 590, size: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !410, file: !6, line: 591, baseType: !252, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !410, file: !6, line: 592, baseType: !146, size: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !367, file: !6, line: 752, baseType: !415, size: 512, offset: 384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 512, elements: !423)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !417, line: 26, size: 128, elements: !418)
!417 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "6a734cae8feaa37c12e11190a6573675")
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !416, file: !417, line: 28, baseType: !117, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !416, file: !417, line: 29, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !422, line: 46, baseType: !116)
!422 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!423 = !{!424}
!424 = !DISubrange(count: 4)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_total", scope: !367, file: !6, line: 753, baseType: !128, size: 32, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "iovcnt", scope: !367, file: !6, line: 754, baseType: !177, size: 8, offset: 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chunked_data_iov", scope: !367, file: !6, line: 755, baseType: !177, size: 8, offset: 936)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !367, file: !6, line: 760, baseType: !346, size: 8, offset: 944)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !367, file: !6, line: 761, baseType: !346, size: 8, offset: 952)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !367, file: !6, line: 763, baseType: !404, size: 16, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sequence", scope: !367, file: !6, line: 764, baseType: !404, size: 16, offset: 976)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "udp_total", scope: !367, file: !6, line: 765, baseType: !404, size: 16, offset: 992)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !367, file: !6, line: 766, baseType: !434, size: 224, offset: 1024)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !435, line: 253, size: 224, elements: !436)
!435 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "6a5254a491bcdb8c3253de75bf3571c1")
!436 = !{!437, !440, !442, !445, !461}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !434, file: !435, line: 255, baseType: !438, size: 16)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !439, line: 28, baseType: !402)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "b70cbaf07ffb7e8bf11ee98d9a21e2fc")
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !434, file: !435, line: 256, baseType: !441, size: 16, offset: 16)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !435, line: 119, baseType: !404)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !434, file: !435, line: 257, baseType: !443, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !178, line: 26, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !180, line: 42, baseType: !7)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !434, file: !435, line: 258, baseType: !446, size: 128, offset: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !435, line: 212, size: 128, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !446, file: !435, line: 219, baseType: !449, size: 128)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !435, line: 214, size: 128, elements: !450)
!450 = !{!451, !455, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !449, file: !435, line: 216, baseType: !452, size: 128)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !449, file: !435, line: 217, baseType: !456, size: 128)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 128, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !449, file: !435, line: 218, baseType: !460, size: 128)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 128, elements: !423)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !434, file: !435, line: 259, baseType: !443, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !367, file: !6, line: 767, baseType: !463, size: 32, offset: 1248)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !464, line: 33, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "b1d3343a573cbf39b225111209e02966")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !180, line: 209, baseType: !7)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !367, file: !6, line: 769, baseType: !467, size: 8192, offset: 1280)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "resp_head", scope: !338, file: !6, line: 822, baseType: !365, size: 64, offset: 1600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ritem", scope: !338, file: !6, line: 823, baseType: !151, size: 64, offset: 1664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rlbytes", scope: !338, file: !6, line: 824, baseType: !128, size: 32, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !338, file: !6, line: 832, baseType: !117, size: 64, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sbytes", scope: !338, file: !6, line: 835, baseType: !128, size: 32, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues_submitted", scope: !338, file: !6, line: 837, baseType: !128, size: 32, offset: 1888)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "io_queues", scope: !338, file: !6, line: 838, baseType: !477, size: 576, offset: 1920)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 576, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "recache_counter", scope: !338, file: !6, line: 843, baseType: !7, size: 32, offset: 2496)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !338, file: !6, line: 845, baseType: !51, size: 32, offset: 2528)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !338, file: !6, line: 846, baseType: !56, size: 32, offset: 2560)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "close_reason", scope: !338, file: !6, line: 847, baseType: !61, size: 32, offset: 2592)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !338, file: !6, line: 850, baseType: !128, size: 32, offset: 2624)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr", scope: !338, file: !6, line: 851, baseType: !434, size: 224, offset: 2656)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "request_addr_size", scope: !338, file: !6, line: 852, baseType: !463, size: 32, offset: 2880)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "noreply", scope: !338, file: !6, line: 854, baseType: !346, size: 8, offset: 2912)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !338, file: !6, line: 860, baseType: !489, size: 192, offset: 2944)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !6, line: 856, size: 192, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !489, file: !6, line: 857, baseType: !151, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !489, file: !6, line: 858, baseType: !421, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !489, file: !6, line: 859, baseType: !421, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "binary_header", scope: !338, file: !6, line: 864, baseType: !495, size: 192, offset: 3136)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "protocol_binary_request_header", file: !496, line: 164, baseType: !497)
!496 = !DIFile(filename: "./protocol_binary.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "7a322a65fa8661e9a597acbeeeb23107")
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !496, line: 151, size: 192, elements: !498)
!498 = !{!499, !511}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !497, file: !496, line: 162, baseType: !500, size: 192)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !496, line: 152, size: 192, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !500, file: !496, line: 153, baseType: !177, size: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !500, file: !496, line: 154, baseType: !177, size: 8, offset: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !500, file: !496, line: 155, baseType: !404, size: 16, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "extlen", scope: !500, file: !496, line: 156, baseType: !177, size: 8, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !500, file: !496, line: 157, baseType: !177, size: 8, offset: 40)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !500, file: !496, line: 158, baseType: !404, size: 16, offset: 48)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bodylen", scope: !500, file: !496, line: 159, baseType: !443, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !500, file: !496, line: 160, baseType: !443, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !500, file: !496, line: 161, baseType: !252, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !497, file: !496, line: 163, baseType: !512, size: 192)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 192, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 24)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cas", scope: !338, file: !6, line: 865, baseType: !252, size: 64, offset: 3328)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !338, file: !6, line: 866, baseType: !252, size: 64, offset: 3392)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !338, file: !6, line: 867, baseType: !134, size: 16, offset: 3456)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !338, file: !6, line: 868, baseType: !128, size: 32, offset: 3488)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !338, file: !6, line: 869, baseType: !128, size: 32, offset: 3520)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !6, line: 870, baseType: !336, size: 64, offset: 3584)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !338, file: !6, line: 871, baseType: !152, size: 64, offset: 3648)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "try_read_command", scope: !338, file: !6, line: 872, baseType: !523, size: 64, offset: 3712)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!128, !336}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !338, file: !6, line: 873, baseType: !527, size: 64, offset: 3776)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !336, !117, !421}
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !531, line: 108, baseType: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !180, line: 193, baseType: !150)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sendmsg", scope: !338, file: !6, line: 874, baseType: !534, size: 64, offset: 3840)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!530, !336, !537, !128}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !464, line: 257, size: 448, elements: !539)
!539 = !{!540, !541, !542, !544, !545, !546, !547}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !538, file: !464, line: 259, baseType: !117, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !538, file: !464, line: 260, baseType: !463, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !538, file: !464, line: 262, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !538, file: !464, line: 263, baseType: !421, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !538, file: !464, line: 265, baseType: !117, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !538, file: !464, line: 266, baseType: !421, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !538, file: !464, line: 271, baseType: !128, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !338, file: !6, line: 875, baseType: !527, size: 64, offset: 3904)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "resp", scope: !331, file: !6, line: 787, baseType: !365, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !6, line: 788, baseType: !551, size: 960, offset: 256)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 960, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 120)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "finalize_cb", scope: !307, file: !6, line: 699, baseType: !325, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !6, line: 700, baseType: !128, size: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ev_queue", scope: !154, file: !6, line: 716, baseType: !557, size: 64, offset: 53952)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue", file: !3, line: 64, size: 512, elements: !559)
!559 = !{!560, !584, !585}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !558, file: !3, line: 65, baseType: !561, size: 128)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_ev_head", file: !3, line: 65, size: 128, elements: !562)
!562 = !{!563, !582}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !561, file: !3, line: 65, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_queue_item", file: !3, line: 47, size: 576, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sfd", scope: !565, file: !3, line: 48, baseType: !128, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !565, file: !3, line: 49, baseType: !21, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "event_flags", scope: !565, file: !3, line: 50, baseType: !128, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffer_size", scope: !565, file: !3, line: 51, baseType: !128, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "transport", scope: !565, file: !3, line: 52, baseType: !56, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !565, file: !3, line: 53, baseType: !13, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !565, file: !3, line: 54, baseType: !336, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !565, file: !3, line: 55, baseType: !117, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "conntag", scope: !565, file: !3, line: 56, baseType: !252, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bproto", scope: !565, file: !3, line: 57, baseType: !51, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !565, file: !3, line: 58, baseType: !329, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_next", scope: !565, file: !3, line: 59, baseType: !579, size: 64, offset: 512)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !565, file: !3, line: 59, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !579, file: !3, line: 59, baseType: !564, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !561, file: !3, line: 65, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !558, file: !3, line: 66, baseType: !119, size: 320, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !558, file: !3, line: 67, baseType: !586, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !588, line: 39, baseType: !589)
!588 = !DIFile(filename: "./cache.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "d97639c8540587a19d8550d7d7156448")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 22, size: 704, elements: !590)
!590 = !{!591, !592, !593, !606, !607, !608, !609, !610}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !589, file: !588, line: 24, baseType: !119, size: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !589, file: !588, line: 26, baseType: !151, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !589, file: !588, line: 28, baseType: !594, size: 128, offset: 384)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_head", file: !588, line: 28, size: 128, elements: !595)
!595 = !{!596, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !594, file: !588, line: 28, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_free_s", file: !588, line: 12, size: 64, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "c_next", scope: !598, file: !588, line: 13, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !598, file: !588, line: 13, size: 64, elements: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !601, file: !588, line: 13, baseType: !597, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !594, file: !588, line: 28, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !589, file: !588, line: 30, baseType: !421, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "freetotal", scope: !589, file: !588, line: 32, baseType: !128, size: 32, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !589, file: !588, line: 34, baseType: !128, size: 32, offset: 608)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "freecurr", scope: !589, file: !588, line: 36, baseType: !128, size: 32, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !589, file: !588, line: 38, baseType: !128, size: 32, offset: 672)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_cache", scope: !154, file: !6, line: 717, baseType: !586, size: 64, offset: 54016)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "open_bundle", scope: !154, file: !6, line: 718, baseType: !370, size: 64, offset: 54080)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "io_cache", scope: !154, file: !6, line: 719, baseType: !586, size: 64, offset: 54144)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !154, file: !6, line: 721, baseType: !117, size: 64, offset: 54208)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !154, file: !6, line: 723, baseType: !616, size: 64, offset: 54272)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger", file: !68, line: 171, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logger", file: !68, line: 159, size: 832, elements: !619)
!619 = !{!620, !622, !623, !624, !625, !626, !627, !628, !629, !630, !643}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !618, file: !68, line: 160, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !68, line: 161, baseType: !621, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !618, file: !68, line: 162, baseType: !119, size: 320, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !618, file: !68, line: 163, baseType: !252, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !618, file: !68, line: 164, baseType: !252, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !618, file: !68, line: 165, baseType: !252, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fetcher_ratio", scope: !618, file: !68, line: 166, baseType: !404, size: 16, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mutation_ratio", scope: !618, file: !68, line: 167, baseType: !404, size: 16, offset: 656)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !618, file: !68, line: 168, baseType: !404, size: 16, offset: 672)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !618, file: !68, line: 169, baseType: !631, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "bipbuf_t", file: !633, line: 18, baseType: !634)
!633 = !DIFile(filename: "./bipbuffer.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "99606bcb8393045e6bc9eef40115066f")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 4, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !634, file: !633, line: 6, baseType: !116, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "a_start", scope: !634, file: !633, line: 9, baseType: !7, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "a_end", scope: !634, file: !633, line: 9, baseType: !7, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "b_end", scope: !634, file: !633, line: 12, baseType: !7, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "b_inuse", scope: !634, file: !633, line: 15, baseType: !128, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !634, file: !633, line: 17, baseType: !642, offset: 192)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, elements: !381)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "entry_map", scope: !618, file: !68, line: 170, baseType: !644, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_details", file: !68, line: 57, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_entry_details", file: !68, line: 62, size: 256, elements: !648)
!648 = !{!649, !650, !651, !681, !686}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reqlen", scope: !647, file: !68, line: 63, baseType: !128, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !647, file: !68, line: 64, baseType: !404, size: 16, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "log_cb", scope: !647, file: !68, line: 65, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_log_cb", file: !68, line: 59, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !656, !644, !671, !673}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "logentry", file: !68, line: 56, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_logentry", file: !68, line: 135, size: 320, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !658, file: !68, line: 136, baseType: !67, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !658, file: !68, line: 137, baseType: !177, size: 8, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "eflags", scope: !658, file: !68, line: 138, baseType: !404, size: 16, offset: 48)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !658, file: !68, line: 139, baseType: !252, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tv", scope: !658, file: !68, line: 140, baseType: !225, size: 128, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !658, file: !68, line: 141, baseType: !128, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !658, file: !68, line: 144, baseType: !667, offset: 288)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, elements: !381)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !658, file: !68, line: 142, size: 8, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !668, file: !68, line: 143, baseType: !146, size: 8)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !675)
!675 = !{!676, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !674, file: !677, line: 399, baseType: !7, size: 32)
!677 = !DIFile(filename: "thread.c", directory: "/home/xuheng/blackbox/llvm-test/memcached")
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !674, file: !677, line: 399, baseType: !7, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !674, file: !677, line: 399, baseType: !117, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !674, file: !677, line: 399, baseType: !117, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cb", scope: !647, file: !68, line: 66, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "entry_parse_cb", file: !68, line: 60, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!128, !656, !151}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !647, file: !68, line: 67, baseType: !151, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lru_bump_buf", scope: !154, file: !6, line: 724, baseType: !117, size: 64, offset: 54336)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !154, file: !6, line: 728, baseType: !128, size: 32, offset: 54400)
!689 = !{!0, !690, !693, !695, !697, !699, !701, !703, !705, !746, !748, !750, !752}
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "lru_locks", scope: !2, file: !3, line: 71, type: !692, isLocal: false, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 81920, elements: !299)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "worker_hang_lock", scope: !2, file: !3, line: 84, type: !119, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "item_locks", scope: !2, file: !3, line: 86, type: !118, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "item_lock_count", scope: !2, file: !3, line: 88, type: !443, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "item_lock_hashpower", scope: !2, file: !3, line: 89, type: !7, isLocal: false, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "threads", scope: !2, file: !3, line: 97, type: !152, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "init_lock", scope: !2, file: !3, line: 103, type: !119, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "init_cond", scope: !2, file: !3, line: 104, type: !707, isLocal: true, isDefinition: true)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !120, line: 80, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !120, line: 75, size: 384, elements: !709)
!709 = !{!710, !740, !744}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !708, file: !120, line: 77, baseType: !711, size: 384)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !138, line: 92, size: 384, elements: !712)
!712 = !{!713, !723, !732, !736, !737, !738, !739}
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !138, line: 94, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !138, line: 94, size: 64, elements: !715)
!715 = !{!716, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !714, file: !138, line: 96, baseType: !717, size: 64)
!717 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq32", scope: !714, file: !138, line: 101, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !138, line: 97, size: 64, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !719, file: !138, line: 99, baseType: !7, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !719, file: !138, line: 100, baseType: !7, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !138, line: 103, baseType: !724, size: 64, offset: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !138, line: 103, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !724, file: !138, line: 105, baseType: !717, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start32", scope: !724, file: !138, line: 110, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !138, line: 106, size: 64, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !728, file: !138, line: 108, baseType: !7, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !728, file: !138, line: 109, baseType: !7, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !711, file: !138, line: 112, baseType: !733, size: 64, offset: 128)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 2)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !711, file: !138, line: 113, baseType: !733, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !711, file: !138, line: 114, baseType: !7, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !711, file: !138, line: 115, baseType: !7, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !711, file: !138, line: 116, baseType: !733, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !708, file: !120, line: 78, baseType: !741, size: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 384, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 48)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !708, file: !120, line: 79, baseType: !745, size: 64)
!745 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "init_count", scope: !2, file: !3, line: 102, type: !128, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "last_thread", scope: !2, file: !3, line: 639, type: !128, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "last_thread_by_napi_id", scope: !2, file: !3, line: 642, type: !128, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "stats_lock", scope: !2, file: !3, line: 81, type: !119, isLocal: true, isDefinition: true)
!754 = !{i32 7, !"Dwarf Version", i32 5}
!755 = !{i32 2, !"Debug Info Version", i32 3}
!756 = !{i32 1, !"wchar_size", i32 4}
!757 = !{i32 7, !"uwtable", i32 1}
!758 = !{!"/home/xuheng/blackbox/llvm-test/memcached/thread.gcno", !"/home/xuheng/blackbox/llvm-test/memcached/thread.gcda", !2}
!759 = !{!"clang version 14.0.0"}
!760 = distinct !DISubprogram(name: "item_lock", scope: !3, file: !3, line: 121, type: !761, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !443}
!763 = !{!764}
!764 = !DILocalVariable(name: "hv", arg: 1, scope: !760, file: !3, line: 121, type: !443)
!765 = !DILocation(line: 0, scope: !760)
!766 = !DILocation(line: 122, column: 5, scope: !760)
!767 = !{!768, !768, i64 0}
!768 = !{!"any pointer", !769, i64 0}
!769 = !{!"omnipotent char", !770, i64 0}
!770 = !{!"Simple C/C++ TBAA"}
!771 = !{!772, !772, i64 0}
!772 = !{!"int", !769, i64 0}
!773 = !DILocation(line: 123, column: 1, scope: !760)
!774 = !DISubprogram(name: "pthread_mutex_lock", scope: !775, file: !775, line: 738, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!775 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "0e55f33d4e6889d38be50c852b7d6130")
!776 = !DISubroutineType(types: !777)
!777 = !{!128, !118}
!778 = !{}
!779 = distinct !DISubprogram(name: "item_trylock", scope: !3, file: !3, line: 125, type: !780, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !782)
!780 = !DISubroutineType(types: !781)
!781 = !{!117, !443}
!782 = !{!783, !784}
!783 = !DILocalVariable(name: "hv", arg: 1, scope: !779, file: !3, line: 125, type: !443)
!784 = !DILocalVariable(name: "lock", scope: !779, file: !3, line: 126, type: !118)
!785 = !DILocation(line: 0, scope: !779)
!786 = !DILocation(line: 126, column: 30, scope: !779)
!787 = !DILocation(line: 126, column: 41, scope: !779)
!788 = !DILocation(line: 126, column: 46, scope: !779)
!789 = !DILocation(line: 126, column: 44, scope: !779)
!790 = !DILocation(line: 127, column: 9, scope: !791)
!791 = distinct !DILexicalBlock(scope: !779, file: !3, line: 127, column: 9)
!792 = !DILocation(line: 127, column: 37, scope: !791)
!793 = !DILocation(line: 127, column: 9, scope: !779)
!794 = !DILocation(line: 128, column: 16, scope: !795)
!795 = distinct !DILexicalBlock(scope: !791, file: !3, line: 127, column: 43)
!796 = !DILocation(line: 128, column: 9, scope: !795)
!797 = !DILocation(line: 130, column: 5, scope: !779)
!798 = !DILocation(line: 131, column: 1, scope: !779)
!799 = !DISubprogram(name: "pthread_mutex_trylock", scope: !775, file: !775, line: 734, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!800 = distinct !DISubprogram(name: "item_trylock_unlock", scope: !3, file: !3, line: 133, type: !801, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !117}
!803 = !{!804}
!804 = !DILocalVariable(name: "lock", arg: 1, scope: !800, file: !3, line: 133, type: !117)
!805 = !DILocation(line: 0, scope: !800)
!806 = !DILocation(line: 134, column: 5, scope: !800)
!807 = !DILocation(line: 135, column: 1, scope: !800)
!808 = !DISubprogram(name: "pthread_mutex_unlock", scope: !775, file: !775, line: 756, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!809 = distinct !DISubprogram(name: "item_unlock", scope: !3, file: !3, line: 137, type: !761, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!810 = !{!811}
!811 = !DILocalVariable(name: "hv", arg: 1, scope: !809, file: !3, line: 137, type: !443)
!812 = !DILocation(line: 0, scope: !809)
!813 = !DILocation(line: 138, column: 5, scope: !809)
!814 = !DILocation(line: 139, column: 1, scope: !809)
!815 = distinct !DISubprogram(name: "pause_threads", scope: !3, file: !3, line: 158, type: !816, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !5}
!818 = !{!819, !820, !821}
!819 = !DILocalVariable(name: "type", arg: 1, scope: !815, file: !3, line: 158, type: !5)
!820 = !DILocalVariable(name: "i", scope: !815, file: !3, line: 159, type: !128)
!821 = !DILocalVariable(name: "pause_workers", scope: !815, file: !3, line: 160, type: !346)
!822 = !DILocation(line: 0, scope: !815)
!823 = !DILocation(line: 162, column: 5, scope: !815)
!824 = !DILocation(line: 164, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !815, file: !3, line: 162, column: 19)
!826 = !DILocation(line: 165, column: 13, scope: !825)
!827 = !DILocation(line: 166, column: 13, scope: !825)
!828 = !DILocation(line: 168, column: 13, scope: !825)
!829 = !DILocation(line: 169, column: 13, scope: !825)
!830 = !DILocation(line: 173, column: 13, scope: !825)
!831 = !DILocation(line: 197, column: 5, scope: !815)
!832 = !DILocation(line: 198, column: 16, scope: !815)
!833 = !DILocation(line: 199, column: 30, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 199, column: 5)
!835 = distinct !DILexicalBlock(scope: !815, file: !3, line: 199, column: 5)
!836 = !{!837, !772, i64 92}
!837 = !{!"settings", !838, i64 0, !772, i64 8, !772, i64 12, !772, i64 16, !768, i64 24, !772, i64 32, !772, i64 36, !838, i64 40, !772, i64 48, !768, i64 56, !768, i64 64, !772, i64 72, !839, i64 80, !772, i64 88, !772, i64 92, !772, i64 96, !769, i64 100, !772, i64 104, !772, i64 108, !840, i64 112, !769, i64 116, !772, i64 120, !772, i64 124, !772, i64 128, !772, i64 132, !772, i64 136, !840, i64 140, !840, i64 141, !840, i64 142, !840, i64 143, !840, i64 144, !840, i64 145, !772, i64 148, !839, i64 152, !772, i64 160, !772, i64 164, !840, i64 168, !772, i64 172, !840, i64 176, !840, i64 177, !768, i64 184, !772, i64 192, !772, i64 196, !772, i64 200, !772, i64 204, !839, i64 208, !839, i64 216, !772, i64 224, !840, i64 228, !772, i64 232, !772, i64 236, !772, i64 240, !772, i64 244, !772, i64 248, !840, i64 252, !840, i64 253, !840, i64 254, !840, i64 255, !772, i64 256, !772, i64 260, !772, i64 264, !772, i64 268, !772, i64 272, !772, i64 276, !772, i64 280, !772, i64 284, !772, i64 288, !772, i64 292, !839, i64 296, !839, i64 304, !840, i64 312, !772, i64 316, !772, i64 320, !768, i64 328, !772, i64 336}
!838 = !{!"long", !769, i64 0}
!839 = !{!"double", !769, i64 0}
!840 = !{!"_Bool", !769, i64 0}
!841 = !DILocation(line: 199, column: 19, scope: !834)
!842 = !DILocation(line: 199, column: 5, scope: !835)
!843 = !DILocation(line: 176, column: 13, scope: !825)
!844 = !DILocation(line: 177, column: 13, scope: !825)
!845 = !DILocation(line: 178, column: 13, scope: !825)
!846 = !DILocation(line: 180, column: 13, scope: !825)
!847 = !DILocation(line: 181, column: 13, scope: !825)
!848 = !DILocation(line: 184, column: 13, scope: !825)
!849 = !DILocation(line: 194, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 193, column: 25)
!851 = distinct !DILexicalBlock(scope: !815, file: !3, line: 193, column: 9)
!852 = !DILocation(line: 187, column: 21, scope: !825)
!853 = !DILocation(line: 187, column: 13, scope: !825)
!854 = !DILocation(line: 188, column: 13, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 188, column: 13)
!856 = distinct !DILexicalBlock(scope: !825, file: !3, line: 188, column: 13)
!857 = !DILocation(line: 200, column: 27, scope: !858)
!858 = distinct !DILexicalBlock(scope: !834, file: !3, line: 199, column: 48)
!859 = !DILocation(line: 200, column: 9, scope: !858)
!860 = !DILocation(line: 199, column: 44, scope: !834)
!861 = distinct !{!861, !842, !862, !863}
!862 = !DILocation(line: 201, column: 5, scope: !835)
!863 = !{!"llvm.loop.mustprogress"}
!864 = !DILocation(line: 202, column: 43, scope: !815)
!865 = !DILocation(line: 202, column: 5, scope: !815)
!866 = !DILocation(line: 203, column: 5, scope: !815)
!867 = !DILocation(line: 204, column: 1, scope: !815)
!868 = !DISubprogram(name: "slabs_rebalancer_pause", scope: !869, file: !869, line: 62, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!869 = !DIFile(filename: "./slabs.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "28867aba1f41c79140864d76faedcb32")
!870 = !DISubroutineType(types: !871)
!871 = !{null}
!872 = !DISubprogram(name: "lru_maintainer_pause", scope: !873, file: !873, line: 83, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!873 = !DIFile(filename: "./items.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "24f8c54717bd547418db2338c9044014")
!874 = !DISubprogram(name: "lru_crawler_pause", scope: !875, file: !875, line: 40, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!875 = !DIFile(filename: "./crawler.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "4dc9e6e54966538ea20b64490631aef9")
!876 = !DISubprogram(name: "storage_compact_pause", scope: !877, file: !877, line: 30, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!877 = !DIFile(filename: "./storage.h", directory: "/home/xuheng/blackbox/llvm-test/memcached", checksumkind: CSK_MD5, checksum: "1366cb74d3c75a613067dc0e748ab303")
!878 = !DISubprogram(name: "storage_write_pause", scope: !877, file: !877, line: 27, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!879 = !DISubprogram(name: "slabs_rebalancer_resume", scope: !869, file: !869, line: 63, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!880 = !DISubprogram(name: "lru_maintainer_resume", scope: !873, file: !873, line: 84, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!881 = !DISubprogram(name: "lru_crawler_resume", scope: !875, file: !875, line: 41, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!882 = !DISubprogram(name: "storage_compact_resume", scope: !877, file: !877, line: 31, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!883 = !DISubprogram(name: "storage_write_resume", scope: !877, file: !877, line: 28, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!884 = !DISubprogram(name: "fprintf", scope: !885, file: !885, line: 326, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !778)
!885 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!886 = !DISubroutineType(types: !887)
!887 = !{!128, !888, !942, null}
!888 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !891, line: 7, baseType: !892)
!891 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !893, line: 49, size: 1728, elements: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !910, !912, !913, !914, !916, !917, !919, !923, !926, !928, !931, !934, !935, !936, !937, !938}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !892, file: !893, line: 51, baseType: !128, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !892, file: !893, line: 54, baseType: !151, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !892, file: !893, line: 55, baseType: !151, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !892, file: !893, line: 56, baseType: !151, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !892, file: !893, line: 57, baseType: !151, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !892, file: !893, line: 58, baseType: !151, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !892, file: !893, line: 59, baseType: !151, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !892, file: !893, line: 60, baseType: !151, size: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !892, file: !893, line: 61, baseType: !151, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !892, file: !893, line: 64, baseType: !151, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !892, file: !893, line: 65, baseType: !151, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !892, file: !893, line: 66, baseType: !151, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !892, file: !893, line: 68, baseType: !908, size: 64, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !893, line: 36, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !892, file: !893, line: 70, baseType: !911, size: 64, offset: 832)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !892, file: !893, line: 72, baseType: !128, size: 32, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !892, file: !893, line: 73, baseType: !128, size: 32, offset: 928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !892, file: !893, line: 74, baseType: !915, size: 64, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !180, line: 152, baseType: !150)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !892, file: !893, line: 77, baseType: !402, size: 16, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !892, file: !893, line: 78, baseType: !918, size: 8, offset: 1040)
!918 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !892, file: !893, line: 79, baseType: !920, size: 8, offset: 1048)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 1)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !892, file: !893, line: 81, baseType: !924, size: 64, offset: 1088)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !893, line: 43, baseType: null)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !892, file: !893, line: 89, baseType: !927, size: 64, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !180, line: 153, baseType: !150)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !892, file: !893, line: 91, baseType: !929, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !893, line: 37, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !892, file: !893, line: 92, baseType: !932, size: 64, offset: 1280)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !893, line: 38, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !892, file: !893, line: 93, baseType: !911, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !892, file: !893, line: 94, baseType: !117, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !892, file: !893, line: 95, baseType: !421, size: 64, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !892, file: !893, line: 96, baseType: !128, size: 32, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !892, file: !893, line: 98, baseType: !939, size: 160, offset: 1568)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 160, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 20)
!942 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!945 = distinct !DISubprogram(name: "notify_worker_fd", scope: !3, file: !3, line: 358, type: !946, scopeLine: 358, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !948)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !152, !128, !13}
!948 = !{!949, !950, !951, !952}
!949 = !DILocalVariable(name: "t", arg: 1, scope: !945, file: !3, line: 358, type: !152)
!950 = !DILocalVariable(name: "sfd", arg: 2, scope: !945, file: !3, line: 358, type: !128)
!951 = !DILocalVariable(name: "mode", arg: 3, scope: !945, file: !3, line: 358, type: !13)
!952 = !DILocalVariable(name: "item", scope: !945, file: !3, line: 359, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "CQ_ITEM", file: !3, line: 46, baseType: !565)
!955 = !DILocation(line: 0, scope: !945)
!956 = !DILocation(line: 360, column: 32, scope: !945)
!957 = !{!958, !768, i64 6744}
!958 = !{!"", !838, i64 0, !768, i64 8, !959, i64 16, !772, i64 144, !964, i64 152, !769, i64 6600, !768, i64 6744, !768, i64 6752, !768, i64 6760, !768, i64 6768, !768, i64 6776, !768, i64 6784, !768, i64 6792, !772, i64 6800}
!959 = !{!"event", !960, i64 0, !769, i64 40, !772, i64 56, !768, i64 64, !769, i64 72, !962, i64 104, !962, i64 106, !963, i64 112}
!960 = !{!"event_callback", !961, i64 0, !962, i64 16, !769, i64 18, !769, i64 19, !769, i64 24, !768, i64 32}
!961 = !{!"", !768, i64 0, !768, i64 8}
!962 = !{!"short", !769, i64 0}
!963 = !{!"timeval", !838, i64 0, !838, i64 8}
!964 = !{!"thread_stats", !769, i64 0, !838, i64 40, !838, i64 48, !838, i64 56, !838, i64 64, !838, i64 72, !838, i64 80, !838, i64 88, !838, i64 96, !838, i64 104, !838, i64 112, !838, i64 120, !838, i64 128, !838, i64 136, !838, i64 144, !838, i64 152, !838, i64 160, !838, i64 168, !838, i64 176, !838, i64 184, !838, i64 192, !838, i64 200, !838, i64 208, !838, i64 216, !838, i64 224, !838, i64 232, !838, i64 240, !838, i64 248, !838, i64 256, !838, i64 264, !838, i64 272, !769, i64 280, !769, i64 4376, !838, i64 6424, !838, i64 6432, !838, i64 6440}
!965 = !DILocation(line: 360, column: 21, scope: !945)
!966 = !DILocation(line: 360, column: 43, scope: !945)
!967 = !DILocation(line: 360, column: 5, scope: !945)
!968 = distinct !{!968, !967, !969, !863}
!969 = !DILocation(line: 369, column: 5, scope: !945)
!970 = !DILocation(line: 371, column: 11, scope: !945)
!971 = !DILocation(line: 371, column: 16, scope: !945)
!972 = !{!973, !769, i64 20}
!973 = !{!"conn_queue_item", !772, i64 0, !769, i64 4, !772, i64 8, !772, i64 12, !769, i64 16, !769, i64 20, !768, i64 24, !768, i64 32, !838, i64 40, !769, i64 48, !768, i64 56, !974, i64 64}
!974 = !{!"", !768, i64 0}
!975 = !DILocation(line: 372, column: 11, scope: !945)
!976 = !DILocation(line: 372, column: 15, scope: !945)
!977 = !{!973, !772, i64 0}
!978 = !DILocation(line: 373, column: 5, scope: !945)
!979 = !DILocation(line: 374, column: 1, scope: !945)
!980 = distinct !DISubprogram(name: "wait_for_thread_registration", scope: !3, file: !3, line: 141, type: !981, scopeLine: 141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !128}
!983 = !{!984}
!984 = !DILocalVariable(name: "nthreads", arg: 1, scope: !980, file: !3, line: 141, type: !128)
!985 = !DILocation(line: 0, scope: !980)
