; ModuleID = 'redis-check-aof.c'
source_filename = "redis-check-aof.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [3 x i8] c"\0D\0A\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Expected \\r\\n, got: %02x%02x\00", align 1
@error = internal global [1024 x i8] zeroinitializer, align 16, !dbg !0
@.str.2 = private unnamed_addr constant [12 x i8] c"0x%08lx: %s\00", align 1
@epos = internal unnamed_addr global i64 0, align 8, !dbg !9
@.str.3 = private unnamed_addr constant [32 x i8] c"Expected prefix '%c', got: '%c'\00", align 1
@.str.4 = private unnamed_addr constant [42 x i8] c"Expected to read %ld bytes, got %ld bytes\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"multi\00", align 1
@.str.6 = private unnamed_addr constant [17 x i8] c"Unexpected MULTI\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "error", scope: !2, file: !3, line: 15, type: !12, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "redis-check-aof.c", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "3d89b3f180486c2ac4aafcd367ca7b0d")
!4 = !{!5, !6}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !{!0, !9}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "epos", scope: !2, file: !3, line: 16, type: !11, isLocal: true, isDefinition: true)
!11 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !13)
!13 = !{!14}
!14 = !DISubrange(count: 1024)
!15 = !{i32 7, !"Dwarf Version", i32 5}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{i32 7, !"uwtable", i32 1}
!19 = !{!"clang version 14.0.0"}
!20 = distinct !DISubprogram(name: "consumeNewline", scope: !3, file: !3, line: 18, type: !21, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !24)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !6}
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !{!25, !26}
!25 = !DILocalVariable(name: "buf", arg: 1, scope: !20, file: !3, line: 18, type: !6)
!26 = !DILocalVariable(name: "__buf", scope: !27, file: !3, line: 20, type: !12)
!27 = distinct !DILexicalBlock(scope: !28, file: !3, line: 20, column: 9)
!28 = distinct !DILexicalBlock(scope: !29, file: !3, line: 19, column: 37)
!29 = distinct !DILexicalBlock(scope: !20, file: !3, line: 19, column: 9)
!30 = !DILocation(line: 0, scope: !20)
!31 = !DILocation(line: 19, column: 9, scope: !29)
!32 = !DILocation(line: 19, column: 31, scope: !29)
!33 = !DILocation(line: 19, column: 9, scope: !20)
!34 = !DILocation(line: 20, column: 9, scope: !27)
!35 = !{!36, !36, i64 0}
!36 = !{!"omnipotent char", !37, i64 0}
!37 = !{!"Simple C/C++ TBAA"}
!38 = !{!39, !39, i64 0}
!39 = !{!"long", !36, i64 0}
!40 = !DILocation(line: 20, column: 9, scope: !28)
!41 = !DILocation(line: 21, column: 9, scope: !28)
!42 = !DILocation(line: 24, column: 1, scope: !20)
!43 = !DISubprogram(name: "strncmp", scope: !44, file: !44, line: 140, type: !45, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!44 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!45 = !DISubroutineType(types: !46)
!46 = !{!23, !47, !47, !49}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!51 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!52 = !{}
!53 = !DISubprogram(name: "sprintf", scope: !54, file: !54, line: 334, type: !55, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!55 = !DISubroutineType(types: !56)
!56 = !{!23, !57, !58, null}
!57 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!59 = distinct !DISubprogram(name: "readLong", scope: !3, file: !3, line: 26, type: !60, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !118)
!60 = !DISubroutineType(types: !61)
!61 = !{!23, !62, !7, !117}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 7, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 49, size: 1728, elements: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !83, !85, !86, !87, !90, !92, !94, !98, !101, !103, !106, !109, !110, !111, !112, !113}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 51, baseType: !23, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 54, baseType: !6, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 55, baseType: !6, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 56, baseType: !6, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 57, baseType: !6, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 58, baseType: !6, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 59, baseType: !6, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 60, baseType: !6, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 61, baseType: !6, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 64, baseType: !6, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 65, baseType: !6, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 66, baseType: !6, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 68, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 36, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 70, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 72, baseType: !23, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 73, baseType: !23, size: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 74, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 152, baseType: !11)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 77, baseType: !91, size: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 78, baseType: !93, size: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 79, baseType: !95, size: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 81, baseType: !99, size: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 43, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 89, baseType: !102, size: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 153, baseType: !11)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !65, file: !66, line: 91, baseType: !104, size: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !66, line: 37, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !65, file: !66, line: 92, baseType: !107, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !66, line: 38, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !65, file: !66, line: 93, baseType: !84, size: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !65, file: !66, line: 94, baseType: !5, size: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 95, baseType: !49, size: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 96, baseType: !23, size: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 98, baseType: !114, size: 160, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!118 = !{!119, !120, !121, !122, !126, !127}
!119 = !DILocalVariable(name: "fp", arg: 1, scope: !59, file: !3, line: 26, type: !62)
!120 = !DILocalVariable(name: "prefix", arg: 2, scope: !59, file: !3, line: 26, type: !7)
!121 = !DILocalVariable(name: "target", arg: 3, scope: !59, file: !3, line: 26, type: !117)
!122 = !DILocalVariable(name: "buf", scope: !59, file: !3, line: 27, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 128)
!126 = !DILocalVariable(name: "eptr", scope: !59, file: !3, line: 27, type: !6)
!127 = !DILocalVariable(name: "__buf", scope: !128, file: !3, line: 33, type: !12)
!128 = distinct !DILexicalBlock(scope: !129, file: !3, line: 33, column: 9)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 32, column: 27)
!130 = distinct !DILexicalBlock(scope: !59, file: !3, line: 32, column: 9)
!131 = !DILocation(line: 0, scope: !59)
!132 = !DILocation(line: 27, column: 5, scope: !59)
!133 = !DILocation(line: 27, column: 10, scope: !59)
!134 = !DILocation(line: 28, column: 12, scope: !59)
!135 = !DILocation(line: 28, column: 10, scope: !59)
!136 = !DILocation(line: 29, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !59, file: !3, line: 29, column: 9)
!138 = !DILocation(line: 29, column: 35, scope: !137)
!139 = !DILocation(line: 29, column: 9, scope: !59)
!140 = !DILocation(line: 32, column: 9, scope: !130)
!141 = !DILocation(line: 32, column: 16, scope: !130)
!142 = !DILocation(line: 32, column: 9, scope: !59)
!143 = !DILocation(line: 32, column: 19, scope: !130)
!144 = !DILocation(line: 33, column: 9, scope: !128)
!145 = !DILocation(line: 33, column: 9, scope: !129)
!146 = !DILocation(line: 34, column: 9, scope: !129)
!147 = !DILocation(line: 36, column: 25, scope: !59)
!148 = !DILocation(line: 36, column: 15, scope: !59)
!149 = !DILocation(line: 36, column: 13, scope: !59)
!150 = !DILocation(line: 37, column: 27, scope: !59)
!151 = !{!152, !152, i64 0}
!152 = !{!"any pointer", !36, i64 0}
!153 = !DILocation(line: 37, column: 12, scope: !59)
!154 = !DILocation(line: 37, column: 5, scope: !59)
!155 = !DILocation(line: 38, column: 1, scope: !59)
!156 = !DISubprogram(name: "ftell", scope: !54, file: !54, line: 689, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!157 = !DISubroutineType(types: !158)
!158 = !{!11, !62}
!159 = !DISubprogram(name: "fgets", scope: !54, file: !54, line: 564, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!160 = !DISubroutineType(types: !161)
!161 = !{!6, !57, !23, !162}
!162 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !62)
!163 = !DISubprogram(name: "strtol", scope: !164, file: !164, line: 176, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!164 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!165 = !DISubroutineType(types: !166)
!166 = !{!11, !58, !167, !23}
!167 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!169 = distinct !DISubprogram(name: "readBytes", scope: !3, file: !3, line: 40, type: !170, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !172)
!170 = !DISubroutineType(types: !171)
!171 = !{!23, !62, !6, !11}
!172 = !{!173, !174, !175, !176, !177}
!173 = !DILocalVariable(name: "fp", arg: 1, scope: !169, file: !3, line: 40, type: !62)
!174 = !DILocalVariable(name: "target", arg: 2, scope: !169, file: !3, line: 40, type: !6)
!175 = !DILocalVariable(name: "length", arg: 3, scope: !169, file: !3, line: 40, type: !11)
!176 = !DILocalVariable(name: "real", scope: !169, file: !3, line: 41, type: !11)
!177 = !DILocalVariable(name: "__buf", scope: !178, file: !3, line: 45, type: !12)
!178 = distinct !DILexicalBlock(scope: !179, file: !3, line: 45, column: 9)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 44, column: 25)
!180 = distinct !DILexicalBlock(scope: !169, file: !3, line: 44, column: 9)
!181 = !DILocation(line: 0, scope: !169)
!182 = !DILocation(line: 42, column: 12, scope: !169)
!183 = !DILocation(line: 42, column: 10, scope: !169)
!184 = !DILocation(line: 43, column: 12, scope: !169)
!185 = !DILocation(line: 44, column: 14, scope: !180)
!186 = !DILocation(line: 44, column: 9, scope: !169)
!187 = !DILocation(line: 45, column: 9, scope: !178)
!188 = !DILocation(line: 45, column: 9, scope: !179)
!189 = !DILocation(line: 46, column: 9, scope: !179)
!190 = !DILocation(line: 49, column: 1, scope: !169)
!191 = !DISubprogram(name: "fread", scope: !54, file: !54, line: 646, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!192 = !DISubroutineType(types: !193)
!193 = !{!49, !194, !49, !49, !162}
!194 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !5)
!195 = distinct !DISubprogram(name: "readString", scope: !3, file: !3, line: 51, type: !196, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{!23, !62, !168}
!198 = !{!199, !200, !201}
!199 = !DILocalVariable(name: "fp", arg: 1, scope: !195, file: !3, line: 51, type: !62)
!200 = !DILocalVariable(name: "target", arg: 2, scope: !195, file: !3, line: 51, type: !168)
!201 = !DILocalVariable(name: "len", scope: !195, file: !3, line: 52, type: !11)
!202 = !DILocation(line: 0, scope: !195)
!203 = !DILocation(line: 52, column: 5, scope: !195)
!204 = !DILocation(line: 53, column: 13, scope: !195)
!205 = !DILocation(line: 54, column: 10, scope: !206)
!206 = distinct !DILexicalBlock(scope: !195, file: !3, line: 54, column: 9)
!207 = !DILocation(line: 54, column: 9, scope: !195)
!208 = !DILocation(line: 59, column: 9, scope: !195)
!209 = !DILocation(line: 60, column: 22, scope: !195)
!210 = !DILocation(line: 60, column: 13, scope: !195)
!211 = !DILocation(line: 61, column: 10, scope: !212)
!212 = distinct !DILexicalBlock(scope: !195, file: !3, line: 61, column: 9)
!213 = !DILocation(line: 61, column: 9, scope: !195)
!214 = !DILocation(line: 64, column: 25, scope: !215)
!215 = distinct !DILexicalBlock(scope: !195, file: !3, line: 64, column: 9)
!216 = !DILocation(line: 64, column: 36, scope: !215)
!217 = !DILocation(line: 64, column: 10, scope: !215)
!218 = !DILocation(line: 64, column: 9, scope: !195)
!219 = !DILocation(line: 67, column: 6, scope: !195)
!220 = !DILocation(line: 67, column: 5, scope: !195)
!221 = !DILocation(line: 67, column: 22, scope: !195)
!222 = !DILocation(line: 68, column: 5, scope: !195)
!223 = !DILocation(line: 69, column: 1, scope: !195)
!224 = !DISubprogram(name: "malloc", scope: !164, file: !164, line: 539, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!225 = !DISubroutineType(types: !226)
!226 = !{!5, !49}
!227 = distinct !DISubprogram(name: "readArgc", scope: !3, file: !3, line: 71, type: !228, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{!23, !62, !117}
!230 = !{!231, !232}
!231 = !DILocalVariable(name: "fp", arg: 1, scope: !227, file: !3, line: 71, type: !62)
!232 = !DILocalVariable(name: "target", arg: 2, scope: !227, file: !3, line: 71, type: !117)
!233 = !DILocation(line: 0, scope: !227)
!234 = !DILocation(line: 72, column: 12, scope: !227)
!235 = !DILocation(line: 72, column: 5, scope: !227)
!236 = distinct !DISubprogram(name: "process", scope: !3, file: !3, line: 75, type: !157, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !256, !262}
!238 = !DILocalVariable(name: "fp", arg: 1, scope: !236, file: !3, line: 75, type: !62)
!239 = !DILocalVariable(name: "argc", scope: !236, file: !3, line: 76, type: !11)
!240 = !DILocalVariable(name: "pos", scope: !236, file: !3, line: 76, type: !11)
!241 = !DILocalVariable(name: "i", scope: !236, file: !3, line: 77, type: !23)
!242 = !DILocalVariable(name: "multi", scope: !236, file: !3, line: 77, type: !23)
!243 = !DILocalVariable(name: "str", scope: !236, file: !3, line: 78, type: !6)
!244 = !DILocalVariable(name: "__buf", scope: !245, file: !3, line: 89, type: !12)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 89, column: 25)
!246 = distinct !DILexicalBlock(scope: !247, file: !3, line: 88, column: 34)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 88, column: 25)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 87, column: 52)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 87, column: 21)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 86, column: 25)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 86, column: 17)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 84, column: 36)
!253 = distinct !DILexicalBlock(scope: !254, file: !3, line: 84, column: 9)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 84, column: 9)
!255 = distinct !DILexicalBlock(scope: !236, file: !3, line: 80, column: 14)
!256 = !DILocalVariable(name: "__buf", scope: !257, file: !3, line: 94, type: !12)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 94, column: 25)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 93, column: 34)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 93, column: 25)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 92, column: 58)
!261 = distinct !DILexicalBlock(scope: !249, file: !3, line: 92, column: 28)
!262 = !DILocalVariable(name: "__buf", scope: !263, file: !3, line: 110, type: !12)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 110, column: 9)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 109, column: 50)
!265 = distinct !DILexicalBlock(scope: !236, file: !3, line: 109, column: 9)
!266 = !DILocation(line: 0, scope: !236)
!267 = !DILocation(line: 76, column: 5, scope: !236)
!268 = !DILocation(line: 78, column: 5, scope: !236)
!269 = !DILocation(line: 80, column: 5, scope: !236)
!270 = !DILocation(line: 81, column: 13, scope: !255)
!271 = !DILocation(line: 76, column: 16, scope: !236)
!272 = !DILocation(line: 81, column: 27, scope: !273)
!273 = distinct !DILexicalBlock(scope: !255, file: !3, line: 81, column: 13)
!274 = !DILocation(line: 81, column: 21, scope: !273)
!275 = !DILocation(line: 82, column: 14, scope: !276)
!276 = distinct !DILexicalBlock(scope: !255, file: !3, line: 82, column: 13)
!277 = !DILocation(line: 82, column: 13, scope: !255)
!278 = !DILocation(line: 84, column: 23, scope: !253)
!279 = !DILocation(line: 84, column: 9, scope: !254)
!280 = !DILocation(line: 85, column: 18, scope: !281)
!281 = distinct !DILexicalBlock(scope: !252, file: !3, line: 85, column: 17)
!282 = !DILocation(line: 85, column: 17, scope: !252)
!283 = !DILocation(line: 86, column: 19, scope: !251)
!284 = !DILocation(line: 0, scope: !252)
!285 = !DILocation(line: 86, column: 17, scope: !252)
!286 = !DILocation(line: 87, column: 21, scope: !249)
!287 = !DILocation(line: 87, column: 46, scope: !249)
!288 = !DILocation(line: 87, column: 21, scope: !250)
!289 = !DILocation(line: 88, column: 30, scope: !247)
!290 = !DILocation(line: 88, column: 25, scope: !248)
!291 = !DILocation(line: 89, column: 25, scope: !245)
!292 = !DILocation(line: 89, column: 25, scope: !246)
!293 = !DILocation(line: 90, column: 25, scope: !246)
!294 = !DILocation(line: 92, column: 28, scope: !261)
!295 = !DILocation(line: 92, column: 52, scope: !261)
!296 = !DILocation(line: 92, column: 28, scope: !249)
!297 = !DILocation(line: 93, column: 25, scope: !259)
!298 = !DILocation(line: 93, column: 25, scope: !260)
!299 = !DILocation(line: 94, column: 25, scope: !257)
!300 = !DILocation(line: 94, column: 25, scope: !258)
!301 = !DILocation(line: 95, column: 25, scope: !258)
!302 = !DILocation(line: 99, column: 13, scope: !252)
!303 = !DILocation(line: 84, column: 32, scope: !253)
!304 = distinct !{!304, !279, !305}
!305 = !DILocation(line: 100, column: 9, scope: !254)
!306 = !DILocation(line: 104, column: 17, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 104, column: 17)
!308 = distinct !DILexicalBlock(scope: !309, file: !3, line: 103, column: 23)
!309 = distinct !DILexicalBlock(scope: !255, file: !3, line: 103, column: 13)
!310 = !DILocation(line: 104, column: 17, scope: !308)
!311 = !DILocation(line: 104, column: 22, scope: !307)
!312 = !DILocation(line: 109, column: 9, scope: !265)
!313 = !DILocation(line: 109, column: 18, scope: !265)
!314 = !DILocation(line: 109, column: 30, scope: !265)
!315 = !DILocation(line: 109, column: 44, scope: !265)
!316 = !DILocation(line: 109, column: 9, scope: !236)
!317 = !DILocation(line: 110, column: 9, scope: !263)
!318 = !DILocation(line: 110, column: 9, scope: !264)
!319 = !DILocation(line: 111, column: 5, scope: !264)
!320 = !DILocation(line: 112, column: 9, scope: !321)
!321 = distinct !DILexicalBlock(scope: !236, file: !3, line: 112, column: 9)
!322 = !DILocation(line: 112, column: 23, scope: !321)
!323 = !DILocation(line: 112, column: 9, scope: !236)
!324 = !DILocation(line: 113, column: 9, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 112, column: 28)
!326 = !DILocation(line: 114, column: 5, scope: !325)
!327 = !DILocation(line: 116, column: 1, scope: !236)
!328 = !DILocation(line: 115, column: 5, scope: !236)
!329 = !DISubprogram(name: "strcasecmp", scope: !330, file: !330, line: 116, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!330 = !DIFile(filename: "/usr/include/strings.h", directory: "", checksumkind: CSK_MD5, checksum: "bd81fc6b401eca7e7fe9248ee68afe69")
!331 = !DISubroutineType(types: !332)
!332 = !{!23, !47, !47}
!333 = !DISubprogram(name: "free", scope: !164, file: !164, line: 565, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !5}
!336 = !DISubprogram(name: "feof", scope: !54, file: !54, line: 759, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!337 = !DISubroutineType(types: !338)
!338 = !{!23, !62}
!339 = !DISubprogram(name: "strlen", scope: !44, file: !44, line: 385, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!340 = !DISubroutineType(types: !341)
!341 = !{!49, !47}
!342 = !DISubprogram(name: "printf", scope: !54, file: !54, line: 332, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!343 = !DISubroutineType(types: !344)
!344 = !{!23, !58, null}
!345 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 118, type: !346, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!23, !23, !168}
!348 = !{!349, !350, !351, !352, !353, !354, !392, !393, !394, !395}
!349 = !DILocalVariable(name: "argc", arg: 1, scope: !345, file: !3, line: 118, type: !23)
!350 = !DILocalVariable(name: "argv", arg: 2, scope: !345, file: !3, line: 118, type: !168)
!351 = !DILocalVariable(name: "filename", scope: !345, file: !3, line: 119, type: !6)
!352 = !DILocalVariable(name: "fix", scope: !345, file: !3, line: 120, type: !23)
!353 = !DILocalVariable(name: "fp", scope: !345, file: !3, line: 139, type: !62)
!354 = !DILocalVariable(name: "sb", scope: !345, file: !3, line: 145, type: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !356, line: 46, size: 1152, elements: !357)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!357 = !{!358, !360, !362, !364, !367, !369, !371, !372, !373, !374, !376, !378, !386, !387, !388}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !355, file: !356, line: 48, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !89, line: 145, baseType: !51)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !355, file: !356, line: 53, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !89, line: 148, baseType: !51)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !355, file: !356, line: 61, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !89, line: 151, baseType: !51)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !355, file: !356, line: 62, baseType: !365, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !89, line: 150, baseType: !366)
!366 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !355, file: !356, line: 64, baseType: !368, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !89, line: 146, baseType: !366)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !355, file: !356, line: 65, baseType: !370, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !89, line: 147, baseType: !366)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !355, file: !356, line: 67, baseType: !23, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !355, file: !356, line: 69, baseType: !359, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !355, file: !356, line: 74, baseType: !88, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !355, file: !356, line: 78, baseType: !375, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !89, line: 174, baseType: !11)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !355, file: !356, line: 80, baseType: !377, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !89, line: 179, baseType: !11)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !355, file: !356, line: 91, baseType: !379, size: 128, offset: 576)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !380, line: 10, size: 128, elements: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !379, file: !380, line: 12, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !89, line: 160, baseType: !11)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !379, file: !380, line: 16, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !89, line: 196, baseType: !11)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !355, file: !356, line: 92, baseType: !379, size: 128, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !355, file: !356, line: 93, baseType: !379, size: 128, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !355, file: !356, line: 106, baseType: !389, size: 192, offset: 960)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 192, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 3)
!392 = !DILocalVariable(name: "size", scope: !345, file: !3, line: 151, type: !11)
!393 = !DILocalVariable(name: "pos", scope: !345, file: !3, line: 157, type: !11)
!394 = !DILocalVariable(name: "diff", scope: !345, file: !3, line: 158, type: !11)
!395 = !DILocalVariable(name: "buf", scope: !396, file: !3, line: 161, type: !400)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 160, column: 18)
!397 = distinct !DILexicalBlock(scope: !398, file: !3, line: 160, column: 13)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 159, column: 19)
!399 = distinct !DILexicalBlock(scope: !345, file: !3, line: 159, column: 9)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 2)
!403 = !DILocation(line: 0, scope: !345)
!404 = !DILocation(line: 122, column: 14, scope: !405)
!405 = distinct !DILexicalBlock(scope: !345, file: !3, line: 122, column: 9)
!406 = !DILocation(line: 122, column: 9, scope: !345)
!407 = !DILocation(line: 123, column: 50, scope: !408)
!408 = distinct !DILexicalBlock(scope: !405, file: !3, line: 122, column: 19)
!409 = !DILocation(line: 123, column: 9, scope: !408)
!410 = !DILocation(line: 124, column: 9, scope: !408)
!411 = !DILocation(line: 125, column: 21, scope: !412)
!412 = distinct !DILexicalBlock(scope: !405, file: !3, line: 125, column: 16)
!413 = !DILocation(line: 125, column: 16, scope: !405)
!414 = !DILocation(line: 127, column: 21, scope: !415)
!415 = distinct !DILexicalBlock(scope: !412, file: !3, line: 127, column: 16)
!416 = !DILocation(line: 127, column: 16, scope: !412)
!417 = !DILocation(line: 128, column: 20, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !3, line: 128, column: 13)
!419 = distinct !DILexicalBlock(scope: !415, file: !3, line: 127, column: 27)
!420 = !DILocation(line: 128, column: 13, scope: !418)
!421 = !DILocation(line: 128, column: 37, scope: !418)
!422 = !DILocation(line: 128, column: 13, scope: !419)
!423 = !DILocation(line: 129, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !418, file: !3, line: 128, column: 43)
!425 = !DILocation(line: 130, column: 13, scope: !424)
!426 = !DILocation(line: 135, column: 9, scope: !427)
!427 = distinct !DILexicalBlock(scope: !415, file: !3, line: 134, column: 12)
!428 = !DILocation(line: 136, column: 9, scope: !427)
!429 = !DILocation(line: 0, scope: !412)
!430 = !DILocation(line: 139, column: 16, scope: !345)
!431 = !DILocation(line: 140, column: 12, scope: !432)
!432 = distinct !DILexicalBlock(scope: !345, file: !3, line: 140, column: 9)
!433 = !DILocation(line: 140, column: 9, scope: !345)
!434 = !DILocation(line: 141, column: 9, scope: !435)
!435 = distinct !DILexicalBlock(scope: !432, file: !3, line: 140, column: 21)
!436 = !DILocation(line: 142, column: 9, scope: !435)
!437 = !DILocation(line: 145, column: 5, scope: !345)
!438 = !DILocation(line: 145, column: 23, scope: !345)
!439 = !DILocation(line: 146, column: 21, scope: !440)
!440 = distinct !DILexicalBlock(scope: !345, file: !3, line: 146, column: 9)
!441 = !DILocation(line: 146, column: 9, scope: !440)
!442 = !DILocation(line: 146, column: 37, scope: !440)
!443 = !DILocation(line: 146, column: 9, scope: !345)
!444 = !DILocation(line: 147, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !440, file: !3, line: 146, column: 44)
!446 = !DILocation(line: 148, column: 9, scope: !445)
!447 = !DILocation(line: 151, column: 20, scope: !345)
!448 = !{!449, !39, i64 48}
!449 = !{!"stat", !39, i64 0, !39, i64 8, !39, i64 16, !450, i64 24, !450, i64 28, !450, i64 32, !450, i64 36, !39, i64 40, !39, i64 48, !39, i64 56, !39, i64 64, !451, i64 72, !451, i64 88, !451, i64 104, !36, i64 120}
