; ModuleID = 'redis.c'
source_filename = "redis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.redisServer = type { i64, i32, i32, %struct.redisDb*, i64, i64, %struct.list*, %struct.list*, %struct.list*, [256 x i8], %struct.aeEventLoop*, i32, %struct.list*, i64, i64, i64, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i8*, i32, i32, i8*, i8*, %struct.saveparam*, i32, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i8*, i8*, i32, %struct.redisClient*, i32, i32, i64, i32, i32, i32, i32, i32, i32, i8*, i64, i64, i64, i64, i64, %struct._IO_FILE*, i32, i64, i64, i8*, i64, %struct.list*, %struct.list*, %struct.list*, %struct.list*, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_mutex_t, %union.pthread_attr_t, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dict*, %struct.list*, %struct._IO_FILE* }
%struct.redisDb = type { %struct.dict*, %struct.dict*, %struct.dict*, %struct.dict*, i32 }
%struct.aeEventLoop = type { i32, i64, [10240 x %struct.aeFileEvent], [10240 x %struct.aeFiredEvent], %struct.aeTimeEvent*, i32, i8*, void (%struct.aeEventLoop*)* }
%struct.aeFileEvent = type { i32, void (%struct.aeEventLoop*, i32, i8*, i32)*, void (%struct.aeEventLoop*, i32, i8*, i32)*, i8* }
%struct.aeFiredEvent = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "server", scope: !2, file: !3, line: 748, type: !445, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !359, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "redis.c", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "81c528792f7fa50efc6105e13dd380f7")
!4 = !{!5, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 33, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./redis.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "702621b06500076a0b5a8040f5d5642a")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!24 = !DIEnumerator(name: "REG_GS", value: 0)
!25 = !DIEnumerator(name: "REG_FS", value: 1)
!26 = !DIEnumerator(name: "REG_ES", value: 2)
!27 = !DIEnumerator(name: "REG_DS", value: 3)
!28 = !DIEnumerator(name: "REG_EDI", value: 4)
!29 = !DIEnumerator(name: "REG_ESI", value: 5)
!30 = !DIEnumerator(name: "REG_EBP", value: 6)
!31 = !DIEnumerator(name: "REG_ESP", value: 7)
!32 = !DIEnumerator(name: "REG_EBX", value: 8)
!33 = !DIEnumerator(name: "REG_EDX", value: 9)
!34 = !DIEnumerator(name: "REG_ECX", value: 10)
!35 = !DIEnumerator(name: "REG_EAX", value: 11)
!36 = !DIEnumerator(name: "REG_TRAPNO", value: 12)
!37 = !DIEnumerator(name: "REG_ERR", value: 13)
!38 = !DIEnumerator(name: "REG_EIP", value: 14)
!39 = !DIEnumerator(name: "REG_CS", value: 15)
!40 = !DIEnumerator(name: "REG_EFL", value: 16)
!41 = !DIEnumerator(name: "REG_UESP", value: 17)
!42 = !DIEnumerator(name: "REG_SS", value: 18)
!43 = !{!44, !45, !46, !47, !49, !53, !54, !55, !56, !58, !86, !139, !143, !145, !165, !167, !168, !169, !151, !170, !7, !171, !195, !196, !198, !199, !204, !287}
!44 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !50, line: 7, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "49b4e16ef1215de5afdbb283400ab90c")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!53 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !57, line: 27, baseType: !55)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !60, line: 54, baseType: !61)
!60 = !DIFile(filename: "./adlist.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "0461b55abfa9065d70cc6ca884308362")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !60, line: 47, size: 384, elements: !62)
!62 = !{!63, !72, !73, !77, !81, !85}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !61, file: !60, line: 48, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !60, line: 40, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !60, line: 36, size: 192, elements: !67)
!67 = !{!68, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !60, line: 37, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !60, line: 38, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !60, line: 39, baseType: !46, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !61, file: !60, line: 49, baseType: !64, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !61, file: !60, line: 50, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!46, !46}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !61, file: !60, line: 51, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !46}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !61, file: !60, line: 52, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!45, !46, !46}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !61, file: !60, line: 53, baseType: !7, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict", file: !88, line: 75, baseType: !89)
!88 = !DIFile(filename: "./dict.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "b8b7e1319e2afa32704af21432f9ee20")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !88, line: 69, size: 704, elements: !90)
!90 = !{!91, !116, !117, !137, !138}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !88, line: 70, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictType", file: !88, line: 58, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictType", file: !88, line: 51, size: 384, elements: !95)
!95 = !{!96, !102, !106, !107, !111, !115}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hashFunction", scope: !94, file: !88, line: 52, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!7, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "keyDup", scope: !94, file: !88, line: 53, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!46, !46, !100}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "valDup", scope: !94, file: !88, line: 54, baseType: !103, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "keyCompare", scope: !94, file: !88, line: 55, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!45, !46, !100, !100}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "keyDestructor", scope: !94, file: !88, line: 56, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !46, !46}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "valDestructor", scope: !94, file: !88, line: 57, baseType: !112, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !89, file: !88, line: 71, baseType: !46, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !89, file: !88, line: 72, baseType: !118, size: 512, offset: 128)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !135)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictht", file: !88, line: 67, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictht", file: !88, line: 62, size: 256, elements: !121)
!121 = !{!122, !132, !133, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !120, file: !88, line: 63, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictEntry", file: !88, line: 49, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictEntry", file: !88, line: 45, size: 192, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !126, file: !88, line: 46, baseType: !46, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !88, line: 47, baseType: !46, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !88, line: 48, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !88, line: 64, baseType: !55, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sizemask", scope: !120, file: !88, line: 65, baseType: !55, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !120, file: !88, line: 66, baseType: !55, size: 64, offset: 192)
!135 = !{!136}
!136 = !DISubrange(count: 2)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rehashidx", scope: !89, file: !88, line: 73, baseType: !45, size: 32, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "iterators", scope: !89, file: !88, line: 74, baseType: !45, size: 32, offset: 672)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !140, line: 25, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "081edea97425b3437dded4a7fe223193")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !52, line: 39, baseType: !142)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !140, line: 26, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !52, line: 41, baseType: !45)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "robj", file: !3, line: 271, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObject", file: !3, line: 257, size: 320, elements: !148)
!148 = !{!149, !150, !152, !153, !154, !155, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !147, file: !3, line: 258, baseType: !46, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !3, line: 259, baseType: !151, size: 8, offset: 64)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !147, file: !3, line: 260, baseType: !151, size: 8, offset: 72)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !147, file: !3, line: 261, baseType: !151, size: 8, offset: 80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !147, file: !3, line: 263, baseType: !151, size: 8, offset: 88)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !147, file: !3, line: 265, baseType: !45, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vm", scope: !147, file: !3, line: 270, baseType: !157, size: 192, offset: 128)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisObjectVM", file: !3, line: 250, size: 192, elements: !158)
!158 = !{!159, !163, !164}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !157, file: !3, line: 251, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !161, line: 65, baseType: !162)
!161 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !52, line: 153, baseType: !53)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "usedpages", scope: !157, file: !3, line: 252, baseType: !160, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !157, file: !3, line: 253, baseType: !49, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !166, line: 36, baseType: !47)
!166 = !DIFile(filename: "./sds.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "be5f4c5599eae55b8730033246030f20")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!168 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "zset", file: !3, line: 512, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zset", file: !3, line: 509, size: 128, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !173, file: !3, line: 510, baseType: !86, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "zsl", scope: !173, file: !3, line: 511, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "zskiplist", file: !3, line: 507, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplist", file: !3, line: 503, size: 256, elements: !180)
!180 = !{!181, !192, !193, !194}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !179, file: !3, line: 504, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zskiplistNode", file: !3, line: 495, size: 320, elements: !184)
!184 = !{!185, !187, !188, !190, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !183, file: !3, line: 496, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !183, file: !3, line: 497, baseType: !182, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !183, file: !3, line: 498, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !183, file: !3, line: 499, baseType: !168, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !183, file: !3, line: 500, baseType: !145, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !3, line: 504, baseType: !182, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !179, file: !3, line: 505, baseType: !55, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !179, file: !3, line: 506, baseType: !45, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 46, baseType: !55)
!197 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !200, line: 72, baseType: !201)
!200 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ccc98b488c777571beae1a47763d91")
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !45}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !206, line: 151, baseType: !207)
!206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/ucontext.h", directory: "", checksumkind: CSK_MD5, checksum: "55884736823fd156ff88bfe3fd100caf")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucontext_t", file: !206, line: 142, size: 7744, elements: !208)
!208 = !{!209, !210, !212, !220, !275, !284, !285}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "uc_flags", scope: !207, file: !206, line: 144, baseType: !55, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !207, file: !206, line: 145, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !207, file: !206, line: 146, baseType: !213, size: 192, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !214, line: 31, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/stack_t.h", directory: "", checksumkind: CSK_MD5, checksum: "893fc96118d5328f1c1d31b635387971")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 26, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !215, file: !214, line: 28, baseType: !46, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !215, file: !214, line: 29, baseType: !45, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !215, file: !214, line: 30, baseType: !196, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !207, file: !206, line: 147, baseType: !221, size: 2048, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !206, line: 139, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 133, size: 2048, elements: !223)
!223 = !{!224, !230, !273}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gregs", scope: !222, file: !206, line: 135, baseType: !225, size: 1472)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "gregset_t", file: !206, line: 46, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 1472, elements: !228)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "greg_t", file: !206, line: 37, baseType: !54)
!228 = !{!229}
!229 = !DISubrange(count: 23)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fpregs", scope: !222, file: !206, line: 137, baseType: !231, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpregset_t", file: !206, line: 130, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_fpstate", file: !206, line: 113, size: 4096, elements: !234)
!234 = !{!235, !237, !238, !239, !240, !242, !243, !245, !246, !261, !269}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !233, file: !206, line: 116, baseType: !236, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 40, baseType: !169)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "swd", scope: !233, file: !206, line: 117, baseType: !236, size: 16, offset: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ftw", scope: !233, file: !206, line: 118, baseType: !236, size: 16, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fop", scope: !233, file: !206, line: 119, baseType: !236, size: 16, offset: 48)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rip", scope: !233, file: !206, line: 120, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !52, line: 45, baseType: !55)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rdp", scope: !233, file: !206, line: 121, baseType: !241, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mxcsr", scope: !233, file: !206, line: 122, baseType: !244, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !52, line: 42, baseType: !7)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mxcr_mask", scope: !233, file: !206, line: 123, baseType: !244, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_st", scope: !233, file: !206, line: 124, baseType: !247, size: 1024, offset: 256)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 1024, elements: !259)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_fpxreg", file: !206, line: 101, size: 128, elements: !249)
!249 = !{!250, !254, !255}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "significand", scope: !248, file: !206, line: 103, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !248, file: !206, line: 104, baseType: !169, size: 16, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved1", scope: !248, file: !206, line: 105, baseType: !256, size: 48, offset: 80)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 48, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !{!260}
!260 = !DISubrange(count: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_xmm", scope: !233, file: !206, line: 125, baseType: !262, size: 2048, offset: 1280)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 2048, elements: !267)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_xmmreg", file: !206, line: 108, size: 128, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !263, file: !206, line: 110, baseType: !266, size: 128)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !252)
!267 = !{!268}
!268 = !DISubrange(count: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved1", scope: !233, file: !206, line: 126, baseType: !270, size: 768, offset: 3328)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 768, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 24)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved1", scope: !222, file: !206, line: 138, baseType: !274, size: 512, offset: 1536)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 512, elements: !259)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !207, file: !206, line: 148, baseType: !276, size: 1024, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !277, line: 7, baseType: !278)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !279, line: 8, baseType: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 5, size: 1024, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !280, file: !279, line: 7, baseType: !283, size: 1024)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 1024, elements: !267)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__fpregs_mem", scope: !207, file: !206, line: 149, baseType: !233, size: 4096, offset: 3392)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__ssp", scope: !207, file: !206, line: 150, baseType: !286, size: 256, offset: 7488)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 256, elements: !252)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisClient", file: !3, line: 336, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisClient", file: !3, line: 307, size: 1536, elements: !290)
!290 = !{!291, !292, !302, !303, !304, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !353, !354, !355, !356, !357, !358}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !289, file: !3, line: 308, baseType: !45, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !289, file: !3, line: 309, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDb", file: !3, line: 291, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisDb", file: !3, line: 285, size: 320, elements: !296)
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !295, file: !3, line: 286, baseType: !86, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !295, file: !3, line: 287, baseType: !86, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "blockingkeys", scope: !295, file: !3, line: 288, baseType: !86, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "io_keys", scope: !295, file: !3, line: 289, baseType: !86, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !295, file: !3, line: 290, baseType: !45, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dictid", scope: !289, file: !3, line: 310, baseType: !45, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "querybuf", scope: !289, file: !3, line: 311, baseType: !165, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !289, file: !3, line: 312, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mbargv", scope: !289, file: !3, line: 312, baseType: !305, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !289, file: !3, line: 313, baseType: !45, size: 32, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mbargc", scope: !289, file: !3, line: 313, baseType: !45, size: 32, offset: 416)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bulklen", scope: !289, file: !3, line: 314, baseType: !45, size: 32, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "multibulk", scope: !289, file: !3, line: 315, baseType: !45, size: 32, offset: 480)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !289, file: !3, line: 316, baseType: !58, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sentlen", scope: !289, file: !3, line: 317, baseType: !45, size: 32, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lastinteraction", scope: !289, file: !3, line: 318, baseType: !49, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !3, line: 319, baseType: !45, size: 32, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "slaveseldb", scope: !289, file: !3, line: 320, baseType: !45, size: 32, offset: 736)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !289, file: !3, line: 321, baseType: !45, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !289, file: !3, line: 322, baseType: !45, size: 32, offset: 800)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repldbfd", scope: !289, file: !3, line: 323, baseType: !45, size: 32, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repldboff", scope: !289, file: !3, line: 324, baseType: !53, size: 64, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "repldbsize", scope: !289, file: !3, line: 325, baseType: !160, size: 64, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !289, file: !3, line: 326, baseType: !322, size: 128, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiState", file: !3, line: 303, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiState", file: !3, line: 300, size: 128, elements: !324)
!324 = !{!325, !352}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !323, file: !3, line: 301, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "multiCmd", file: !3, line: 298, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "multiCmd", file: !3, line: 294, size: 192, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !328, file: !3, line: 295, baseType: !305, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !328, file: !3, line: 296, baseType: !45, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !328, file: !3, line: 297, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCommand", file: !3, line: 460, size: 384, elements: !335)
!335 = !{!336, !337, !342, !343, !344, !349, !350, !351}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !3, line: 461, baseType: !47, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !334, file: !3, line: 462, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCommandProc", file: !3, line: 458, baseType: !340)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !287}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !334, file: !3, line: 463, baseType: !45, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !3, line: 464, baseType: !45, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vm_preload_proc", scope: !334, file: !3, line: 468, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisVmPreloadProc", file: !3, line: 459, baseType: !347)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !287, !333, !45, !305}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vm_firstkey", scope: !334, file: !3, line: 470, baseType: !45, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vm_lastkey", scope: !334, file: !3, line: 471, baseType: !45, size: 32, offset: 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vm_keystep", scope: !334, file: !3, line: 472, baseType: !45, size: 32, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !323, file: !3, line: 302, baseType: !45, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "blockingkeys", scope: !289, file: !3, line: 327, baseType: !305, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "blockingkeysnum", scope: !289, file: !3, line: 329, baseType: !45, size: 32, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "blockingto", scope: !289, file: !3, line: 330, baseType: !49, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "io_keys", scope: !289, file: !3, line: 332, baseType: !58, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !289, file: !3, line: 334, baseType: !86, size: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !289, file: !3, line: 335, baseType: !58, size: 64, offset: 1472)
!359 = !{!360, !362, !0, !407, !409, !411, !413, !415, !417, !419, !424, !427, !429, !439, !441, !443}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "vm", scope: !2, file: !3, line: 254, type: !157, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "shared", scope: !2, file: !3, line: 527, type: !364, isLocal: false, isDefinition: true)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sharedObjectsStruct", file: !3, line: 517, size: 642368, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "crlf", scope: !364, file: !3, line: 518, baseType: !145, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "emptybulk", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "czero", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cone", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pong", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !364, file: !3, line: 518, baseType: !145, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "colon", scope: !364, file: !3, line: 519, baseType: !145, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nullbulk", scope: !364, file: !3, line: 519, baseType: !145, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nullmultibulk", scope: !364, file: !3, line: 519, baseType: !145, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !364, file: !3, line: 519, baseType: !145, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "emptymultibulk", scope: !364, file: !3, line: 520, baseType: !145, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wrongtypeerr", scope: !364, file: !3, line: 520, baseType: !145, size: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nokeyerr", scope: !364, file: !3, line: 520, baseType: !145, size: 64, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "syntaxerr", scope: !364, file: !3, line: 520, baseType: !145, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sameobjecterr", scope: !364, file: !3, line: 520, baseType: !145, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "outofrangeerr", scope: !364, file: !3, line: 521, baseType: !145, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "plus", scope: !364, file: !3, line: 521, baseType: !145, size: 64, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "select0", scope: !364, file: !3, line: 522, baseType: !145, size: 64, offset: 1216)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "select1", scope: !364, file: !3, line: 522, baseType: !145, size: 64, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "select2", scope: !364, file: !3, line: 522, baseType: !145, size: 64, offset: 1344)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "select3", scope: !364, file: !3, line: 522, baseType: !145, size: 64, offset: 1408)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "select4", scope: !364, file: !3, line: 522, baseType: !145, size: 64, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "select5", scope: !364, file: !3, line: 523, baseType: !145, size: 64, offset: 1536)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "select6", scope: !364, file: !3, line: 523, baseType: !145, size: 64, offset: 1600)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "select7", scope: !364, file: !3, line: 523, baseType: !145, size: 64, offset: 1664)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "select8", scope: !364, file: !3, line: 523, baseType: !145, size: 64, offset: 1728)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "select9", scope: !364, file: !3, line: 523, baseType: !145, size: 64, offset: 1792)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "messagebulk", scope: !364, file: !3, line: 524, baseType: !145, size: 64, offset: 1856)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pmessagebulk", scope: !364, file: !3, line: 524, baseType: !145, size: 64, offset: 1920)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "subscribebulk", scope: !364, file: !3, line: 524, baseType: !145, size: 64, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "unsubscribebulk", scope: !364, file: !3, line: 524, baseType: !145, size: 64, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mbulk3", scope: !364, file: !3, line: 524, baseType: !145, size: 64, offset: 2112)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mbulk4", scope: !364, file: !3, line: 525, baseType: !145, size: 64, offset: 2176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "psubscribebulk", scope: !364, file: !3, line: 525, baseType: !145, size: 64, offset: 2240)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "punsubscribebulk", scope: !364, file: !3, line: 525, baseType: !145, size: 64, offset: 2304)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "integers", scope: !364, file: !3, line: 526, baseType: !404, size: 640000, offset: 2368)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 640000, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 10000)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "setDictType", scope: !2, file: !3, line: 1175, type: !93, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "zsetDictType", scope: !2, file: !3, line: 1185, type: !93, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "R_NegInf", scope: !2, file: !3, line: 533, type: !168, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "R_PosInf", scope: !2, file: !3, line: 533, type: !168, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "R_Nan", scope: !2, file: !3, line: 533, type: !168, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "hashDictType", scope: !2, file: !3, line: 1215, type: !93, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "cmdTable", scope: !2, file: !3, line: 749, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 41088, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 107)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "strencoding", scope: !2, file: !3, line: 132, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !252)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "R_Zero", scope: !2, file: !3, line: 533, type: !168, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "symsTable", scope: !2, file: !431, line: 1, type: !432, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "./staticsymbols.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "70d107934b1e769d0d9cd9246489e390")
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 45824, elements: !437)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisFunctionSym", file: !3, line: 475, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !3, line: 476, baseType: !47, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !433, file: !3, line: 477, baseType: !55, size: 64, offset: 64)
!437 = !{!438}
!438 = !DISubrange(count: 358)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dbDictType", scope: !2, file: !3, line: 1195, type: !93, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "keyptrDictType", scope: !2, file: !3, line: 1205, type: !93, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "keylistDictType", scope: !2, file: !3, line: 1227, type: !93, isLocal: true, isDefinition: true)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisServer", file: !3, line: 344, size: 7872, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !460, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !542, !543, !544, !545, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !668, !669, !670, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mainthread", scope: !445, file: !3, line: 345, baseType: !56, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !445, file: !3, line: 346, baseType: !45, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !445, file: !3, line: 347, baseType: !45, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !445, file: !3, line: 348, baseType: !293, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !445, file: !3, line: 349, baseType: !54, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_before_bgsave", scope: !445, file: !3, line: 350, baseType: !54, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !445, file: !3, line: 351, baseType: !58, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "slaves", scope: !445, file: !3, line: 352, baseType: !58, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !445, file: !3, line: 352, baseType: !58, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "neterr", scope: !445, file: !3, line: 353, baseType: !457, size: 2048, offset: 512)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "el", scope: !445, file: !3, line: 354, baseType: !461, size: 64, offset: 2560)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !463, line: 98, baseType: !464)
!463 = !DIFile(filename: "./ae.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "51650c7e83e254786f74107a47ea513a")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !463, line: 89, size: 3277184, elements: !465)
!465 = !{!466, !467, !468, !484, !491, !512, !513, !514}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !464, file: !463, line: 90, baseType: !45, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !464, file: !463, line: 91, baseType: !54, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !464, file: !463, line: 92, baseType: !469, size: 2621440, offset: 128)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 2621440, elements: !482)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !463, line: 69, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !463, line: 64, size: 256, elements: !472)
!472 = !{!473, !474, !480, !481}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !471, file: !463, line: 65, baseType: !45, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !471, file: !463, line: 66, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !463, line: 58, baseType: !477)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !479, !45, !46, !45}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !471, file: !463, line: 67, baseType: !475, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !471, file: !463, line: 68, baseType: !46, size: 64, offset: 192)
!482 = !{!483}
!483 = !DISubrange(count: 10240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !464, file: !463, line: 93, baseType: !485, size: 655360, offset: 2621568)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 655360, elements: !482)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !463, line: 86, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !463, line: 83, size: 64, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !487, file: !463, line: 84, baseType: !45, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !487, file: !463, line: 85, baseType: !45, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !464, file: !463, line: 94, baseType: !492, size: 64, offset: 3276928)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !463, line: 80, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !463, line: 72, size: 448, elements: !495)
!495 = !{!496, !497, !498, !499, !504, !509, !510}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !494, file: !463, line: 73, baseType: !54, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !494, file: !463, line: 74, baseType: !53, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !494, file: !463, line: 75, baseType: !53, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !494, file: !463, line: 76, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !463, line: 59, baseType: !502)
!502 = !DISubroutineType(types: !503)
!503 = !{!45, !479, !54, !46}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !494, file: !463, line: 77, baseType: !505, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !463, line: 60, baseType: !507)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !479, !46}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !494, file: !463, line: 78, baseType: !46, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !463, line: 79, baseType: !511, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !464, file: !463, line: 95, baseType: !45, size: 32, offset: 3276992)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !464, file: !463, line: 96, baseType: !46, size: 64, offset: 3277056)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !464, file: !463, line: 97, baseType: !515, size: 64, offset: 3277120)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !463, line: 61, baseType: !517)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !479}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cronloops", scope: !445, file: !3, line: 355, baseType: !45, size: 32, offset: 2624)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "objfreelist", scope: !445, file: !3, line: 356, baseType: !58, size: 64, offset: 2688)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lastsave", scope: !445, file: !3, line: 357, baseType: !49, size: 64, offset: 2752)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "stat_starttime", scope: !445, file: !3, line: 359, baseType: !49, size: 64, offset: 2816)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numcommands", scope: !445, file: !3, line: 360, baseType: !54, size: 64, offset: 2880)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stat_numconnections", scope: !445, file: !3, line: 361, baseType: !54, size: 64, offset: 2944)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stat_expiredkeys", scope: !445, file: !3, line: 362, baseType: !54, size: 64, offset: 3008)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !445, file: !3, line: 364, baseType: !45, size: 32, offset: 3072)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "glueoutputbuf", scope: !445, file: !3, line: 365, baseType: !45, size: 32, offset: 3104)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "maxidletime", scope: !445, file: !3, line: 366, baseType: !45, size: 32, offset: 3136)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dbnum", scope: !445, file: !3, line: 367, baseType: !45, size: 32, offset: 3168)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "daemonize", scope: !445, file: !3, line: 368, baseType: !45, size: 32, offset: 3200)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "appendonly", scope: !445, file: !3, line: 369, baseType: !45, size: 32, offset: 3232)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "appendfsync", scope: !445, file: !3, line: 370, baseType: !45, size: 32, offset: 3264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_asap", scope: !445, file: !3, line: 371, baseType: !45, size: 32, offset: 3296)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lastfsync", scope: !445, file: !3, line: 372, baseType: !49, size: 64, offset: 3328)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "appendfd", scope: !445, file: !3, line: 373, baseType: !45, size: 32, offset: 3392)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "appendseldb", scope: !445, file: !3, line: 374, baseType: !45, size: 32, offset: 3424)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !445, file: !3, line: 375, baseType: !47, size: 64, offset: 3456)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bgsavechildpid", scope: !445, file: !3, line: 376, baseType: !539, size: 32, offset: 3520)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !540, line: 97, baseType: !541)
!540 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "20e2108af45064f5c7b77fc9416f0cce")
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !52, line: 154, baseType: !45)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bgrewritechildpid", scope: !445, file: !3, line: 377, baseType: !539, size: 32, offset: 3552)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bgrewritebuf", scope: !445, file: !3, line: 378, baseType: !165, size: 64, offset: 3584)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "aofbuf", scope: !445, file: !3, line: 379, baseType: !165, size: 64, offset: 3648)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "saveparams", scope: !445, file: !3, line: 380, baseType: !546, size: 64, offset: 3712)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "saveparam", file: !3, line: 338, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !547, file: !3, line: 339, baseType: !49, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "changes", scope: !547, file: !3, line: 340, baseType: !45, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "saveparamslen", scope: !445, file: !3, line: 381, baseType: !45, size: 32, offset: 3776)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "logfile", scope: !445, file: !3, line: 382, baseType: !47, size: 64, offset: 3840)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bindaddr", scope: !445, file: !3, line: 383, baseType: !47, size: 64, offset: 3904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dbfilename", scope: !445, file: !3, line: 384, baseType: !47, size: 64, offset: 3968)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "appendfilename", scope: !445, file: !3, line: 385, baseType: !47, size: 64, offset: 4032)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "requirepass", scope: !445, file: !3, line: 386, baseType: !47, size: 64, offset: 4096)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rdbcompression", scope: !445, file: !3, line: 387, baseType: !45, size: 32, offset: 4160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "activerehashing", scope: !445, file: !3, line: 388, baseType: !45, size: 32, offset: 4192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "isslave", scope: !445, file: !3, line: 390, baseType: !45, size: 32, offset: 4224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "masterauth", scope: !445, file: !3, line: 391, baseType: !47, size: 64, offset: 4288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "masterhost", scope: !445, file: !3, line: 392, baseType: !47, size: 64, offset: 4352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "masterport", scope: !445, file: !3, line: 393, baseType: !45, size: 32, offset: 4416)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !445, file: !3, line: 394, baseType: !287, size: 64, offset: 4480)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "replstate", scope: !445, file: !3, line: 395, baseType: !45, size: 32, offset: 4544)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "maxclients", scope: !445, file: !3, line: 396, baseType: !7, size: 32, offset: 4576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "maxmemory", scope: !445, file: !3, line: 397, baseType: !170, size: 64, offset: 4608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "blpop_blocked_clients", scope: !445, file: !3, line: 398, baseType: !7, size: 32, offset: 4672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vm_blocked_clients", scope: !445, file: !3, line: 399, baseType: !7, size: 32, offset: 4704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sort_desc", scope: !445, file: !3, line: 402, baseType: !45, size: 32, offset: 4736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sort_alpha", scope: !445, file: !3, line: 403, baseType: !45, size: 32, offset: 4768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sort_bypattern", scope: !445, file: !3, line: 404, baseType: !45, size: 32, offset: 4800)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vm_enabled", scope: !445, file: !3, line: 406, baseType: !45, size: 32, offset: 4832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vm_swap_file", scope: !445, file: !3, line: 407, baseType: !47, size: 64, offset: 4864)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_size", scope: !445, file: !3, line: 408, baseType: !160, size: 64, offset: 4928)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pages", scope: !445, file: !3, line: 409, baseType: !160, size: 64, offset: 4992)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vm_max_memory", scope: !445, file: !3, line: 410, baseType: !170, size: 64, offset: 5056)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hash_max_zipmap_entries", scope: !445, file: !3, line: 412, baseType: !196, size: 64, offset: 5120)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hash_max_zipmap_value", scope: !445, file: !3, line: 413, baseType: !196, size: 64, offset: 5184)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "vm_fp", scope: !445, file: !3, line: 415, baseType: !580, size: 64, offset: 5248)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !582, line: 7, baseType: !583)
!582 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !584, line: 49, size: 1728, elements: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !601, !603, !604, !605, !607, !608, !609, !613, !616, !617, !620, !623, !624, !625, !626, !627}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !583, file: !584, line: 51, baseType: !45, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !583, file: !584, line: 54, baseType: !47, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !583, file: !584, line: 55, baseType: !47, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !583, file: !584, line: 56, baseType: !47, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !583, file: !584, line: 57, baseType: !47, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !583, file: !584, line: 58, baseType: !47, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !583, file: !584, line: 59, baseType: !47, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !583, file: !584, line: 60, baseType: !47, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !583, file: !584, line: 61, baseType: !47, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !583, file: !584, line: 64, baseType: !47, size: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !583, file: !584, line: 65, baseType: !47, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !583, file: !584, line: 66, baseType: !47, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !583, file: !584, line: 68, baseType: !599, size: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !584, line: 36, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !583, file: !584, line: 70, baseType: !602, size: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !583, file: !584, line: 72, baseType: !45, size: 32, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !583, file: !584, line: 73, baseType: !45, size: 32, offset: 928)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !583, file: !584, line: 74, baseType: !606, size: 64, offset: 960)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 152, baseType: !53)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !583, file: !584, line: 77, baseType: !169, size: 16, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !583, file: !584, line: 78, baseType: !44, size: 8, offset: 1040)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !583, file: !584, line: 79, baseType: !610, size: 8, offset: 1048)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !583, file: !584, line: 81, baseType: !614, size: 64, offset: 1088)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !584, line: 43, baseType: null)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !583, file: !584, line: 89, baseType: !162, size: 64, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !583, file: !584, line: 91, baseType: !618, size: 64, offset: 1216)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !584, line: 37, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !583, file: !584, line: 92, baseType: !621, size: 64, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !584, line: 38, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !583, file: !584, line: 93, baseType: !602, size: 64, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !583, file: !584, line: 94, baseType: !46, size: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !583, file: !584, line: 95, baseType: !196, size: 64, offset: 1472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !583, file: !584, line: 96, baseType: !45, size: 32, offset: 1536)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !583, file: !584, line: 98, baseType: !628, size: 160, offset: 1568)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 20)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vm_fd", scope: !445, file: !3, line: 416, baseType: !45, size: 32, offset: 5312)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next_page", scope: !445, file: !3, line: 417, baseType: !160, size: 64, offset: 5376)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vm_near_pages", scope: !445, file: !3, line: 418, baseType: !160, size: 64, offset: 5440)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "vm_bitmap", scope: !445, file: !3, line: 419, baseType: !167, size: 64, offset: 5504)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "unixtime", scope: !445, file: !3, line: 420, baseType: !49, size: 64, offset: 5568)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "io_newjobs", scope: !445, file: !3, line: 425, baseType: !58, size: 64, offset: 5632)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "io_processing", scope: !445, file: !3, line: 426, baseType: !58, size: 64, offset: 5696)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "io_processed", scope: !445, file: !3, line: 427, baseType: !58, size: 64, offset: 5760)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "io_ready_clients", scope: !445, file: !3, line: 428, baseType: !58, size: 64, offset: 5824)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "io_mutex", scope: !445, file: !3, line: 429, baseType: !641, size: 320, offset: 5888)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !57, line: 72, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !57, line: 67, size: 320, elements: !643)
!643 = !{!644, !663, !667}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !642, file: !57, line: 69, baseType: !645, size: 320)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !646, line: 22, size: 320, elements: !647)
!646 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !645, file: !646, line: 24, baseType: !45, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !645, file: !646, line: 25, baseType: !7, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !645, file: !646, line: 26, baseType: !45, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !645, file: !646, line: 28, baseType: !7, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !645, file: !646, line: 32, baseType: !45, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !645, file: !646, line: 34, baseType: !142, size: 16, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !645, file: !646, line: 35, baseType: !142, size: 16, offset: 176)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !645, file: !646, line: 36, baseType: !656, size: 128, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !657, line: 53, baseType: !658)
!657 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !657, line: 49, size: 128, elements: !659)
!659 = !{!660, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !658, file: !657, line: 51, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !658, file: !657, line: 52, baseType: !661, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !642, file: !57, line: 70, baseType: !664, size: 320)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 320, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 40)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !642, file: !57, line: 71, baseType: !53, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "obj_freelist_mutex", scope: !445, file: !3, line: 430, baseType: !641, size: 320, offset: 6208)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "io_swapfile_mutex", scope: !445, file: !3, line: 431, baseType: !641, size: 320, offset: 6528)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "io_threads_attr", scope: !445, file: !3, line: 432, baseType: !671, size: 448, offset: 6848)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !57, line: 62, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !57, line: 56, size: 448, elements: !673)
!673 = !{!674, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !672, file: !57, line: 58, baseType: !675, size: 448)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 448, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 56)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !672, file: !57, line: 59, baseType: !53, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "io_active_threads", scope: !445, file: !3, line: 433, baseType: !45, size: 32, offset: 7296)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vm_max_threads", scope: !445, file: !3, line: 434, baseType: !45, size: 32, offset: 7328)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "io_ready_pipe_read", scope: !445, file: !3, line: 439, baseType: !45, size: 32, offset: 7360)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "io_ready_pipe_write", scope: !445, file: !3, line: 440, baseType: !45, size: 32, offset: 7392)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vm_stats_used_pages", scope: !445, file: !3, line: 442, baseType: !170, size: 64, offset: 7424)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vm_stats_swapped_objects", scope: !445, file: !3, line: 443, baseType: !170, size: 64, offset: 7488)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vm_stats_swapouts", scope: !445, file: !3, line: 444, baseType: !170, size: 64, offset: 7552)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vm_stats_swapins", scope: !445, file: !3, line: 445, baseType: !170, size: 64, offset: 7616)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_channels", scope: !445, file: !3, line: 447, baseType: !86, size: 64, offset: 7680)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_patterns", scope: !445, file: !3, line: 448, baseType: !58, size: 64, offset: 7744)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "devnull", scope: !445, file: !3, line: 450, baseType: !580, size: 64, offset: 7808)
!690 = !{i32 7, !"Dwarf Version", i32 5}
!691 = !{i32 2, !"Debug Info Version", i32 3}
!692 = !{i32 1, !"wchar_size", i32 4}
!693 = !{i32 7, !"uwtable", i32 1}
!694 = !{!"clang version 14.0.0"}
!695 = distinct !DISubprogram(name: "backgroundSaveDoneHandler", scope: !3, file: !3, line: 1317, type: !202, scopeLine: 1317, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !696)
!696 = !{!697, !698, !699}
!697 = !DILocalVariable(name: "statloc", arg: 1, scope: !695, file: !3, line: 1317, type: !45)
!698 = !DILocalVariable(name: "exitcode", scope: !695, file: !3, line: 1318, type: !45)
!699 = !DILocalVariable(name: "bysignal", scope: !695, file: !3, line: 1319, type: !45)
!700 = !DILocation(line: 0, scope: !695)
!701 = !DILocation(line: 1318, column: 20, scope: !695)
!702 = !DILocation(line: 1319, column: 20, scope: !695)
!703 = !DILocation(line: 1321, column: 19, scope: !704)
!704 = distinct !DILexicalBlock(scope: !695, file: !3, line: 1321, column: 9)
!705 = !DILocation(line: 1322, column: 9, scope: !706)
!706 = distinct !DILexicalBlock(scope: !704, file: !3, line: 1321, column: 37)
!707 = !DILocation(line: 1324, column: 31, scope: !706)
!708 = !{!709, !715, i64 24}
!709 = !{!"redisServer", !710, i64 0, !713, i64 8, !713, i64 12, !714, i64 16, !715, i64 24, !715, i64 32, !714, i64 40, !714, i64 48, !714, i64 56, !711, i64 64, !714, i64 320, !713, i64 328, !714, i64 336, !710, i64 344, !710, i64 352, !715, i64 360, !715, i64 368, !715, i64 376, !713, i64 384, !713, i64 388, !713, i64 392, !713, i64 396, !713, i64 400, !713, i64 404, !713, i64 408, !713, i64 412, !710, i64 416, !713, i64 424, !713, i64 428, !714, i64 432, !713, i64 440, !713, i64 444, !714, i64 448, !714, i64 456, !714, i64 464, !713, i64 472, !714, i64 480, !714, i64 488, !714, i64 496, !714, i64 504, !714, i64 512, !713, i64 520, !713, i64 524, !713, i64 528, !714, i64 536, !714, i64 544, !713, i64 552, !714, i64 560, !713, i64 568, !713, i64 572, !715, i64 576, !713, i64 584, !713, i64 588, !713, i64 592, !713, i64 596, !713, i64 600, !713, i64 604, !714, i64 608, !710, i64 616, !710, i64 624, !715, i64 632, !710, i64 640, !710, i64 648, !714, i64 656, !713, i64 664, !710, i64 672, !710, i64 680, !714, i64 688, !710, i64 696, !714, i64 704, !714, i64 712, !714, i64 720, !714, i64 728, !711, i64 736, !711, i64 776, !711, i64 816, !711, i64 856, !713, i64 912, !713, i64 916, !713, i64 920, !713, i64 924, !715, i64 928, !715, i64 936, !715, i64 944, !715, i64 952, !714, i64 960, !714, i64 968, !714, i64 976}
!710 = !{!"long", !711, i64 0}
!711 = !{!"omnipotent char", !712, i64 0}
!712 = !{!"Simple C/C++ TBAA"}
!713 = !{!"int", !711, i64 0}
!714 = !{!"any pointer", !711, i64 0}
!715 = !{!"long long", !711, i64 0}
!716 = !DILocation(line: 1324, column: 46, scope: !706)
!717 = !{!709, !715, i64 32}
!718 = !DILocation(line: 1324, column: 37, scope: !706)
!719 = !DILocation(line: 1324, column: 22, scope: !706)
!720 = !DILocation(line: 1325, column: 27, scope: !706)
!721 = !DILocation(line: 1325, column: 25, scope: !706)
!722 = !{!709, !710, i64 344}
!723 = !DILocation(line: 1326, column: 5, scope: !706)
!724 = !DILocation(line: 1326, column: 26, scope: !725)
!725 = distinct !DILexicalBlock(scope: !704, file: !3, line: 1326, column: 16)
!726 = !DILocation(line: 1327, column: 9, scope: !727)
!727 = distinct !DILexicalBlock(scope: !725, file: !3, line: 1326, column: 44)
!728 = !DILocation(line: 1328, column: 5, scope: !727)
!729 = !DILocation(line: 1329, column: 9, scope: !730)
!730 = distinct !DILexicalBlock(scope: !725, file: !3, line: 1328, column: 12)
!731 = !DILocation(line: 1331, column: 34, scope: !730)
!732 = !{!709, !713, i64 440}
!733 = !DILocation(line: 1331, column: 9, scope: !730)
!734 = !DILocation(line: 1333, column: 27, scope: !695)
!735 = !DILocation(line: 1336, column: 31, scope: !695)
!736 = !DILocation(line: 1336, column: 5, scope: !695)
!737 = !DILocation(line: 1337, column: 1, scope: !695)
!738 = distinct !DISubprogram(name: "redisLog", scope: !3, file: !3, line: 1059, type: !739, scopeLine: 1059, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !743)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !45, !741, null}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!743 = !{!744, !745, !746, !759, !760, !761, !765}
!744 = !DILocalVariable(name: "level", arg: 1, scope: !738, file: !3, line: 1059, type: !45)
!745 = !DILocalVariable(name: "fmt", arg: 2, scope: !738, file: !3, line: 1059, type: !741)
!746 = !DILocalVariable(name: "ap", scope: !738, file: !3, line: 1060, type: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !161, line: 52, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !749, line: 32, baseType: !750)
!749 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stdarg.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !751, baseType: !752)
!751 = !DIFile(filename: "redis.c", directory: "/home/xuheng/blackbox/llvm-test/redis")
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 192, elements: !611)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !753, file: !751, line: 1060, baseType: !7, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !753, file: !751, line: 1060, baseType: !7, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !753, file: !751, line: 1060, baseType: !46, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !753, file: !751, line: 1060, baseType: !46, size: 64, offset: 128)
!759 = !DILocalVariable(name: "fp", scope: !738, file: !3, line: 1061, type: !580)
!760 = !DILocalVariable(name: "c", scope: !738, file: !3, line: 1062, type: !47)
!761 = !DILocalVariable(name: "buf", scope: !738, file: !3, line: 1063, type: !762)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 64)
!765 = !DILocalVariable(name: "now", scope: !738, file: !3, line: 1064, type: !49)
!766 = !DILocation(line: 0, scope: !738)
!767 = !DILocation(line: 1060, column: 5, scope: !738)
!768 = !DILocation(line: 1060, column: 13, scope: !738)
!769 = !DILocation(line: 1063, column: 5, scope: !738)
!770 = !DILocation(line: 1063, column: 10, scope: !738)
!771 = !DILocation(line: 1064, column: 5, scope: !738)
!772 = !DILocation(line: 1066, column: 24, scope: !773)
!773 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1066, column: 9)
!774 = !{!709, !713, i64 384}
!775 = !DILocation(line: 1066, column: 15, scope: !773)
!776 = !DILocation(line: 1066, column: 9, scope: !738)
!777 = !DILocation(line: 1068, column: 18, scope: !738)
!778 = !{!709, !714, i64 480}
!779 = !DILocation(line: 1068, column: 26, scope: !738)
!780 = !DILocation(line: 1068, column: 10, scope: !738)
!781 = !DILocation(line: 1068, column: 37, scope: !738)
!782 = !{!714, !714, i64 0}
!783 = !DILocation(line: 1068, column: 46, scope: !738)
!784 = !DILocation(line: 1069, column: 10, scope: !785)
!785 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1069, column: 9)
!786 = !DILocation(line: 1069, column: 9, scope: !738)
!787 = !DILocation(line: 1071, column: 5, scope: !738)
!788 = !DILocation(line: 1072, column: 11, scope: !738)
!789 = !DILocation(line: 1072, column: 9, scope: !738)
!790 = !{!710, !710, i64 0}
!791 = !DILocation(line: 1073, column: 38, scope: !738)
!792 = !DILocation(line: 1073, column: 5, scope: !738)
!793 = !DILocation(line: 1074, column: 35, scope: !738)
!794 = !DILocation(line: 1074, column: 48, scope: !738)
!795 = !{!711, !711, i64 0}
!796 = !DILocation(line: 1074, column: 5, scope: !738)
!797 = !DILocation(line: 1075, column: 5, scope: !738)
!798 = !DILocation(line: 1076, column: 5, scope: !738)
!799 = !DILocation(line: 1077, column: 5, scope: !738)
!800 = !DILocation(line: 1078, column: 5, scope: !738)
!801 = !DILocation(line: 1080, column: 16, scope: !802)
!802 = distinct !DILexicalBlock(scope: !738, file: !3, line: 1080, column: 9)
!803 = !DILocation(line: 1080, column: 9, scope: !802)
!804 = !DILocation(line: 1080, column: 9, scope: !738)
!805 = !DILocation(line: 1080, column: 25, scope: !802)
!806 = !DILocation(line: 1081, column: 1, scope: !738)
!807 = !DISubprogram(name: "time", scope: !808, file: !808, line: 75, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !812)
!808 = !DIFile(filename: "/usr/include/time.h", directory: "", checksumkind: CSK_MD5, checksum: "2dc9fb937b28c900f98919b5c35320c2")
!809 = !DISubroutineType(types: !810)
!810 = !{!49, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!812 = !{}
!813 = distinct !DISubprogram(name: "rdbRemoveTempFile", scope: !3, file: !3, line: 3819, type: !814, scopeLine: 3819, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !539}
!816 = !{!817, !818}
!817 = !DILocalVariable(name: "childpid", arg: 1, scope: !813, file: !3, line: 3819, type: !539)
!818 = !DILocalVariable(name: "tmpfile", scope: !813, file: !3, line: 3820, type: !457)
!819 = !DILocation(line: 0, scope: !813)
!820 = !DILocation(line: 3820, column: 5, scope: !813)
!821 = !DILocation(line: 3820, column: 10, scope: !813)
!822 = !DILocation(line: 3822, column: 5, scope: !813)
!823 = !DILocation(line: 3823, column: 5, scope: !813)
!824 = !DILocation(line: 3824, column: 1, scope: !813)
!825 = distinct !DISubprogram(name: "updateSlavesWaitingBgsave", scope: !3, file: !3, line: 7973, type: !202, scopeLine: 7973, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !826)
!826 = !{!827, !828, !829, !830, !836, !838, !875, !880}
!827 = !DILocalVariable(name: "bgsaveerr", arg: 1, scope: !825, file: !3, line: 7973, type: !45)
!828 = !DILocalVariable(name: "ln", scope: !825, file: !3, line: 7974, type: !64)
!829 = !DILocalVariable(name: "startbgsave", scope: !825, file: !3, line: 7975, type: !45)
!830 = !DILocalVariable(name: "li", scope: !825, file: !3, line: 7976, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "listIter", file: !60, line: 45, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listIter", file: !60, line: 42, size: 128, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !832, file: !60, line: 43, baseType: !64, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !832, file: !60, line: 44, baseType: !45, size: 32, offset: 64)
!836 = !DILocalVariable(name: "slave", scope: !837, file: !3, line: 7980, type: !287)
!837 = distinct !DILexicalBlock(scope: !825, file: !3, line: 7979, column: 33)
!838 = !DILocalVariable(name: "buf", scope: !839, file: !3, line: 7986, type: !842)
!839 = distinct !DILexicalBlock(scope: !840, file: !3, line: 7985, column: 68)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 7985, column: 20)
!841 = distinct !DILexicalBlock(scope: !837, file: !3, line: 7982, column: 13)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !843, line: 46, size: 1152, elements: !844)
!843 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!844 = !{!845, !847, !849, !851, !853, !855, !857, !858, !859, !860, !862, !864, !871, !872, !873}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !842, file: !843, line: 48, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !52, line: 145, baseType: !55)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !842, file: !843, line: 53, baseType: !848, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !52, line: 148, baseType: !55)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !842, file: !843, line: 61, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !52, line: 151, baseType: !55)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !842, file: !843, line: 62, baseType: !852, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !52, line: 150, baseType: !7)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !842, file: !843, line: 64, baseType: !854, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !52, line: 146, baseType: !7)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !842, file: !843, line: 65, baseType: !856, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !52, line: 147, baseType: !7)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !842, file: !843, line: 67, baseType: !45, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !842, file: !843, line: 69, baseType: !846, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !842, file: !843, line: 74, baseType: !606, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !842, file: !843, line: 78, baseType: !861, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !52, line: 174, baseType: !53)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !842, file: !843, line: 80, baseType: !863, size: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !52, line: 179, baseType: !53)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !842, file: !843, line: 91, baseType: !865, size: 128, offset: 576)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !866, line: 10, size: 128, elements: !867)
!866 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !865, file: !866, line: 12, baseType: !51, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !865, file: !866, line: 16, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !52, line: 196, baseType: !53)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !842, file: !843, line: 92, baseType: !865, size: 128, offset: 704)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !842, file: !843, line: 93, baseType: !865, size: 128, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !842, file: !843, line: 106, baseType: !874, size: 192, offset: 960)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 192, elements: !257)
!875 = !DILocalVariable(name: "li", scope: !876, file: !3, line: 8011, type: !831)
!876 = distinct !DILexicalBlock(scope: !877, file: !3, line: 8010, column: 63)
!877 = distinct !DILexicalBlock(scope: !878, file: !3, line: 8010, column: 13)
!878 = distinct !DILexicalBlock(scope: !879, file: !3, line: 8009, column: 22)
!879 = distinct !DILexicalBlock(scope: !825, file: !3, line: 8009, column: 9)
!880 = !DILocalVariable(name: "slave", scope: !881, file: !3, line: 8016, type: !287)
!881 = distinct !DILexicalBlock(scope: !876, file: !3, line: 8015, column: 41)
!882 = !DILocation(line: 0, scope: !825)
!883 = !DILocation(line: 7976, column: 5, scope: !825)
!884 = !DILocation(line: 7976, column: 14, scope: !825)
!885 = !DILocation(line: 7978, column: 23, scope: !825)
!886 = !{!709, !714, i64 48}
!887 = !DILocation(line: 7978, column: 5, scope: !825)
!888 = !DILocation(line: 7979, column: 17, scope: !825)
!889 = !DILocation(line: 7979, column: 5, scope: !825)
!890 = !DILocation(line: 7980, column: 34, scope: !837)
!891 = !{!892, !714, i64 16}
!892 = !{!"listNode", !714, i64 0, !714, i64 8, !714, i64 16}
!893 = !DILocation(line: 7980, column: 30, scope: !837)
!894 = !DILocation(line: 0, scope: !837)
!895 = !DILocation(line: 7982, column: 20, scope: !841)
!896 = !{!897, !713, i64 100}
!897 = !{!"redisClient", !713, i64 0, !714, i64 8, !713, i64 16, !714, i64 24, !714, i64 32, !714, i64 40, !713, i64 48, !713, i64 52, !713, i64 56, !713, i64 60, !714, i64 64, !713, i64 72, !710, i64 80, !713, i64 88, !713, i64 92, !713, i64 96, !713, i64 100, !713, i64 104, !710, i64 112, !710, i64 120, !898, i64 128, !714, i64 144, !713, i64 152, !710, i64 160, !714, i64 168, !714, i64 176, !714, i64 184}
!898 = !{!"multiState", !714, i64 0, !713, i64 8}
!899 = !DILocation(line: 7982, column: 13, scope: !837)
!900 = !DILocation(line: 7984, column: 30, scope: !901)
!901 = distinct !DILexicalBlock(scope: !841, file: !3, line: 7982, column: 63)
!902 = !DILocation(line: 7985, column: 9, scope: !901)
!903 = !DILocation(line: 7986, column: 13, scope: !839)
!904 = !DILocation(line: 7986, column: 31, scope: !839)
!905 = !DILocation(line: 7988, column: 17, scope: !839)
!906 = !DILocation(line: 7989, column: 17, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 7988, column: 40)
!908 = distinct !DILexicalBlock(scope: !839, file: !3, line: 7988, column: 17)
!909 = !DILocation(line: 7990, column: 17, scope: !907)
!910 = !DILocation(line: 8007, column: 9, scope: !840)
!911 = !DILocation(line: 7993, column: 48, scope: !912)
!912 = distinct !DILexicalBlock(scope: !839, file: !3, line: 7993, column: 17)
!913 = !{!709, !714, i64 496}
!914 = !DILocation(line: 7993, column: 36, scope: !912)
!915 = !DILocation(line: 7993, column: 25, scope: !912)
!916 = !DILocation(line: 7993, column: 34, scope: !912)
!917 = !{!897, !713, i64 104}
!918 = !DILocation(line: 7993, column: 70, scope: !912)
!919 = !DILocation(line: 7993, column: 76, scope: !912)
!920 = !DILocation(line: 7994, column: 17, scope: !912)
!921 = !DILocation(line: 7994, column: 51, scope: !912)
!922 = !DILocation(line: 7993, column: 17, scope: !839)
!923 = !DILocation(line: 7995, column: 17, scope: !924)
!924 = distinct !DILexicalBlock(scope: !912, file: !3, line: 7994, column: 58)
!925 = !DILocation(line: 7996, column: 101, scope: !924)
!926 = !{!713, !713, i64 0}
!927 = !DILocation(line: 7996, column: 92, scope: !924)
!928 = !DILocation(line: 7996, column: 17, scope: !924)
!929 = !DILocation(line: 7999, column: 20, scope: !839)
!930 = !DILocation(line: 7999, column: 30, scope: !839)
!931 = !{!897, !710, i64 112}
!932 = !DILocation(line: 8000, column: 37, scope: !839)
!933 = !{!934, !710, i64 48}
!934 = !{!"stat", !710, i64 0, !710, i64 8, !710, i64 16, !713, i64 24, !713, i64 28, !713, i64 32, !713, i64 36, !710, i64 40, !710, i64 48, !710, i64 56, !710, i64 64, !935, i64 72, !935, i64 88, !935, i64 104, !711, i64 120}
!935 = !{!"timespec", !710, i64 0, !710, i64 8}
!936 = !DILocation(line: 8000, column: 20, scope: !839)
!937 = !DILocation(line: 8000, column: 31, scope: !839)
!938 = !{!897, !710, i64 120}
!939 = !DILocation(line: 8001, column: 30, scope: !839)
!940 = !DILocation(line: 8002, column: 38, scope: !839)
!941 = !{!709, !714, i64 320}
!942 = !DILocation(line: 8002, column: 48, scope: !839)
!943 = !{!897, !713, i64 0}
!944 = !DILocation(line: 8002, column: 13, scope: !839)
!945 = !DILocation(line: 8003, column: 42, scope: !946)
!946 = distinct !DILexicalBlock(scope: !839, file: !3, line: 8003, column: 17)
!947 = !DILocation(line: 8003, column: 53, scope: !946)
!948 = !DILocation(line: 8003, column: 17, scope: !946)
!949 = !DILocation(line: 8003, column: 94, scope: !946)
!950 = !DILocation(line: 8003, column: 17, scope: !839)
!951 = !DILocation(line: 8004, column: 17, scope: !952)
!952 = distinct !DILexicalBlock(scope: !946, file: !3, line: 8003, column: 105)
!953 = !DILocation(line: 8009, column: 9, scope: !879)
!954 = !DILocation(line: 8009, column: 9, scope: !825)
!955 = !DILocation(line: 8010, column: 38, scope: !877)
!956 = !DILocation(line: 8010, column: 13, scope: !877)
!957 = !DILocation(line: 8010, column: 50, scope: !877)
!958 = !DILocation(line: 8010, column: 13, scope: !878)
!959 = !DILocation(line: 8011, column: 13, scope: !876)
!960 = !DILocation(line: 8011, column: 22, scope: !876)
!961 = !DILocation(line: 8013, column: 31, scope: !876)
!962 = !DILocation(line: 8013, column: 13, scope: !876)
!963 = !DILocation(line: 8014, column: 13, scope: !876)
!964 = !DILocation(line: 8015, column: 25, scope: !876)
!965 = !DILocation(line: 8015, column: 13, scope: !876)
!966 = !DILocation(line: 8016, column: 42, scope: !881)
!967 = !DILocation(line: 0, scope: !881)
!968 = !DILocation(line: 8018, column: 28, scope: !969)
!969 = distinct !DILexicalBlock(scope: !881, file: !3, line: 8018, column: 21)
!970 = !DILocation(line: 8018, column: 38, scope: !969)
!971 = !DILocation(line: 8018, column: 21, scope: !881)
!972 = !DILocation(line: 8019, column: 21, scope: !969)
!973 = distinct !{!973, !965, !974}
!974 = !DILocation(line: 8020, column: 13, scope: !876)
!975 = !DILocation(line: 8021, column: 9, scope: !877)
!976 = !DILocation(line: 8021, column: 9, scope: !876)
!977 = !DILocation(line: 8023, column: 1, scope: !825)
!978 = distinct !DISubprogram(name: "backgroundRewriteDoneHandler", scope: !3, file: !3, line: 1341, type: !202, scopeLine: 1341, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !979)
!979 = !{!980, !981, !982, !983, !986, !987}
!980 = !DILocalVariable(name: "statloc", arg: 1, scope: !978, file: !3, line: 1341, type: !45)
!981 = !DILocalVariable(name: "exitcode", scope: !978, file: !3, line: 1342, type: !45)
!982 = !DILocalVariable(name: "bysignal", scope: !978, file: !3, line: 1343, type: !45)
!983 = !DILocalVariable(name: "fd", scope: !984, file: !3, line: 1346, type: !45)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 1345, column: 37)
!985 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1345, column: 9)
!986 = !DILocalVariable(name: "tmpfile", scope: !984, file: !3, line: 1347, type: !457)
!987 = !DILabel(scope: !978, name: "cleanup", file: !3, line: 1394)
!988 = !DILocation(line: 0, scope: !978)
!989 = !DILocation(line: 1342, column: 20, scope: !978)
!990 = !DILocation(line: 1343, column: 20, scope: !978)
!991 = !DILocation(line: 1345, column: 19, scope: !985)
!992 = !DILocation(line: 1347, column: 9, scope: !984)
!993 = !DILocation(line: 1347, column: 14, scope: !984)
!994 = !DILocation(line: 1349, column: 9, scope: !984)
!995 = !DILocation(line: 1352, column: 72, scope: !984)
!996 = !{!709, !713, i64 444}
!997 = !DILocation(line: 1352, column: 9, scope: !984)
!998 = !DILocation(line: 1353, column: 14, scope: !984)
!999 = !DILocation(line: 0, scope: !984)
!1000 = !DILocation(line: 1354, column: 16, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1354, column: 13)
!1002 = !DILocation(line: 1354, column: 13, scope: !984)
!1003 = !DILocation(line: 1355, column: 118, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 1354, column: 23)
!1005 = !DILocation(line: 1355, column: 109, scope: !1004)
!1006 = !DILocation(line: 1355, column: 13, scope: !1004)
!1007 = !DILocation(line: 1356, column: 13, scope: !1004)
!1008 = !DILocation(line: 1359, column: 29, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1359, column: 13)
!1010 = !{!709, !714, i64 448}
!1011 = !DILocation(line: 1359, column: 42, scope: !1009)
!1012 = !DILocation(line: 1359, column: 13, scope: !1009)
!1013 = !DILocation(line: 1360, column: 40, scope: !1009)
!1014 = !DILocation(line: 1360, column: 26, scope: !1009)
!1015 = !DILocation(line: 1360, column: 17, scope: !1009)
!1016 = !DILocation(line: 1359, column: 71, scope: !1009)
!1017 = !DILocation(line: 1359, column: 13, scope: !984)
!1018 = !DILocation(line: 1361, column: 152, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 1360, column: 55)
!1020 = !DILocation(line: 1361, column: 143, scope: !1019)
!1021 = !DILocation(line: 1361, column: 13, scope: !1019)
!1022 = !DILocation(line: 1362, column: 13, scope: !1019)
!1023 = !DILocation(line: 1363, column: 13, scope: !1019)
!1024 = !DILocation(line: 1365, column: 121, scope: !984)
!1025 = !DILocation(line: 1365, column: 107, scope: !984)
!1026 = !DILocation(line: 1365, column: 9, scope: !984)
!1027 = !DILocation(line: 1368, column: 35, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1368, column: 13)
!1029 = !{!709, !714, i64 504}
!1030 = !DILocation(line: 1368, column: 13, scope: !1028)
!1031 = !DILocation(line: 1368, column: 51, scope: !1028)
!1032 = !DILocation(line: 1368, column: 13, scope: !984)
!1033 = !DILocation(line: 1369, column: 111, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1368, column: 58)
!1035 = !DILocation(line: 1369, column: 102, scope: !1034)
!1036 = !DILocation(line: 1369, column: 13, scope: !1034)
!1037 = !DILocation(line: 1370, column: 13, scope: !1034)
!1038 = !DILocation(line: 1371, column: 13, scope: !1034)
!1039 = !DILocation(line: 1374, column: 9, scope: !984)
!1040 = !DILocation(line: 1375, column: 20, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !984, file: !3, line: 1375, column: 13)
!1042 = !{!709, !713, i64 424}
!1043 = !DILocation(line: 1375, column: 29, scope: !1041)
!1044 = !DILocation(line: 1375, column: 13, scope: !984)
