; ModuleID = 'redis-cli.c'
source_filename = "redis-cli.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [10 x i8] c"127.0.0.1\00", align 1
@config.0 = internal unnamed_addr global i8* null, align 8, !dbg !0
@config.1 = internal unnamed_addr global i32 0, align 8, !dbg !59
@config.2 = internal unnamed_addr global i64 0, align 8, !dbg !60
@config.3 = internal unnamed_addr global i32 0, align 8, !dbg !61
@config.4 = internal unnamed_addr global i1 false, align 8, !dbg !62
@config.5 = internal unnamed_addr global i1 false, align 8, !dbg !63
@config.6 = internal unnamed_addr global i1 false, align 8, !dbg !64
@config.7 = internal unnamed_addr global i1 false, align 8, !dbg !65
@config.8 = internal unnamed_addr global i32 0, align 8, !dbg !66
@config.9 = internal unnamed_addr global i32 0, align 8, !dbg !67

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!1 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 67, type: !43, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "redis-cli.c", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "97a733d92f7d2e850c13ccff46a9f77c")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !23, !24, !27, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31, !32}
!31 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "fd", scope: !34, file: !3, line: 76, type: !23, isLocal: true, isDefinition: true)
!34 = distinct !DISubprogram(name: "cliConnect", scope: !3, file: !3, line: 74, type: !35, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !37)
!35 = !DISubroutineType(types: !36)
!36 = !{!23, !23}
!37 = !{!38, !39}
!38 = !DILocalVariable(name: "force", arg: 1, scope: !34, file: !3, line: 74, type: !23)
!39 = !DILocalVariable(name: "err", scope: !34, file: !3, line: 75, type: !40)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 256)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config", file: !3, line: 53, size: 576, elements: !44)
!44 = !{!45, !46, !47, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hostip", scope: !43, file: !3, line: 54, baseType: !25, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hostport", scope: !43, file: !3, line: 55, baseType: !23, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !43, file: !3, line: 56, baseType: !48, size: 64, offset: 128)
!48 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dbnum", scope: !43, file: !3, line: 57, baseType: !23, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !43, file: !3, line: 58, baseType: !23, size: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !43, file: !3, line: 59, baseType: !23, size: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "monitor_mode", scope: !43, file: !3, line: 60, baseType: !23, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pubsub_mode", scope: !43, file: !3, line: 61, baseType: !23, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "raw_output", scope: !43, file: !3, line: 62, baseType: !23, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tty", scope: !43, file: !3, line: 63, baseType: !23, size: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mb_sep", scope: !43, file: !3, line: 64, baseType: !26, size: 8, offset: 416)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !43, file: !3, line: 65, baseType: !25, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "historyfile", scope: !43, file: !3, line: 66, baseType: !25, size: 64, offset: 512)
!59 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 32))
!60 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 64))
!61 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 192, 32))
!62 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 224, 32))
!63 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 256, 32))
!64 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 288, 32))
!65 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 320, 32))
!66 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 352, 32))
!67 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 384, 32))
!68 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value, DW_OP_LLVM_fragment, 416, 8))
!69 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 448, 64))
!70 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 512, 64))
!71 = !{i32 7, !"Dwarf Version", i32 5}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{i32 1, !"wchar_size", i32 4}
!74 = !{i32 7, !"uwtable", i32 1}
!75 = !{!"clang version 14.0.0"}
!76 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 471, type: !77, scopeLine: 471, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{!23, !23, !24}
!79 = !{!80, !81, !82, !83, !89}
!80 = !DILocalVariable(name: "argc", arg: 1, scope: !76, file: !3, line: 471, type: !23)
!81 = !DILocalVariable(name: "argv", arg: 2, scope: !76, file: !3, line: 471, type: !24)
!82 = !DILocalVariable(name: "firstarg", scope: !76, file: !3, line: 472, type: !23)
!83 = !DILocalVariable(name: "authargv", scope: !84, file: !3, line: 499, type: !86)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 498, column: 30)
!85 = distinct !DILexicalBlock(scope: !76, file: !3, line: 498, column: 9)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 2)
!89 = !DILocalVariable(name: "dbnum", scope: !84, file: !3, line: 500, type: !23)
!90 = !DILocation(line: 0, scope: !76)
!91 = !DILocation(line: 474, column: 19, scope: !76)
!92 = !{!93, !94, i64 0}
!93 = !{!"config", !94, i64 0, !97, i64 8, !98, i64 16, !97, i64 24, !97, i64 28, !97, i64 32, !97, i64 36, !97, i64 40, !97, i64 44, !97, i64 48, !95, i64 52, !94, i64 56, !94, i64 64}
!94 = !{!"any pointer", !95, i64 0}
!95 = !{!"omnipotent char", !96, i64 0}
!96 = !{!"Simple C/C++ TBAA"}
!97 = !{!"int", !95, i64 0}
!98 = !{!"long", !95, i64 0}
!99 = !DILocation(line: 475, column: 21, scope: !76)
!100 = !{!93, !97, i64 8}
!101 = !DILocation(line: 476, column: 19, scope: !76)
!102 = !{!93, !98, i64 16}
!103 = !DILocation(line: 477, column: 18, scope: !76)
!104 = !{!93, !97, i64 24}
!105 = !DILocation(line: 478, column: 24, scope: !76)
!106 = !DILocation(line: 479, column: 21, scope: !76)
!107 = !DILocation(line: 480, column: 25, scope: !76)
!108 = !DILocation(line: 481, column: 24, scope: !76)
!109 = !DILocation(line: 482, column: 23, scope: !76)
!110 = !{!93, !97, i64 44}
!111 = !DILocation(line: 483, column: 17, scope: !76)
!112 = !{!93, !94, i64 56}
!113 = !DILocation(line: 484, column: 24, scope: !76)
!114 = !{!93, !94, i64 64}
!115 = !DILocation(line: 485, column: 32, scope: !76)
!116 = !{!94, !94, i64 0}
!117 = !DILocation(line: 485, column: 25, scope: !76)
!118 = !DILocation(line: 485, column: 18, scope: !76)
!119 = !DILocation(line: 485, column: 41, scope: !76)
!120 = !DILocation(line: 485, column: 45, scope: !76)
!121 = !DILocation(line: 485, column: 63, scope: !76)
!122 = !DILocation(line: 485, column: 16, scope: !76)
!123 = !{!93, !97, i64 48}
!124 = !DILocation(line: 486, column: 19, scope: !76)
!125 = !DILocation(line: 488, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !76, file: !3, line: 488, column: 9)
!127 = !DILocation(line: 488, column: 24, scope: !126)
!128 = !DILocation(line: 488, column: 9, scope: !76)
!129 = !DILocation(line: 489, column: 30, scope: !130)
!130 = distinct !DILexicalBlock(scope: !126, file: !3, line: 488, column: 33)
!131 = !DILocation(line: 489, column: 28, scope: !130)
!132 = !DILocation(line: 490, column: 64, scope: !130)
!133 = !DILocation(line: 490, column: 9, scope: !130)
!134 = !DILocation(line: 491, column: 37, scope: !130)
!135 = !DILocation(line: 491, column: 9, scope: !130)
!136 = !DILocation(line: 492, column: 5, scope: !130)
!137 = !DILocation(line: 494, column: 16, scope: !76)
!138 = !DILocation(line: 495, column: 10, scope: !76)
!139 = !DILocation(line: 498, column: 16, scope: !85)
!140 = !DILocation(line: 498, column: 21, scope: !85)
!141 = !DILocation(line: 498, column: 9, scope: !76)
!142 = !DILocation(line: 499, column: 9, scope: !84)
!143 = !DILocation(line: 499, column: 15, scope: !84)
!144 = !DILocation(line: 500, column: 28, scope: !84)
!145 = !DILocation(line: 0, scope: !84)
!146 = !DILocation(line: 505, column: 22, scope: !84)
!147 = !DILocation(line: 506, column: 9, scope: !84)
!148 = !DILocation(line: 506, column: 21, scope: !84)
!149 = !DILocation(line: 507, column: 9, scope: !84)
!150 = !DILocation(line: 507, column: 21, scope: !84)
!151 = !DILocation(line: 508, column: 27, scope: !84)
!152 = !DILocation(line: 508, column: 9, scope: !84)
!153 = !DILocation(line: 509, column: 22, scope: !84)
!154 = !DILocation(line: 510, column: 5, scope: !85)
!155 = !DILocation(line: 510, column: 5, scope: !84)
!156 = !DILocation(line: 513, column: 14, scope: !157)
!157 = distinct !DILexicalBlock(scope: !76, file: !3, line: 513, column: 9)
!158 = !DILocation(line: 513, column: 9, scope: !76)
!159 = !DILocation(line: 513, column: 20, scope: !157)
!160 = !DILocation(line: 496, column: 10, scope: !76)
!161 = !DILocation(line: 515, column: 32, scope: !76)
!162 = !DILocation(line: 515, column: 12, scope: !76)
!163 = !DILocation(line: 515, column: 5, scope: !76)
!164 = !DISubprogram(name: "isatty", scope: !165, file: !165, line: 779, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!165 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "29bea3f2d65ec3bb874f389bfdfa2266")
!166 = !{}
!167 = !DISubprogram(name: "fileno", scope: !168, file: !168, line: 786, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!169 = !DISubroutineType(types: !170)
!170 = !{!23, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !173, line: 7, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !175, line: 49, size: 1728, elements: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !194, !195, !196, !199, !200, !202, !206, !209, !211, !214, !217, !218, !219, !222, !223}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !175, line: 51, baseType: !23, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !175, line: 54, baseType: !25, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !175, line: 55, baseType: !25, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !175, line: 56, baseType: !25, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !175, line: 57, baseType: !25, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !175, line: 58, baseType: !25, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !175, line: 59, baseType: !25, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !175, line: 60, baseType: !25, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !175, line: 61, baseType: !25, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !175, line: 64, baseType: !25, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !175, line: 65, baseType: !25, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !175, line: 66, baseType: !25, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !175, line: 68, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !175, line: 36, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !175, line: 70, baseType: !193, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !175, line: 72, baseType: !23, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !175, line: 73, baseType: !23, size: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !175, line: 74, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !48)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !175, line: 77, baseType: !28, size: 16, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !175, line: 78, baseType: !201, size: 8, offset: 1040)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !175, line: 79, baseType: !203, size: 8, offset: 1048)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 81, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !175, line: 43, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !175, line: 89, baseType: !210, size: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !48)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !175, line: 91, baseType: !212, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !175, line: 37, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !175, line: 92, baseType: !215, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !175, line: 38, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !175, line: 93, baseType: !193, size: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !175, line: 94, baseType: !22, size: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !175, line: 95, baseType: !220, size: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 46, baseType: !27)
!221 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !175, line: 96, baseType: !23, size: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !175, line: 98, baseType: !224, size: 160, offset: 1568)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 20)
!227 = !DISubprogram(name: "getenv", scope: !228, file: !228, line: 634, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!228 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!229 = !DISubroutineType(types: !230)
!230 = !{!25, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!233 = !DISubprogram(name: "malloc", scope: !228, file: !228, line: 539, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!234 = !DISubroutineType(types: !235)
!235 = !{!22, !220}
!236 = !DISubprogram(name: "snprintf", scope: !168, file: !168, line: 354, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!237 = !DISubroutineType(types: !238)
!238 = !{!23, !239, !220, !240, null}
!239 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!240 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!241 = !DISubprogram(name: "linenoiseHistoryLoad", scope: !242, file: !242, line: 41, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!242 = !DIFile(filename: "./linenoise.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "046b023ae64d60c3d0c44850b1754ba3")
!243 = !DISubroutineType(types: !244)
!244 = !{!23, !25}
!245 = distinct !DISubprogram(name: "parseOptions", scope: !3, file: !3, line: 323, type: !77, scopeLine: 323, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!246 = !{!247, !248, !249, !250, !254}
!247 = !DILocalVariable(name: "argc", arg: 1, scope: !245, file: !3, line: 323, type: !23)
!248 = !DILocalVariable(name: "argv", arg: 2, scope: !245, file: !3, line: 323, type: !24)
!249 = !DILocalVariable(name: "i", scope: !245, file: !3, line: 324, type: !23)
!250 = !DILocalVariable(name: "lastarg", scope: !251, file: !3, line: 327, type: !23)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 326, column: 32)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 326, column: 5)
!253 = distinct !DILexicalBlock(scope: !245, file: !3, line: 326, column: 5)
!254 = !DILocalVariable(name: "ip", scope: !255, file: !3, line: 330, type: !25)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 329, column: 48)
!256 = distinct !DILexicalBlock(scope: !251, file: !3, line: 329, column: 13)
!257 = !DILocation(line: 0, scope: !245)
!258 = !DILocation(line: 326, column: 19, scope: !252)
!259 = !DILocation(line: 326, column: 5, scope: !253)
!260 = !DILocation(line: 327, column: 24, scope: !251)
!261 = !DILocation(line: 0, scope: !251)
!262 = !DILocation(line: 329, column: 21, scope: !256)
!263 = !DILocation(line: 329, column: 14, scope: !256)
!264 = !DILocation(line: 329, column: 35, scope: !256)
!265 = !DILocation(line: 330, column: 24, scope: !255)
!266 = !DILocation(line: 0, scope: !255)
!267 = !DILocation(line: 331, column: 40, scope: !268)
!268 = distinct !DILexicalBlock(scope: !255, file: !3, line: 331, column: 17)
!269 = !DILocation(line: 331, column: 34, scope: !268)
!270 = !DILocation(line: 331, column: 17, scope: !268)
!271 = !DILocation(line: 331, column: 48, scope: !268)
!272 = !DILocation(line: 331, column: 17, scope: !255)
!273 = !DILocation(line: 332, column: 46, scope: !274)
!274 = distinct !DILexicalBlock(scope: !268, file: !3, line: 331, column: 61)
!275 = !DILocation(line: 332, column: 17, scope: !274)
!276 = !DILocation(line: 333, column: 17, scope: !274)
!277 = !DILocation(line: 335, column: 27, scope: !255)
!278 = !DILocation(line: 337, column: 9, scope: !255)
!279 = !DILocation(line: 337, column: 21, scope: !280)
!280 = distinct !DILexicalBlock(scope: !256, file: !3, line: 337, column: 20)
!281 = !DILocation(line: 337, column: 42, scope: !280)
!282 = !DILocation(line: 338, column: 13, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !3, line: 337, column: 54)
!284 = !DILocation(line: 339, column: 9, scope: !283)
!285 = !DILocation(line: 339, column: 21, scope: !286)
!286 = distinct !DILexicalBlock(scope: !280, file: !3, line: 339, column: 20)
!287 = !DILocation(line: 339, column: 42, scope: !286)
!288 = !DILocation(line: 340, column: 42, scope: !289)
!289 = distinct !DILexicalBlock(scope: !286, file: !3, line: 339, column: 55)
!290 = !DILocation(line: 340, column: 36, scope: !289)
!291 = !DILocation(line: 340, column: 31, scope: !289)
!292 = !DILocation(line: 340, column: 29, scope: !289)
!293 = !DILocation(line: 342, column: 9, scope: !289)
!294 = !DILocation(line: 342, column: 21, scope: !295)
!295 = distinct !DILexicalBlock(scope: !286, file: !3, line: 342, column: 20)
!296 = !DILocation(line: 342, column: 42, scope: !295)
!297 = !DILocation(line: 343, column: 43, scope: !298)
!298 = distinct !DILexicalBlock(scope: !295, file: !3, line: 342, column: 55)
!299 = !DILocation(line: 343, column: 37, scope: !298)
!300 = !DILocation(line: 343, column: 29, scope: !298)
!301 = !DILocation(line: 343, column: 27, scope: !298)
!302 = !DILocation(line: 345, column: 9, scope: !298)
!303 = !DILocation(line: 345, column: 21, scope: !304)
!304 = distinct !DILexicalBlock(scope: !295, file: !3, line: 345, column: 20)
!305 = !DILocation(line: 345, column: 42, scope: !304)
!306 = !DILocation(line: 346, column: 39, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !3, line: 345, column: 55)
!308 = !DILocation(line: 346, column: 33, scope: !307)
!309 = !DILocation(line: 346, column: 28, scope: !307)
!310 = !DILocation(line: 346, column: 26, scope: !307)
!311 = !DILocation(line: 348, column: 9, scope: !307)
!312 = !DILocation(line: 348, column: 21, scope: !313)
!313 = distinct !DILexicalBlock(scope: !304, file: !3, line: 348, column: 20)
!314 = !DILocation(line: 348, column: 42, scope: !313)
!315 = !DILocation(line: 349, column: 33, scope: !316)
!316 = distinct !DILexicalBlock(scope: !313, file: !3, line: 348, column: 55)
!317 = !DILocation(line: 349, column: 27, scope: !316)
!318 = !DILocation(line: 349, column: 25, scope: !316)
!319 = !DILocation(line: 351, column: 9, scope: !316)
!320 = !DILocation(line: 351, column: 21, scope: !321)
!321 = distinct !DILexicalBlock(scope: !313, file: !3, line: 351, column: 20)
!322 = !DILocation(line: 351, column: 20, scope: !313)
!323 = !DILocation(line: 352, column: 21, scope: !324)
!324 = distinct !DILexicalBlock(scope: !321, file: !3, line: 351, column: 43)
!325 = !DILocation(line: 352, column: 13, scope: !324)
!326 = !DILocation(line: 356, column: 9, scope: !324)
!327 = !DILocation(line: 356, column: 21, scope: !328)
!328 = distinct !DILexicalBlock(scope: !321, file: !3, line: 356, column: 20)
!329 = !DILocation(line: 356, column: 20, scope: !321)
!330 = !DILocation(line: 357, column: 21, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !3, line: 356, column: 43)
!332 = !DILocation(line: 357, column: 13, scope: !331)
!333 = !DILocation(line: 362, column: 21, scope: !334)
!334 = distinct !DILexicalBlock(scope: !328, file: !3, line: 362, column: 20)
!335 = !DILocation(line: 362, column: 20, scope: !328)
!336 = !DILocation(line: 363, column: 13, scope: !337)
!337 = distinct !DILexicalBlock(scope: !334, file: !3, line: 362, column: 43)
!338 = !DILocation(line: 364, column: 13, scope: !337)
!339 = !DILocation(line: 326, column: 28, scope: !252)
!340 = distinct !{!340, !259, !341}
!341 = !DILocation(line: 368, column: 5, scope: !253)
!342 = !DILocation(line: 369, column: 5, scope: !245)
!343 = distinct !DISubprogram(name: "cliSendCommand", scope: !3, file: !3, line: 269, type: !344, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{!23, !23, !24, !23}
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354}
!347 = !DILocalVariable(name: "argc", arg: 1, scope: !343, file: !3, line: 269, type: !23)
!348 = !DILocalVariable(name: "argv", arg: 2, scope: !343, file: !3, line: 269, type: !24)
!349 = !DILocalVariable(name: "repeat", arg: 3, scope: !343, file: !3, line: 269, type: !23)
!350 = !DILocalVariable(name: "command", scope: !343, file: !3, line: 270, type: !25)
!351 = !DILocalVariable(name: "fd", scope: !343, file: !3, line: 271, type: !23)
!352 = !DILocalVariable(name: "j", scope: !343, file: !3, line: 271, type: !23)
!353 = !DILocalVariable(name: "retval", scope: !343, file: !3, line: 271, type: !23)
!354 = !DILocalVariable(name: "cmd", scope: !343, file: !3, line: 272, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !356, line: 36, baseType: !25)
!356 = !DIFile(filename: "./sds.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "be5f4c5599eae55b8730033246030f20")
!357 = !DILocation(line: 0, scope: !343)
!358 = !DILocation(line: 270, column: 21, scope: !343)
!359 = !DILocation(line: 274, column: 26, scope: !343)
!360 = !DILocation(line: 274, column: 25, scope: !343)
!361 = !DILocation(line: 274, column: 23, scope: !343)
!362 = !DILocation(line: 275, column: 10, scope: !363)
!363 = distinct !DILexicalBlock(scope: !343, file: !3, line: 275, column: 9)
!364 = !DILocation(line: 275, column: 9, scope: !343)
!365 = !DILocation(line: 276, column: 9, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !3, line: 275, column: 38)
!367 = !DILocation(line: 277, column: 9, scope: !366)
!368 = !DILocation(line: 279, column: 10, scope: !369)
!369 = distinct !DILexicalBlock(scope: !343, file: !3, line: 279, column: 9)
!370 = !DILocation(line: 279, column: 9, scope: !343)
!371 = !DILocation(line: 279, column: 58, scope: !369)
!372 = !DILocation(line: 279, column: 42, scope: !369)
!373 = !DILocation(line: 280, column: 10, scope: !374)
!374 = distinct !DILexicalBlock(scope: !343, file: !3, line: 280, column: 9)
!375 = !DILocation(line: 280, column: 9, scope: !343)
!376 = !DILocation(line: 280, column: 61, scope: !374)
!377 = !DILocation(line: 280, column: 41, scope: !374)
!378 = !DILocation(line: 281, column: 10, scope: !379)
!379 = distinct !DILexicalBlock(scope: !343, file: !3, line: 281, column: 9)
!380 = !DILocation(line: 281, column: 42, scope: !379)
!381 = !DILocation(line: 282, column: 10, scope: !379)
!382 = !DILocation(line: 281, column: 9, scope: !343)
!383 = !DILocation(line: 282, column: 63, scope: !379)
!384 = !DILocation(line: 282, column: 44, scope: !379)
!385 = !DILocation(line: 283, column: 15, scope: !386)
!386 = distinct !DILexicalBlock(scope: !343, file: !3, line: 283, column: 9)
!387 = !DILocation(line: 283, column: 30, scope: !386)
!388 = !DILocation(line: 283, column: 9, scope: !343)
!389 = !DILocation(line: 286, column: 14, scope: !343)
!390 = !DILocation(line: 287, column: 9, scope: !391)
!391 = distinct !DILexicalBlock(scope: !343, file: !3, line: 287, column: 9)
!392 = !DILocation(line: 287, column: 9, scope: !343)
!393 = !DILocation(line: 288, column: 17, scope: !394)
!394 = distinct !DILexicalBlock(scope: !391, file: !3, line: 287, column: 17)
!395 = !DILocation(line: 288, column: 9, scope: !394)
!396 = !DILocation(line: 289, column: 9, scope: !394)
!397 = !DILocation(line: 293, column: 24, scope: !343)
!398 = !DILocation(line: 293, column: 11, scope: !343)
!399 = !DILocation(line: 294, column: 19, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 294, column: 5)
!401 = distinct !DILexicalBlock(scope: !343, file: !3, line: 294, column: 5)
!402 = !DILocation(line: 294, column: 5, scope: !401)
!403 = !DILocation(line: 301, column: 5, scope: !343)
!404 = !DILocation(line: 296, column: 35, scope: !405)
!405 = distinct !DILexicalBlock(scope: !400, file: !3, line: 294, column: 32)
!406 = !DILocation(line: 296, column: 28, scope: !405)
!407 = !DILocation(line: 295, column: 15, scope: !405)
!408 = !DILocation(line: 297, column: 29, scope: !405)
!409 = !DILocation(line: 297, column: 37, scope: !405)
!410 = !DILocation(line: 297, column: 15, scope: !405)
!411 = !DILocation(line: 298, column: 15, scope: !405)
!412 = !DILocation(line: 294, column: 28, scope: !400)
!413 = distinct !{!413, !402, !414}
!414 = !DILocation(line: 299, column: 5, scope: !401)
!415 = !DILocation(line: 301, column: 17, scope: !343)
!416 = !DILocation(line: 302, column: 26, scope: !417)
!417 = distinct !DILexicalBlock(scope: !343, file: !3, line: 301, column: 21)
!418 = !DILocation(line: 302, column: 9, scope: !417)
!419 = !DILocation(line: 303, column: 23, scope: !417)
!420 = !DILocation(line: 303, column: 9, scope: !417)
!421 = !DILocation(line: 304, column: 17, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !3, line: 304, column: 17)
!423 = distinct !DILexicalBlock(scope: !417, file: !3, line: 303, column: 37)
!424 = !DILocation(line: 304, column: 17, scope: !423)
!425 = !DILocation(line: 304, column: 47, scope: !422)
!426 = !DILocation(line: 305, column: 13, scope: !423)
!427 = distinct !{!427, !420, !428}
!428 = !DILocation(line: 306, column: 9, scope: !417)
!429 = !DILocation(line: 308, column: 20, scope: !430)
!430 = distinct !DILexicalBlock(scope: !417, file: !3, line: 308, column: 13)
!431 = !DILocation(line: 308, column: 13, scope: !417)
!432 = !DILocation(line: 309, column: 13, scope: !433)
!433 = distinct !DILexicalBlock(scope: !430, file: !3, line: 308, column: 33)
!434 = !DILocation(line: 310, column: 13, scope: !433)
!435 = !DILocation(line: 311, column: 17, scope: !436)
!436 = distinct !DILexicalBlock(scope: !433, file: !3, line: 310, column: 23)
!437 = !DILocation(line: 312, column: 17, scope: !436)
!438 = distinct !{!438, !434, !439}
!439 = !DILocation(line: 313, column: 13, scope: !433)
!440 = !DILocation(line: 316, column: 18, scope: !417)
!441 = !DILocation(line: 317, column: 21, scope: !442)
!442 = distinct !DILexicalBlock(scope: !417, file: !3, line: 317, column: 13)
!443 = !DILocation(line: 317, column: 14, scope: !442)
!444 = !DILocation(line: 317, column: 32, scope: !442)
!445 = !DILocation(line: 317, column: 47, scope: !442)
!446 = !DILocation(line: 318, column: 13, scope: !447)
!447 = distinct !DILexicalBlock(scope: !417, file: !3, line: 318, column: 13)
!448 = !DILocation(line: 318, column: 13, scope: !417)
!449 = distinct !{!449, !403, !450}
!450 = !DILocation(line: 319, column: 5, scope: !343)
!451 = !DILocation(line: 321, column: 1, scope: !343)
!452 = distinct !DISubprogram(name: "convertToSds", scope: !3, file: !3, line: 401, type: !453, scopeLine: 401, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!24, !23, !24}
!455 = !{!456, !457, !458, !459}
!456 = !DILocalVariable(name: "count", arg: 1, scope: !452, file: !3, line: 401, type: !23)
!457 = !DILocalVariable(name: "args", arg: 2, scope: !452, file: !3, line: 401, type: !24)
!458 = !DILocalVariable(name: "j", scope: !452, file: !3, line: 402, type: !23)
!459 = !DILocalVariable(name: "sds", scope: !452, file: !3, line: 403, type: !24)
!460 = !DILocation(line: 0, scope: !452)
!461 = !DILocation(line: 403, column: 38, scope: !452)
!462 = !DILocation(line: 403, column: 37, scope: !452)
!463 = !DILocation(line: 403, column: 16, scope: !452)
!464 = !DILocation(line: 405, column: 16, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 405, column: 3)
!466 = distinct !DILexicalBlock(scope: !452, file: !3, line: 405, column: 3)
!467 = !DILocation(line: 405, column: 3, scope: !466)
!468 = !DILocation(line: 406, column: 21, scope: !465)
!469 = !DILocation(line: 406, column: 14, scope: !465)
!470 = !DILocation(line: 406, column: 5, scope: !465)
!471 = !DILocation(line: 406, column: 12, scope: !465)
!472 = !DILocation(line: 405, column: 26, scope: !465)
!473 = distinct !{!473, !467, !474}
!474 = !DILocation(line: 406, column: 28, scope: !466)
!475 = !DILocation(line: 408, column: 3, scope: !452)
!476 = distinct !DISubprogram(name: "noninteractive", scope: !3, file: !3, line: 456, type: !77, scopeLine: 456, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !477)
!477 = !{!478, !479, !480, !481}
!478 = !DILocalVariable(name: "argc", arg: 1, scope: !476, file: !3, line: 456, type: !23)
!479 = !DILocalVariable(name: "argv", arg: 2, scope: !476, file: !3, line: 456, type: !24)
!480 = !DILocalVariable(name: "retval", scope: !476, file: !3, line: 457, type: !23)
!481 = !DILocalVariable(name: "s", scope: !476, file: !3, line: 458, type: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !483, line: 46, size: 1152, elements: !484)
!483 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "f8d5b541c4f89219f8e8ff8c3e2940d9")
!484 = !{!485, !487, !489, !491, !493, !495, !497, !498, !499, !500, !502, !504, !512, !513, !514}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !482, file: !483, line: 48, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !198, line: 145, baseType: !27)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !482, file: !483, line: 53, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !198, line: 148, baseType: !27)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !482, file: !483, line: 61, baseType: !490, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !198, line: 151, baseType: !27)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !482, file: !483, line: 62, baseType: !492, size: 32, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !198, line: 150, baseType: !7)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !482, file: !483, line: 64, baseType: !494, size: 32, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !198, line: 146, baseType: !7)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !482, file: !483, line: 65, baseType: !496, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !198, line: 147, baseType: !7)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !482, file: !483, line: 67, baseType: !23, size: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !482, file: !483, line: 69, baseType: !486, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !482, file: !483, line: 74, baseType: !197, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !482, file: !483, line: 78, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !198, line: 174, baseType: !48)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !482, file: !483, line: 80, baseType: !503, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !198, line: 179, baseType: !48)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !482, file: !483, line: 91, baseType: !505, size: 128, offset: 576)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !506, line: 10, size: 128, elements: !507)
!506 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "33f28095c70788baa6982a79b13f774b")
!507 = !{!508, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !505, file: !506, line: 12, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !198, line: 160, baseType: !48)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !505, file: !506, line: 16, baseType: !511, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !198, line: 196, baseType: !48)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !482, file: !483, line: 92, baseType: !505, size: 128, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !482, file: !483, line: 93, baseType: !505, size: 128, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !482, file: !483, line: 106, baseType: !515, size: 192, offset: 960)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 192, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 3)
!518 = !DILocation(line: 0, scope: !476)
!519 = !DILocation(line: 458, column: 5, scope: !476)
!520 = !DILocation(line: 458, column: 17, scope: !476)
!521 = !DILocation(line: 459, column: 18, scope: !476)
!522 = !DILocation(line: 459, column: 11, scope: !476)
!523 = !DILocation(line: 459, column: 5, scope: !476)
!524 = !DILocation(line: 460, column: 9, scope: !525)
!525 = distinct !DILexicalBlock(scope: !476, file: !3, line: 460, column: 9)
!526 = !{!527, !97, i64 24}
!527 = !{!"stat", !98, i64 0, !98, i64 8, !98, i64 16, !97, i64 24, !97, i64 28, !97, i64 32, !97, i64 36, !98, i64 40, !98, i64 48, !98, i64 56, !98, i64 64, !528, i64 72, !528, i64 88, !528, i64 104, !95, i64 120}
!528 = !{!"timespec", !98, i64 0, !98, i64 8}
!529 = !DILocation(line: 460, column: 29, scope: !525)
!530 = !DILocation(line: 461, column: 25, scope: !531)
!531 = distinct !DILexicalBlock(scope: !525, file: !3, line: 460, column: 52)
!532 = !DILocation(line: 461, column: 36, scope: !531)
!533 = !DILocation(line: 461, column: 31, scope: !531)
!534 = !DILocation(line: 461, column: 39, scope: !531)
!535 = !DILocation(line: 461, column: 16, scope: !531)
!536 = !DILocation(line: 462, column: 22, scope: !531)
!537 = !DILocation(line: 462, column: 9, scope: !531)
!538 = !DILocation(line: 462, column: 20, scope: !531)
!539 = !DILocation(line: 463, column: 54, scope: !531)
!540 = !DILocation(line: 463, column: 47, scope: !531)
!541 = !DILocation(line: 463, column: 18, scope: !531)
!542 = !DILocation(line: 464, column: 5, scope: !531)
!543 = !DILocation(line: 466, column: 52, scope: !544)
!544 = distinct !DILexicalBlock(scope: !525, file: !3, line: 464, column: 12)
!545 = !DILocation(line: 466, column: 45, scope: !544)
!546 = !DILocation(line: 466, column: 18, scope: !544)
!547 = !DILocation(line: 0, scope: !525)
!548 = !DILocation(line: 469, column: 1, scope: !476)
!549 = !DILocation(line: 468, column: 5, scope: !476)
!550 = !DISubprogram(name: "strcmp", scope: !551, file: !551, line: 137, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!551 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!552 = !DISubroutineType(types: !553)
!553 = !{!23, !231, !231}
!554 = !DISubprogram(name: "zmalloc", scope: !555, file: !555, line: 34, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!555 = !DIFile(filename: "./zmalloc.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "8c6e7e80b58457b2728e51e83fedc2bb")
!556 = !DISubprogram(name: "anetResolve", scope: !557, file: !557, line: 41, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!557 = !DIFile(filename: "./anet.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "81285b86a9ecba6646b6ba287bca42c3")
!558 = !DISubroutineType(types: !559)
!559 = !{!23, !25, !25, !25}
!560 = !DISubprogram(name: "printf", scope: !168, file: !168, line: 332, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!561 = !DISubroutineType(types: !562)
!562 = !{!23, !240, null}
!563 = !DISubprogram(name: "exit", scope: !228, file: !228, line: 617, type: !564, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !166)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !23}
!566 = !DISubprogram(name: "strtoll", scope: !228, file: !228, line: 200, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !166)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !240, !570, !23}
!569 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
