; ModuleID = 'redis-benchmark.c'
source_filename = "redis-benchmark.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.aeEventLoop*, i8*, i32, i32, i64, i64, i32*, %struct.list*, i32, i32, i32 }
%struct.aeEventLoop = type { i32, i64, [10240 x %struct.aeFileEvent], [10240 x %struct.aeFiredEvent], %struct.aeTimeEvent*, i32, i8*, void (%struct.aeEventLoop*)* }
%struct.aeFileEvent = type { i32, void (%struct.aeEventLoop*, i32, i8*, i32)*, void (%struct.aeEventLoop*, i32, i8*, i32)*, i8* }
%struct.aeFiredEvent = type { i32, i32 }
%struct.aeTimeEvent = type { i64, i64, i64, i32 (%struct.aeEventLoop*, i64, i8*)*, void (%struct.aeEventLoop*, i8*)*, i8*, %struct.aeTimeEvent* }
%struct.list = type { %struct.listNode*, %struct.listNode*, i8* (i8*)*, void (i8*)*, i32 (i8*, i8*)*, i32 }
%struct.listNode = type { %struct.listNode*, %struct.listNode*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._client = type { i32, i32, i8*, i8*, i32, i32, i32, i32, i32, i64 }
%struct.timeval = type { i64, i64 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 82, type: !44, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !18, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "redis-benchmark.c", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "a3ac98a6aac5410e1ccf48ff89318fb4")
!4 = !{!5, !10, !11, !14, !15, !16, !17}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !6, line: 72, baseType: !7)
!6 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ccc98b488c777571beae1a47763d91")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!18 = !{!0, !19}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "last_tot_received", scope: !21, file: !3, line: 181, type: !10, isLocal: true, isDefinition: true)
!21 = distinct !DISubprogram(name: "clientDone", scope: !3, file: !3, line: 180, type: !22, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !41)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "client", file: !3, line: 95, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_client", file: !3, line: 84, size: 448, elements: !27)
!27 = !{!28, !29, !30, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !26, file: !3, line: 85, baseType: !10, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !26, file: !3, line: 86, baseType: !10, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !26, file: !3, line: 87, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !32, line: 36, baseType: !12)
!32 = !DIFile(filename: "./sds.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "be5f4c5599eae55b8730033246030f20")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !26, file: !3, line: 88, baseType: !31, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mbulk", scope: !26, file: !3, line: 89, baseType: !10, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "readlen", scope: !26, file: !3, line: 90, baseType: !10, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "totreceived", scope: !26, file: !3, line: 91, baseType: !10, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !26, file: !3, line: 92, baseType: !16, size: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "replytype", scope: !26, file: !3, line: 93, baseType: !10, size: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !26, file: !3, line: 94, baseType: !40, size: 64, offset: 384)
!40 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!41 = !{!42, !43}
!42 = !DILocalVariable(name: "c", arg: 1, scope: !21, file: !3, line: 180, type: !24)
!43 = !DILocalVariable(name: "latency", scope: !21, file: !3, line: 183, type: !40)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config", file: !3, line: 61, size: 896, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !114, !115, !116, !117, !118, !119, !121, !150, !151, !152}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !44, file: !3, line: 62, baseType: !10, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "numclients", scope: !44, file: !3, line: 63, baseType: !10, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !44, file: !3, line: 64, baseType: !10, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "liveclients", scope: !44, file: !3, line: 65, baseType: !10, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "donerequests", scope: !44, file: !3, line: 66, baseType: !10, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "keysize", scope: !44, file: !3, line: 67, baseType: !10, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "datasize", scope: !44, file: !3, line: 68, baseType: !10, size: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "randomkeys", scope: !44, file: !3, line: 69, baseType: !10, size: 32, offset: 224)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "randomkeys_keyspacelen", scope: !44, file: !3, line: 70, baseType: !10, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "el", scope: !44, file: !3, line: 71, baseType: !56, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventLoop", file: !58, line: 98, baseType: !59)
!58 = !DIFile(filename: "./ae.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "51650c7e83e254786f74107a47ea513a")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeEventLoop", file: !58, line: 89, size: 3277184, elements: !60)
!60 = !{!61, !62, !63, !79, !86, !107, !108, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !59, file: !58, line: 90, baseType: !10, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventNextId", scope: !59, file: !58, line: 91, baseType: !40, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !59, file: !58, line: 92, baseType: !64, size: 2621440, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2621440, elements: !77)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileEvent", file: !58, line: 69, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFileEvent", file: !58, line: 64, size: 256, elements: !67)
!67 = !{!68, !69, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !66, file: !58, line: 65, baseType: !10, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rfileProc", scope: !66, file: !58, line: 66, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFileProc", file: !58, line: 58, baseType: !72)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !10, !14, !10}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "wfileProc", scope: !66, file: !58, line: 67, baseType: !70, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !66, file: !58, line: 68, baseType: !14, size: 64, offset: 192)
!77 = !{!78}
!78 = !DISubrange(count: 10240)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fired", scope: !59, file: !58, line: 93, baseType: !80, size: 655360, offset: 2621568)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 655360, elements: !77)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeFiredEvent", file: !58, line: 86, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeFiredEvent", file: !58, line: 83, size: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !82, file: !58, line: 84, baseType: !10, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !82, file: !58, line: 85, baseType: !10, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "timeEventHead", scope: !59, file: !58, line: 94, baseType: !87, size: 64, offset: 3276928)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeEvent", file: !58, line: 80, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aeTimeEvent", file: !58, line: 72, size: 448, elements: !90)
!90 = !{!91, !92, !93, !94, !99, !104, !105}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !89, file: !58, line: 73, baseType: !40, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "when_sec", scope: !89, file: !58, line: 74, baseType: !15, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "when_ms", scope: !89, file: !58, line: 75, baseType: !15, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timeProc", scope: !89, file: !58, line: 76, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeTimeProc", file: !58, line: 59, baseType: !97)
!97 = !DISubroutineType(types: !98)
!98 = !{!10, !74, !40, !14}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "finalizerProc", scope: !89, file: !58, line: 77, baseType: !100, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeEventFinalizerProc", file: !58, line: 60, baseType: !102)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !74, !14}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !89, file: !58, line: 78, baseType: !14, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !58, line: 79, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !59, file: !58, line: 95, baseType: !10, size: 32, offset: 3276992)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "apidata", scope: !59, file: !58, line: 96, baseType: !14, size: 64, offset: 3277056)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "beforesleep", scope: !59, file: !58, line: 97, baseType: !110, size: 64, offset: 3277120)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "aeBeforeSleepProc", file: !58, line: 61, baseType: !112)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !74}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hostip", scope: !44, file: !3, line: 72, baseType: !12, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "hostport", scope: !44, file: !3, line: 73, baseType: !10, size: 32, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !44, file: !3, line: 74, baseType: !10, size: 32, offset: 480)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !44, file: !3, line: 75, baseType: !40, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totlatency", scope: !44, file: !3, line: 76, baseType: !40, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !44, file: !3, line: 77, baseType: !120, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !44, file: !3, line: 78, baseType: !122, size: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !124, line: 54, baseType: !125)
!124 = !DIFile(filename: "./adlist.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "0461b55abfa9065d70cc6ca884308362")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list", file: !124, line: 47, size: 384, elements: !126)
!126 = !{!127, !136, !137, !141, !145, !149}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !124, line: 48, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "listNode", file: !124, line: 40, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listNode", file: !124, line: 36, size: 192, elements: !131)
!131 = !{!132, !134, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !124, line: 37, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !124, line: 38, baseType: !133, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !130, file: !124, line: 39, baseType: !14, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !125, file: !124, line: 49, baseType: !128, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !125, file: !124, line: 50, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!14, !14}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !125, file: !124, line: 51, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !14}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !125, file: !124, line: 52, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!10, !14, !14}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !124, line: 53, baseType: !16, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !44, file: !3, line: 79, baseType: !10, size: 32, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !44, file: !3, line: 80, baseType: !10, size: 32, offset: 800)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "idlemode", scope: !44, file: !3, line: 81, baseType: !10, size: 32, offset: 832)
!153 = !{i32 7, !"Dwarf Version", i32 5}
!154 = !{i32 2, !"Debug Info Version", i32 3}
!155 = !{i32 1, !"wchar_size", i32 4}
!156 = !{i32 7, !"uwtable", i32 1}
!157 = !{!"clang version 14.0.0"}
!158 = distinct !DISubprogram(name: "parseOptions", scope: !3, file: !3, line: 413, type: !159, scopeLine: 413, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !10, !11}
!161 = !{!162, !163, !164, !165, !169}
!162 = !DILocalVariable(name: "argc", arg: 1, scope: !158, file: !3, line: 413, type: !10)
!163 = !DILocalVariable(name: "argv", arg: 2, scope: !158, file: !3, line: 413, type: !11)
!164 = !DILocalVariable(name: "i", scope: !158, file: !3, line: 414, type: !10)
!165 = !DILocalVariable(name: "lastarg", scope: !166, file: !3, line: 417, type: !10)
!166 = distinct !DILexicalBlock(scope: !167, file: !3, line: 416, column: 32)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 416, column: 5)
!168 = distinct !DILexicalBlock(scope: !158, file: !3, line: 416, column: 5)
!169 = !DILocalVariable(name: "ip", scope: !170, file: !3, line: 429, type: !12)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 428, column: 55)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 428, column: 20)
!172 = distinct !DILexicalBlock(scope: !173, file: !3, line: 425, column: 20)
!173 = distinct !DILexicalBlock(scope: !174, file: !3, line: 422, column: 20)
!174 = distinct !DILexicalBlock(scope: !166, file: !3, line: 419, column: 13)
!175 = !DILocation(line: 0, scope: !158)
!176 = !DILocation(line: 416, column: 19, scope: !167)
!177 = !DILocation(line: 416, column: 5, scope: !168)
!178 = !DILocation(line: 417, column: 24, scope: !166)
!179 = !DILocation(line: 0, scope: !166)
!180 = !DILocation(line: 419, column: 21, scope: !174)
!181 = !{!182, !182, i64 0}
!182 = !{!"any pointer", !183, i64 0}
!183 = !{!"omnipotent char", !184, i64 0}
!184 = !{!"Simple C/C++ TBAA"}
!185 = !DILocation(line: 419, column: 14, scope: !174)
!186 = !DILocation(line: 419, column: 35, scope: !174)
!187 = !DILocation(line: 420, column: 44, scope: !188)
!188 = distinct !DILexicalBlock(scope: !174, file: !3, line: 419, column: 48)
!189 = !DILocation(line: 420, column: 38, scope: !188)
!190 = !DILocation(line: 420, column: 33, scope: !188)
!191 = !DILocation(line: 420, column: 31, scope: !188)
!192 = !{!193, !194, i64 4}
!193 = !{!"config", !194, i64 0, !194, i64 4, !194, i64 8, !194, i64 12, !194, i64 16, !194, i64 20, !194, i64 24, !194, i64 28, !194, i64 32, !182, i64 40, !182, i64 48, !194, i64 56, !194, i64 60, !195, i64 64, !195, i64 72, !182, i64 80, !182, i64 88, !194, i64 96, !194, i64 100, !194, i64 104}
!194 = !{!"int", !183, i64 0}
!195 = !{!"long long", !183, i64 0}
!196 = !DILocation(line: 422, column: 9, scope: !188)
!197 = !DILocation(line: 422, column: 21, scope: !173)
!198 = !DILocation(line: 422, column: 42, scope: !173)
!199 = !DILocation(line: 423, column: 42, scope: !200)
!200 = distinct !DILexicalBlock(scope: !173, file: !3, line: 422, column: 55)
!201 = !DILocation(line: 423, column: 36, scope: !200)
!202 = !DILocation(line: 423, column: 31, scope: !200)
!203 = !DILocation(line: 423, column: 29, scope: !200)
!204 = !{!193, !194, i64 8}
!205 = !DILocation(line: 425, column: 9, scope: !200)
!206 = !DILocation(line: 425, column: 21, scope: !172)
!207 = !DILocation(line: 425, column: 42, scope: !172)
!208 = !DILocation(line: 426, column: 43, scope: !209)
!209 = distinct !DILexicalBlock(scope: !172, file: !3, line: 425, column: 55)
!210 = !DILocation(line: 426, column: 37, scope: !209)
!211 = !DILocation(line: 426, column: 32, scope: !209)
!212 = !DILocation(line: 426, column: 30, scope: !209)
!213 = !{!193, !194, i64 60}
!214 = !DILocation(line: 428, column: 9, scope: !209)
!215 = !DILocation(line: 428, column: 21, scope: !171)
!216 = !DILocation(line: 428, column: 42, scope: !171)
!217 = !DILocation(line: 429, column: 24, scope: !170)
!218 = !DILocation(line: 0, scope: !170)
!219 = !DILocation(line: 430, column: 40, scope: !220)
!220 = distinct !DILexicalBlock(scope: !170, file: !3, line: 430, column: 17)
!221 = !DILocation(line: 430, column: 34, scope: !220)
!222 = !DILocation(line: 430, column: 17, scope: !220)
!223 = !DILocation(line: 430, column: 48, scope: !220)
!224 = !DILocation(line: 430, column: 17, scope: !170)
!225 = !DILocation(line: 431, column: 46, scope: !226)
!226 = distinct !DILexicalBlock(scope: !220, file: !3, line: 430, column: 61)
!227 = !DILocation(line: 431, column: 17, scope: !226)
!228 = !DILocation(line: 432, column: 17, scope: !226)
!229 = !DILocation(line: 434, column: 27, scope: !170)
!230 = !{!193, !182, i64 48}
!231 = !DILocation(line: 436, column: 9, scope: !170)
!232 = !DILocation(line: 436, column: 21, scope: !233)
!233 = distinct !DILexicalBlock(scope: !171, file: !3, line: 436, column: 20)
!234 = !DILocation(line: 436, column: 42, scope: !233)
!235 = !DILocation(line: 437, column: 42, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !3, line: 436, column: 55)
!237 = !DILocation(line: 437, column: 36, scope: !236)
!238 = !DILocation(line: 437, column: 31, scope: !236)
!239 = !DILocation(line: 437, column: 29, scope: !236)
!240 = !{!193, !194, i64 56}
!241 = !DILocation(line: 439, column: 9, scope: !236)
!242 = !DILocation(line: 439, column: 21, scope: !243)
!243 = distinct !DILexicalBlock(scope: !233, file: !3, line: 439, column: 20)
!244 = !DILocation(line: 439, column: 42, scope: !243)
!245 = !DILocation(line: 440, column: 42, scope: !246)
!246 = distinct !DILexicalBlock(scope: !243, file: !3, line: 439, column: 55)
!247 = !DILocation(line: 440, column: 36, scope: !246)
!248 = !DILocation(line: 440, column: 31, scope: !246)
!249 = !DILocation(line: 442, column: 17, scope: !246)
!250 = !DILocation(line: 443, column: 17, scope: !246)
!251 = !DILocation(line: 0, scope: !246)
!252 = !DILocation(line: 444, column: 21, scope: !253)
!253 = distinct !DILexicalBlock(scope: !243, file: !3, line: 444, column: 20)
!254 = !DILocation(line: 444, column: 42, scope: !253)
!255 = !DILocation(line: 445, column: 31, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !3, line: 444, column: 55)
!257 = !{!193, !194, i64 28}
!258 = !DILocation(line: 446, column: 56, scope: !256)
!259 = !DILocation(line: 446, column: 50, scope: !256)
!260 = !DILocation(line: 446, column: 45, scope: !256)
!261 = !DILocation(line: 447, column: 17, scope: !256)
!262 = !DILocation(line: 0, scope: !256)
!263 = !DILocation(line: 450, column: 9, scope: !256)
!264 = !DILocation(line: 450, column: 21, scope: !265)
!265 = distinct !DILexicalBlock(scope: !253, file: !3, line: 450, column: 20)
!266 = !DILocation(line: 450, column: 20, scope: !253)
!267 = !DILocation(line: 451, column: 26, scope: !268)
!268 = distinct !DILexicalBlock(scope: !265, file: !3, line: 450, column: 43)
!269 = !{!193, !194, i64 96}
!270 = !DILocation(line: 452, column: 9, scope: !268)
!271 = !DILocation(line: 452, column: 21, scope: !272)
!272 = distinct !DILexicalBlock(scope: !265, file: !3, line: 452, column: 20)
!273 = !DILocation(line: 452, column: 20, scope: !265)
!274 = !DILocation(line: 453, column: 25, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !3, line: 452, column: 43)
!276 = !{!193, !194, i64 100}
!277 = !DILocation(line: 454, column: 9, scope: !275)
!278 = !DILocation(line: 454, column: 21, scope: !279)
!279 = distinct !DILexicalBlock(scope: !272, file: !3, line: 454, column: 20)
!280 = !DILocation(line: 454, column: 20, scope: !272)
!281 = !DILocation(line: 455, column: 26, scope: !282)
!282 = distinct !DILexicalBlock(scope: !279, file: !3, line: 454, column: 43)
!283 = !{!193, !194, i64 0}
!284 = !DILocation(line: 456, column: 9, scope: !282)
!285 = !DILocation(line: 456, column: 21, scope: !286)
!286 = distinct !DILexicalBlock(scope: !279, file: !3, line: 456, column: 20)
!287 = !DILocation(line: 456, column: 20, scope: !279)
!288 = !DILocation(line: 457, column: 29, scope: !289)
!289 = distinct !DILexicalBlock(scope: !286, file: !3, line: 456, column: 43)
!290 = !{!193, !194, i64 104}
!291 = !DILocation(line: 459, column: 13, scope: !292)
!292 = distinct !DILexicalBlock(scope: !286, file: !3, line: 458, column: 16)
!293 = !DILocation(line: 460, column: 13, scope: !292)
!294 = !DILocation(line: 461, column: 13, scope: !292)
!295 = !DILocation(line: 462, column: 13, scope: !292)
!296 = !DILocation(line: 463, column: 13, scope: !292)
!297 = !DILocation(line: 464, column: 13, scope: !292)
!298 = !DILocation(line: 465, column: 13, scope: !292)
!299 = !DILocation(line: 466, column: 13, scope: !292)
!300 = !DILocation(line: 467, column: 13, scope: !292)
!301 = !DILocation(line: 468, column: 13, scope: !292)
!302 = !DILocation(line: 469, column: 13, scope: !292)
!303 = !DILocation(line: 470, column: 13, scope: !292)
!304 = !DILocation(line: 471, column: 13, scope: !292)
!305 = !DILocation(line: 472, column: 13, scope: !292)
!306 = !DILocation(line: 473, column: 13, scope: !292)
!307 = !DILocation(line: 474, column: 13, scope: !292)
!308 = !DILocation(line: 475, column: 13, scope: !292)
!309 = !DILocation(line: 476, column: 13, scope: !292)
!310 = !DILocation(line: 477, column: 13, scope: !292)
!311 = !DILocation(line: 478, column: 13, scope: !292)
!312 = !DILocation(line: 0, scope: !168)
!313 = !DILocation(line: 416, column: 28, scope: !167)
!314 = distinct !{!314, !177, !315}
!315 = !DILocation(line: 480, column: 5, scope: !168)
!316 = !DILocation(line: 481, column: 1, scope: !158)
!317 = !DISubprogram(name: "strcmp", scope: !318, file: !318, line: 137, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!318 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!319 = !DISubroutineType(types: !320)
!320 = !{!10, !321, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!323 = !{}
!324 = !DISubprogram(name: "zmalloc", scope: !325, file: !325, line: 34, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!325 = !DIFile(filename: "./zmalloc.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "8c6e7e80b58457b2728e51e83fedc2bb")
!326 = !DISubroutineType(types: !327)
!327 = !{!14, !328}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !329, line: 46, baseType: !330)
!329 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!330 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!331 = !DISubprogram(name: "anetResolve", scope: !332, file: !332, line: 41, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!332 = !DIFile(filename: "./anet.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "81285b86a9ecba6646b6ba287bca42c3")
!333 = !DISubroutineType(types: !334)
!334 = !{!10, !12, !12, !12}
!335 = !DISubprogram(name: "printf", scope: !336, file: !336, line: 332, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!336 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!337 = !DISubroutineType(types: !338)
!338 = !{!10, !339, null}
!339 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !321)
!340 = !DISubprogram(name: "exit", scope: !341, file: !341, line: 617, type: !8, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !323)
!341 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
!342 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 483, type: !343, scopeLine: 483, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !345)
!343 = !DISubroutineType(types: !344)
!344 = !{!10, !10, !11}
!345 = !{!346, !347, !348, !349}
!346 = !DILocalVariable(name: "argc", arg: 1, scope: !342, file: !3, line: 483, type: !10)
!347 = !DILocalVariable(name: "argv", arg: 2, scope: !342, file: !3, line: 483, type: !11)
!348 = !DILocalVariable(name: "c", scope: !342, file: !3, line: 484, type: !24)
!349 = !DILocalVariable(name: "data", scope: !350, file: !3, line: 551, type: !12)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 550, column: 9)
!351 = distinct !DILexicalBlock(scope: !342, file: !3, line: 527, column: 8)
!352 = !DILocation(line: 0, scope: !342)
!353 = !DILocation(line: 486, column: 5, scope: !342)
!354 = !DILocation(line: 487, column: 5, scope: !342)
!355 = !DILocation(line: 489, column: 18, scope: !342)
!356 = !{!194, !194, i64 0}
!357 = !DILocation(line: 493, column: 17, scope: !342)
!358 = !DILocation(line: 493, column: 15, scope: !342)
!359 = !{!193, !182, i64 40}
!360 = !DILocation(line: 494, column: 22, scope: !342)
!361 = !DILocation(line: 495, column: 25, scope: !342)
!362 = !{!193, !194, i64 16}
!363 = !DILocation(line: 496, column: 21, scope: !342)
!364 = !{!193, !194, i64 24}
!365 = !DILocation(line: 497, column: 23, scope: !342)
!366 = !DILocation(line: 498, column: 35, scope: !342)
!367 = !{!193, !194, i64 32}
!368 = !DILocation(line: 499, column: 18, scope: !342)
!369 = !DILocation(line: 500, column: 17, scope: !342)
!370 = !DILocation(line: 501, column: 21, scope: !342)
!371 = !DILocation(line: 502, column: 20, scope: !342)
!372 = !{!193, !182, i64 80}
!373 = !DILocation(line: 503, column: 22, scope: !342)
!374 = !DILocation(line: 503, column: 20, scope: !342)
!375 = !{!193, !182, i64 88}
!376 = !DILocation(line: 504, column: 22, scope: !342)
!377 = !DILocation(line: 504, column: 20, scope: !342)
!378 = !DILocation(line: 506, column: 19, scope: !342)
!379 = !DILocation(line: 507, column: 21, scope: !342)
!380 = !DILocation(line: 509, column: 5, scope: !342)
!381 = !DILocation(line: 511, column: 16, scope: !382)
!382 = distinct !DILexicalBlock(scope: !342, file: !3, line: 511, column: 9)
!383 = !DILocation(line: 511, column: 26, scope: !382)
!384 = !DILocation(line: 511, column: 9, scope: !342)
!385 = !DILocation(line: 512, column: 9, scope: !386)
!386 = distinct !DILexicalBlock(scope: !382, file: !3, line: 511, column: 32)
!387 = !DILocation(line: 513, column: 5, scope: !386)
!388 = !DILocation(line: 515, column: 16, scope: !389)
!389 = distinct !DILexicalBlock(scope: !342, file: !3, line: 515, column: 9)
!390 = !DILocation(line: 515, column: 9, scope: !389)
!391 = !DILocation(line: 515, column: 9, scope: !342)
!392 = !DILocation(line: 516, column: 96, scope: !393)
!393 = distinct !DILexicalBlock(scope: !389, file: !3, line: 515, column: 26)
!394 = !DILocation(line: 516, column: 9, scope: !393)
!395 = !DILocation(line: 517, column: 9, scope: !393)
!396 = !DILocation(line: 518, column: 13, scope: !393)
!397 = !DILocation(line: 519, column: 14, scope: !398)
!398 = distinct !DILexicalBlock(scope: !393, file: !3, line: 519, column: 13)
!399 = !DILocation(line: 519, column: 13, scope: !393)
!400 = !DILocation(line: 519, column: 17, scope: !398)
!401 = !DILocation(line: 520, column: 19, scope: !393)
!402 = !DILocation(line: 520, column: 12, scope: !393)
!403 = !DILocation(line: 520, column: 17, scope: !393)
!404 = !{!405, !182, i64 8}
!405 = !{!"_client", !194, i64 0, !194, i64 4, !182, i64 8, !182, i64 16, !194, i64 24, !194, i64 28, !194, i64 32, !194, i64 36, !194, i64 40, !195, i64 48}
!406 = !DILocation(line: 521, column: 9, scope: !393)
!407 = !DILocation(line: 522, column: 9, scope: !393)
!408 = !DILocation(line: 523, column: 23, scope: !393)
!409 = !DILocation(line: 523, column: 9, scope: !393)
!410 = !DILocation(line: 525, column: 5, scope: !393)
!411 = !DILocation(line: 527, column: 5, scope: !342)
!412 = !DILocation(line: 528, column: 9, scope: !351)
!413 = !DILocation(line: 529, column: 13, scope: !351)
!414 = !DILocation(line: 530, column: 14, scope: !415)
!415 = distinct !DILexicalBlock(scope: !351, file: !3, line: 530, column: 13)
!416 = !DILocation(line: 530, column: 13, scope: !351)
!417 = !DILocation(line: 530, column: 17, scope: !415)
!418 = !DILocation(line: 531, column: 29, scope: !351)
!419 = !DILocation(line: 531, column: 19, scope: !351)
!420 = !DILocation(line: 531, column: 17, scope: !351)
!421 = !DILocation(line: 532, column: 9, scope: !351)
!422 = !DILocation(line: 533, column: 9, scope: !351)
!423 = !DILocation(line: 534, column: 23, scope: !351)
!424 = !DILocation(line: 534, column: 9, scope: !351)
!425 = !DILocation(line: 535, column: 9, scope: !351)
!426 = !DILocation(line: 537, column: 9, scope: !351)
!427 = !DILocation(line: 538, column: 13, scope: !351)
!428 = !DILocation(line: 539, column: 14, scope: !429)
!429 = distinct !DILexicalBlock(scope: !351, file: !3, line: 539, column: 13)
!430 = !DILocation(line: 539, column: 13, scope: !351)
!431 = !DILocation(line: 539, column: 17, scope: !429)
!432 = !DILocation(line: 540, column: 29, scope: !351)
!433 = !DILocation(line: 540, column: 19, scope: !351)
!434 = !DILocation(line: 540, column: 17, scope: !351)
!435 = !DILocation(line: 541, column: 9, scope: !351)
!436 = !DILocation(line: 542, column: 9, scope: !351)
!437 = !DILocation(line: 543, column: 23, scope: !351)
!438 = !DILocation(line: 543, column: 9, scope: !351)
!439 = !DILocation(line: 544, column: 9, scope: !351)
!440 = !DILocation(line: 546, column: 9, scope: !351)
!441 = !DILocation(line: 547, column: 13, scope: !351)
!442 = !DILocation(line: 548, column: 14, scope: !443)
!443 = distinct !DILexicalBlock(scope: !351, file: !3, line: 548, column: 13)
!444 = !DILocation(line: 548, column: 13, scope: !351)
!445 = !DILocation(line: 548, column: 17, scope: !443)
!446 = !DILocation(line: 549, column: 35, scope: !351)
!447 = !DILocation(line: 549, column: 81, scope: !351)
!448 = !DILocation(line: 549, column: 19, scope: !351)
!449 = !DILocation(line: 549, column: 17, scope: !351)
!450 = !DILocation(line: 551, column: 41, scope: !350)
!451 = !DILocation(line: 551, column: 49, scope: !350)
!452 = !DILocation(line: 551, column: 34, scope: !350)
!453 = !DILocation(line: 551, column: 26, scope: !350)
!454 = !DILocation(line: 0, scope: !350)
!455 = !DILocation(line: 552, column: 36, scope: !350)
!456 = !DILocation(line: 552, column: 29, scope: !350)
!457 = !DILocation(line: 552, column: 13, scope: !350)
!458 = !DILocation(line: 553, column: 25, scope: !350)
!459 = !DILocation(line: 553, column: 13, scope: !350)
!460 = !DILocation(line: 553, column: 35, scope: !350)
!461 = !{!183, !183, i64 0}
!462 = !DILocation(line: 554, column: 33, scope: !350)
!463 = !DILocation(line: 554, column: 13, scope: !350)
!464 = !DILocation(line: 554, column: 37, scope: !350)
!465 = !DILocation(line: 555, column: 36, scope: !350)
!466 = !DILocation(line: 555, column: 61, scope: !350)
!467 = !DILocation(line: 555, column: 46, scope: !350)
!468 = !DILocation(line: 555, column: 23, scope: !350)
!469 = !DILocation(line: 555, column: 21, scope: !350)
!470 = !DILocation(line: 557, column: 9, scope: !351)
!471 = !DILocation(line: 558, column: 9, scope: !351)
!472 = !DILocation(line: 559, column: 23, scope: !351)
!473 = !DILocation(line: 559, column: 9, scope: !351)
!474 = !DILocation(line: 560, column: 9, scope: !351)
!475 = !DILocation(line: 562, column: 9, scope: !351)
!476 = !DILocation(line: 563, column: 13, scope: !351)
!477 = !DILocation(line: 564, column: 14, scope: !478)
!478 = distinct !DILexicalBlock(scope: !351, file: !3, line: 564, column: 13)
!479 = !DILocation(line: 564, column: 13, scope: !351)
!480 = !DILocation(line: 564, column: 17, scope: !478)
!481 = !DILocation(line: 565, column: 29, scope: !351)
!482 = !DILocation(line: 565, column: 19, scope: !351)
!483 = !DILocation(line: 565, column: 17, scope: !351)
!484 = !DILocation(line: 566, column: 9, scope: !351)
!485 = !DILocation(line: 567, column: 9, scope: !351)
!486 = !DILocation(line: 568, column: 23, scope: !351)
!487 = !DILocation(line: 568, column: 9, scope: !351)
!488 = !DILocation(line: 569, column: 9, scope: !351)
!489 = !DILocation(line: 571, column: 9, scope: !351)
!490 = !DILocation(line: 572, column: 13, scope: !351)
!491 = !DILocation(line: 573, column: 14, scope: !492)
!492 = distinct !DILexicalBlock(scope: !351, file: !3, line: 573, column: 13)
!493 = !DILocation(line: 573, column: 13, scope: !351)
!494 = !DILocation(line: 573, column: 17, scope: !492)
!495 = !DILocation(line: 574, column: 29, scope: !351)
!496 = !DILocation(line: 574, column: 19, scope: !351)
!497 = !DILocation(line: 574, column: 17, scope: !351)
!498 = !DILocation(line: 575, column: 9, scope: !351)
!499 = !DILocation(line: 576, column: 9, scope: !351)
!500 = !DILocation(line: 577, column: 23, scope: !351)
!501 = !DILocation(line: 577, column: 9, scope: !351)
!502 = !DILocation(line: 578, column: 9, scope: !351)
!503 = !DILocation(line: 580, column: 9, scope: !351)
!504 = !DILocation(line: 581, column: 13, scope: !351)
!505 = !DILocation(line: 582, column: 14, scope: !506)
!506 = distinct !DILexicalBlock(scope: !351, file: !3, line: 582, column: 13)
!507 = !DILocation(line: 582, column: 13, scope: !351)
!508 = !DILocation(line: 582, column: 17, scope: !506)
!509 = !DILocation(line: 583, column: 29, scope: !351)
!510 = !DILocation(line: 583, column: 19, scope: !351)
!511 = !DILocation(line: 583, column: 17, scope: !351)
!512 = !DILocation(line: 584, column: 9, scope: !351)
!513 = !DILocation(line: 585, column: 9, scope: !351)
!514 = !DILocation(line: 586, column: 23, scope: !351)
!515 = !DILocation(line: 586, column: 9, scope: !351)
!516 = !DILocation(line: 587, column: 9, scope: !351)
!517 = !DILocation(line: 589, column: 9, scope: !351)
!518 = !DILocation(line: 590, column: 13, scope: !351)
!519 = !DILocation(line: 591, column: 14, scope: !520)
!520 = distinct !DILexicalBlock(scope: !351, file: !3, line: 591, column: 13)
!521 = !DILocation(line: 591, column: 13, scope: !351)
!522 = !DILocation(line: 591, column: 17, scope: !520)
!523 = !DILocation(line: 592, column: 29, scope: !351)
!524 = !DILocation(line: 592, column: 19, scope: !351)
!525 = !DILocation(line: 592, column: 17, scope: !351)
!526 = !DILocation(line: 593, column: 9, scope: !351)
!527 = !DILocation(line: 594, column: 9, scope: !351)
!528 = !DILocation(line: 595, column: 23, scope: !351)
!529 = !DILocation(line: 595, column: 9, scope: !351)
!530 = !DILocation(line: 596, column: 9, scope: !351)
!531 = !DILocation(line: 598, column: 9, scope: !351)
!532 = !DILocation(line: 599, column: 13, scope: !351)
!533 = !DILocation(line: 600, column: 14, scope: !534)
!534 = distinct !DILexicalBlock(scope: !351, file: !3, line: 600, column: 13)
!535 = !DILocation(line: 600, column: 13, scope: !351)
!536 = !DILocation(line: 600, column: 17, scope: !534)
!537 = !DILocation(line: 601, column: 29, scope: !351)
!538 = !DILocation(line: 601, column: 19, scope: !351)
!539 = !DILocation(line: 601, column: 17, scope: !351)
!540 = !DILocation(line: 602, column: 9, scope: !351)
!541 = !DILocation(line: 603, column: 9, scope: !351)
!542 = !DILocation(line: 604, column: 23, scope: !351)
!543 = !DILocation(line: 604, column: 9, scope: !351)
!544 = !DILocation(line: 605, column: 9, scope: !351)
!545 = !DILocation(line: 607, column: 9, scope: !351)
!546 = !DILocation(line: 608, column: 13, scope: !351)
!547 = !DILocation(line: 609, column: 14, scope: !548)
!548 = distinct !DILexicalBlock(scope: !351, file: !3, line: 609, column: 13)
!549 = !DILocation(line: 609, column: 13, scope: !351)
!550 = !DILocation(line: 609, column: 17, scope: !548)
!551 = !DILocation(line: 610, column: 29, scope: !351)
!552 = !DILocation(line: 610, column: 19, scope: !351)
!553 = !DILocation(line: 610, column: 17, scope: !351)
!554 = !DILocation(line: 611, column: 9, scope: !351)
!555 = !DILocation(line: 612, column: 9, scope: !351)
!556 = !DILocation(line: 613, column: 23, scope: !351)
!557 = !DILocation(line: 613, column: 9, scope: !351)
!558 = !DILocation(line: 614, column: 9, scope: !351)
!559 = !DILocation(line: 616, column: 9, scope: !351)
!560 = !DILocation(line: 617, column: 13, scope: !351)
!561 = !DILocation(line: 618, column: 14, scope: !562)
!562 = distinct !DILexicalBlock(scope: !351, file: !3, line: 618, column: 13)
!563 = !DILocation(line: 618, column: 13, scope: !351)
!564 = !DILocation(line: 618, column: 17, scope: !562)
!565 = !DILocation(line: 619, column: 29, scope: !351)
!566 = !DILocation(line: 619, column: 19, scope: !351)
!567 = !DILocation(line: 619, column: 17, scope: !351)
!568 = !DILocation(line: 620, column: 9, scope: !351)
!569 = !DILocation(line: 621, column: 9, scope: !351)
!570 = !DILocation(line: 622, column: 23, scope: !351)
!571 = !DILocation(line: 622, column: 9, scope: !351)
!572 = !DILocation(line: 623, column: 9, scope: !351)
!573 = !DILocation(line: 625, column: 9, scope: !351)
!574 = !DILocation(line: 626, column: 13, scope: !351)
!575 = !DILocation(line: 627, column: 14, scope: !576)
!576 = distinct !DILexicalBlock(scope: !351, file: !3, line: 627, column: 13)
!577 = !DILocation(line: 627, column: 13, scope: !351)
!578 = !DILocation(line: 627, column: 17, scope: !576)
!579 = !DILocation(line: 628, column: 29, scope: !351)
!580 = !DILocation(line: 628, column: 19, scope: !351)
!581 = !DILocation(line: 628, column: 17, scope: !351)
!582 = !DILocation(line: 629, column: 9, scope: !351)
!583 = !DILocation(line: 630, column: 9, scope: !351)
!584 = !DILocation(line: 631, column: 23, scope: !351)
!585 = !DILocation(line: 631, column: 9, scope: !351)
!586 = !DILocation(line: 632, column: 9, scope: !351)
!587 = !DILocation(line: 634, column: 9, scope: !351)
!588 = !DILocation(line: 635, column: 13, scope: !351)
!589 = !DILocation(line: 636, column: 14, scope: !590)
!590 = distinct !DILexicalBlock(scope: !351, file: !3, line: 636, column: 13)
!591 = !DILocation(line: 636, column: 13, scope: !351)
!592 = !DILocation(line: 636, column: 17, scope: !590)
!593 = !DILocation(line: 637, column: 29, scope: !351)
!594 = !DILocation(line: 637, column: 19, scope: !351)
!595 = !DILocation(line: 637, column: 17, scope: !351)
!596 = !DILocation(line: 638, column: 9, scope: !351)
!597 = !DILocation(line: 639, column: 9, scope: !351)
!598 = !DILocation(line: 640, column: 23, scope: !351)
!599 = !DILocation(line: 640, column: 9, scope: !351)
!600 = !DILocation(line: 641, column: 9, scope: !351)
!601 = !DILocation(line: 643, column: 9, scope: !351)
!602 = !DILocation(line: 644, column: 13, scope: !351)
!603 = !DILocation(line: 645, column: 14, scope: !604)
!604 = distinct !DILexicalBlock(scope: !351, file: !3, line: 645, column: 13)
!605 = !DILocation(line: 645, column: 13, scope: !351)
!606 = !DILocation(line: 645, column: 17, scope: !604)
!607 = !DILocation(line: 646, column: 29, scope: !351)
!608 = !DILocation(line: 646, column: 19, scope: !351)
!609 = !DILocation(line: 646, column: 17, scope: !351)
!610 = !DILocation(line: 647, column: 9, scope: !351)
!611 = !DILocation(line: 648, column: 9, scope: !351)
!612 = !DILocation(line: 649, column: 23, scope: !351)
!613 = !DILocation(line: 649, column: 9, scope: !351)
!614 = !DILocation(line: 650, column: 9, scope: !351)
!615 = !DILocation(line: 652, column: 9, scope: !351)
!616 = !DILocation(line: 653, column: 13, scope: !351)
!617 = !DILocation(line: 654, column: 14, scope: !618)
!618 = distinct !DILexicalBlock(scope: !351, file: !3, line: 654, column: 13)
!619 = !DILocation(line: 654, column: 13, scope: !351)
!620 = !DILocation(line: 654, column: 17, scope: !618)
!621 = !DILocation(line: 655, column: 29, scope: !351)
!622 = !DILocation(line: 655, column: 19, scope: !351)
!623 = !DILocation(line: 655, column: 17, scope: !351)
!624 = !DILocation(line: 656, column: 9, scope: !351)
!625 = !DILocation(line: 657, column: 9, scope: !351)
!626 = !DILocation(line: 658, column: 23, scope: !351)
!627 = !DILocation(line: 658, column: 9, scope: !351)
!628 = !DILocation(line: 659, column: 9, scope: !351)
!629 = !DILocation(line: 661, column: 9, scope: !351)
!630 = !DILocation(line: 662, column: 20, scope: !342)
!631 = !DILocation(line: 662, column: 5, scope: !351)
!632 = distinct !{!632, !411, !633}
!633 = !DILocation(line: 662, column: 24, scope: !342)
!634 = !DILocation(line: 664, column: 5, scope: !342)
!635 = !DISubprogram(name: "signal", scope: !6, file: !6, line: 88, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!636 = !DISubroutineType(types: !637)
!637 = !{!5, !10, !5}
!638 = !DISubprogram(name: "aeCreateEventLoop", scope: !58, file: !58, line: 101, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!639 = !DISubroutineType(types: !640)
!640 = !{!56}
!641 = !DISubprogram(name: "listCreate", scope: !124, file: !124, line: 73, type: !642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!642 = !DISubroutineType(types: !643)
!643 = !{!122}
!644 = distinct !DISubprogram(name: "prepareForBenchmark", scope: !3, file: !3, line: 400, type: !645, scopeLine: 401, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !323)
!645 = !DISubroutineType(types: !646)
!646 = !{null}
!647 = !DILocation(line: 402, column: 19, scope: !644)
!648 = !DILocation(line: 402, column: 5, scope: !644)
!649 = !DILocation(line: 403, column: 20, scope: !644)
!650 = !DILocation(line: 403, column: 18, scope: !644)
!651 = !{!193, !195, i64 64}
!652 = !DILocation(line: 404, column: 25, scope: !644)
!653 = !DILocation(line: 405, column: 1, scope: !644)
!654 = distinct !DISubprogram(name: "createClient", scope: !3, file: !3, line: 339, type: !655, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{!24}
!657 = !{!658, !659}
!658 = !DILocalVariable(name: "c", scope: !654, file: !3, line: 340, type: !24)
!659 = !DILocalVariable(name: "err", scope: !654, file: !3, line: 341, type: !660)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 256)
!663 = !DILocation(line: 340, column: 16, scope: !654)
!664 = !DILocation(line: 0, scope: !654)
!665 = !DILocation(line: 341, column: 5, scope: !654)
!666 = !DILocation(line: 341, column: 10, scope: !654)
!667 = !DILocation(line: 343, column: 47, scope: !654)
!668 = !DILocation(line: 343, column: 61, scope: !654)
!669 = !DILocation(line: 343, column: 13, scope: !654)
!670 = !DILocation(line: 343, column: 8, scope: !654)
!671 = !DILocation(line: 343, column: 11, scope: !654)
!672 = !{!405, !194, i64 4}
!673 = !DILocation(line: 344, column: 15, scope: !674)
!674 = distinct !DILexicalBlock(scope: !654, file: !3, line: 344, column: 9)
!675 = !DILocation(line: 344, column: 9, scope: !654)
!676 = !DILocation(line: 345, column: 9, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !3, line: 344, column: 28)
!678 = !DILocation(line: 346, column: 17, scope: !677)
!679 = !DILocation(line: 346, column: 9, scope: !677)
!680 = !DILocation(line: 347, column: 9, scope: !677)
!681 = !DILocation(line: 349, column: 5, scope: !654)
!682 = !DILocation(line: 350, column: 15, scope: !654)
!683 = !DILocation(line: 350, column: 8, scope: !654)
!684 = !DILocation(line: 350, column: 13, scope: !654)
!685 = !DILocation(line: 351, column: 15, scope: !654)
!686 = !DILocation(line: 351, column: 8, scope: !654)
!687 = !DILocation(line: 351, column: 13, scope: !654)
!688 = !{!405, !182, i64 16}
!689 = !DILocation(line: 352, column: 8, scope: !654)
!690 = !DILocation(line: 352, column: 14, scope: !654)
!691 = !DILocation(line: 356, column: 8, scope: !654)
!692 = !DILocation(line: 356, column: 14, scope: !654)
!693 = !{!405, !194, i64 0}
!694 = !DILocation(line: 357, column: 30, scope: !654)
!695 = !DILocation(line: 357, column: 37, scope: !654)
!696 = !DILocation(line: 357, column: 5, scope: !654)
!697 = !DILocation(line: 358, column: 23, scope: !654)
!698 = !{!193, !194, i64 12}
!699 = !DILocation(line: 359, column: 28, scope: !654)
!700 = !DILocation(line: 359, column: 5, scope: !654)
!701 = !DILocation(line: 360, column: 5, scope: !654)
!702 = !DILocation(line: 361, column: 1, scope: !654)
!703 = !DISubprogram(name: "sdsempty", scope: !32, file: !32, line: 46, type: !704, spFlags: DISPFlagOptimized, retainedNodes: !323)
!704 = !DISubroutineType(types: !705)
!705 = !{!31}
!706 = distinct !DISubprogram(name: "prepareClientForReply", scope: !3, file: !3, line: 166, type: !707, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !24, !10}
!709 = !{!710, !711}
!710 = !DILocalVariable(name: "c", arg: 1, scope: !706, file: !3, line: 166, type: !24)
!711 = !DILocalVariable(name: "type", arg: 2, scope: !706, file: !3, line: 166, type: !10)
!712 = !DILocation(line: 0, scope: !706)
!713 = !DILocation(line: 167, column: 9, scope: !706)
!714 = !DILocation(line: 168, column: 12, scope: !715)
!715 = distinct !DILexicalBlock(scope: !716, file: !3, line: 167, column: 29)
!716 = distinct !DILexicalBlock(scope: !706, file: !3, line: 167, column: 9)
!717 = !DILocation(line: 168, column: 22, scope: !715)
!718 = !{!405, !194, i64 40}
!719 = !DILocation(line: 169, column: 12, scope: !715)
!720 = !DILocation(line: 169, column: 20, scope: !715)
!721 = !{!405, !194, i64 28}
!722 = !DILocation(line: 170, column: 5, scope: !715)
!723 = !DILocation(line: 171, column: 12, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 170, column: 37)
!725 = distinct !DILexicalBlock(scope: !716, file: !3, line: 170, column: 16)
!726 = !DILocation(line: 171, column: 22, scope: !724)
!727 = !DILocation(line: 172, column: 12, scope: !724)
!728 = !DILocation(line: 172, column: 20, scope: !724)
!729 = !DILocation(line: 173, column: 12, scope: !724)
!730 = !DILocation(line: 173, column: 18, scope: !724)
!731 = !{!405, !194, i64 24}
!732 = !DILocation(line: 174, column: 5, scope: !724)
!733 = !DILocation(line: 175, column: 12, scope: !734)
!734 = distinct !DILexicalBlock(scope: !725, file: !3, line: 174, column: 12)
!735 = !DILocation(line: 175, column: 22, scope: !734)
!736 = !DILocation(line: 176, column: 12, scope: !734)
!737 = !DILocation(line: 176, column: 20, scope: !734)
!738 = !DILocation(line: 178, column: 1, scope: !706)
!739 = distinct !DISubprogram(name: "createMissingClients", scope: !3, file: !3, line: 363, type: !22, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !740)
!740 = !{!741, !742}
!741 = !DILocalVariable(name: "c", arg: 1, scope: !739, file: !3, line: 363, type: !24)
!742 = !DILocalVariable(name: "new", scope: !743, file: !3, line: 365, type: !24)
!743 = distinct !DILexicalBlock(scope: !739, file: !3, line: 364, column: 51)
!744 = !DILocation(line: 0, scope: !739)
!745 = !DILocation(line: 364, column: 18, scope: !739)
!746 = !DILocation(line: 364, column: 39, scope: !739)
!747 = !DILocation(line: 364, column: 30, scope: !739)
!748 = !DILocation(line: 364, column: 5, scope: !739)
!749 = !DILocation(line: 365, column: 22, scope: !743)
!750 = !DILocation(line: 0, scope: !743)
!751 = !DILocation(line: 366, column: 14, scope: !752)
!752 = distinct !DILexicalBlock(scope: !743, file: !3, line: 366, column: 13)
!753 = !DILocation(line: 366, column: 13, scope: !743)
!754 = distinct !{!754, !748, !755}
!755 = !DILocation(line: 371, column: 5, scope: !739)
!756 = !DILocation(line: 367, column: 22, scope: !743)
!757 = !DILocation(line: 367, column: 9, scope: !743)
!758 = !DILocation(line: 368, column: 31, scope: !743)
!759 = !DILocation(line: 368, column: 21, scope: !743)
!760 = !DILocation(line: 368, column: 19, scope: !743)
!761 = !DILocation(line: 369, column: 20, scope: !762)
!762 = distinct !DILexicalBlock(scope: !743, file: !3, line: 369, column: 13)
!763 = !DILocation(line: 369, column: 13, scope: !762)
!764 = !DILocation(line: 369, column: 13, scope: !743)
!765 = !DILocation(line: 369, column: 32, scope: !762)
!766 = !DILocation(line: 370, column: 38, scope: !743)
!767 = !DILocation(line: 370, column: 9, scope: !743)
!768 = !DILocation(line: 372, column: 1, scope: !739)
!769 = !DISubprogram(name: "aeMain", scope: !58, file: !58, line: 113, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !56}
!772 = !DISubprogram(name: "sdscat", scope: !32, file: !32, line: 52, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!773 = !DISubroutineType(types: !774)
!774 = !{!31, !31, !12}
!775 = distinct !DISubprogram(name: "endBenchmark", scope: !3, file: !3, line: 407, type: !776, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !12}
!778 = !{!779}
!779 = !DILocalVariable(name: "title", arg: 1, scope: !775, file: !3, line: 407, type: !12)
!780 = !DILocation(line: 0, scope: !775)
!781 = !DILocation(line: 408, column: 25, scope: !775)
!782 = !DILocation(line: 408, column: 41, scope: !775)
!783 = !DILocation(line: 408, column: 33, scope: !775)
!784 = !DILocation(line: 408, column: 23, scope: !775)
!785 = !{!193, !195, i64 72}
!786 = !DILocation(line: 409, column: 5, scope: !775)
!787 = !DILocation(line: 410, column: 5, scope: !775)
!788 = !DILocation(line: 411, column: 1, scope: !775)
!789 = !DISubprogram(name: "sdscatprintf", scope: !32, file: !32, line: 57, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!790 = !DISubroutineType(types: !791)
!791 = !{!31, !31, !321, null}
!792 = !DISubprogram(name: "memset", scope: !318, file: !318, line: 61, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!793 = !DISubroutineType(types: !794)
!794 = !{!14, !14, !10, !328}
!795 = !DISubprogram(name: "sdscatlen", scope: !32, file: !32, line: 51, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!796 = !DISubroutineType(types: !797)
!797 = !{!31, !31, !14, !328}
!798 = distinct !DISubprogram(name: "mstime", scope: !3, file: !3, line: 102, type: !799, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{!40}
!801 = !{!802, !811}
!802 = !DILocalVariable(name: "tv", scope: !798, file: !3, line: 103, type: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !804, line: 8, size: 128, elements: !805)
!804 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "7798c68081a8161421218378689a8d48")
!805 = !{!806, !809}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !803, file: !804, line: 10, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !808, line: 160, baseType: !15)
!808 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !803, file: !804, line: 11, baseType: !810, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !808, line: 162, baseType: !15)
!811 = !DILocalVariable(name: "mst", scope: !798, file: !3, line: 104, type: !40)
!812 = !DILocation(line: 103, column: 5, scope: !798)
!813 = !DILocation(line: 103, column: 20, scope: !798)
!814 = !DILocation(line: 106, column: 5, scope: !798)
!815 = !DILocation(line: 107, column: 21, scope: !798)
!816 = !{!817, !818, i64 0}
!817 = !{!"timeval", !818, i64 0, !818, i64 8}
!818 = !{!"long", !183, i64 0}
!819 = !DILocation(line: 107, column: 28, scope: !798)
!820 = !DILocation(line: 0, scope: !798)
!821 = !DILocation(line: 108, column: 15, scope: !798)
!822 = !{!817, !818, i64 8}
!823 = !DILocation(line: 108, column: 22, scope: !798)
!824 = !DILocation(line: 108, column: 9, scope: !798)
!825 = !DILocation(line: 110, column: 1, scope: !798)
!826 = !DILocation(line: 109, column: 5, scope: !798)
!827 = !DISubprogram(name: "gettimeofday", scope: !828, file: !828, line: 66, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!828 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "", checksumkind: CSK_MD5, checksum: "99ab902f1529d4d72694df20fbf7a8ec")
!829 = !DISubroutineType(types: !830)
!830 = !{!10, !831, !833}
!831 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!834 = !DISubprogram(name: "anetTcpNonBlockConnect", scope: !332, file: !332, line: 39, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!835 = !DISubroutineType(types: !836)
!836 = !{!10, !12, !12, !10}
!837 = !DISubprogram(name: "zfree", scope: !325, file: !325, line: 36, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!838 = !DISubprogram(name: "fprintf", scope: !336, file: !336, line: 326, type: !839, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!839 = !DISubroutineType(types: !840)
!840 = !{!10, !841, !339, null}
!841 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !844, line: 7, baseType: !845)
!844 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !846, line: 49, size: 1728, elements: !847)
!846 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !863, !865, !866, !867, !869, !871, !873, !877, !880, !882, !885, !888, !889, !890, !891, !892}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !845, file: !846, line: 51, baseType: !10, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !845, file: !846, line: 54, baseType: !12, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !845, file: !846, line: 55, baseType: !12, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !845, file: !846, line: 56, baseType: !12, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !845, file: !846, line: 57, baseType: !12, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !845, file: !846, line: 58, baseType: !12, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !845, file: !846, line: 59, baseType: !12, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !845, file: !846, line: 60, baseType: !12, size: 64, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !845, file: !846, line: 61, baseType: !12, size: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !845, file: !846, line: 64, baseType: !12, size: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !845, file: !846, line: 65, baseType: !12, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !845, file: !846, line: 66, baseType: !12, size: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !845, file: !846, line: 68, baseType: !861, size: 64, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !846, line: 36, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !845, file: !846, line: 70, baseType: !864, size: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !845, file: !846, line: 72, baseType: !10, size: 32, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !845, file: !846, line: 73, baseType: !10, size: 32, offset: 928)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !845, file: !846, line: 74, baseType: !868, size: 64, offset: 960)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !808, line: 152, baseType: !15)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !845, file: !846, line: 77, baseType: !870, size: 16, offset: 1024)
!870 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !845, file: !846, line: 78, baseType: !872, size: 8, offset: 1040)
!872 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !845, file: !846, line: 79, baseType: !874, size: 8, offset: 1048)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 1)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !845, file: !846, line: 81, baseType: !878, size: 64, offset: 1088)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !846, line: 43, baseType: null)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !845, file: !846, line: 89, baseType: !881, size: 64, offset: 1152)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !808, line: 153, baseType: !15)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !845, file: !846, line: 91, baseType: !883, size: 64, offset: 1216)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !846, line: 37, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !845, file: !846, line: 92, baseType: !886, size: 64, offset: 1280)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !846, line: 38, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !845, file: !846, line: 93, baseType: !864, size: 64, offset: 1344)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !845, file: !846, line: 94, baseType: !14, size: 64, offset: 1408)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !845, file: !846, line: 95, baseType: !328, size: 64, offset: 1472)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !845, file: !846, line: 96, baseType: !10, size: 32, offset: 1536)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !845, file: !846, line: 98, baseType: !893, size: 160, offset: 1568)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 20)
!896 = !DISubprogram(name: "anetTcpNoDelay", scope: !332, file: !332, line: 46, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!897 = !DISubroutineType(types: !898)
!898 = !{!10, !12, !10}
!899 = !DISubprogram(name: "aeCreateFileEvent", scope: !58, file: !58, line: 104, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !323)
!900 = !DISubroutineType(types: !901)
!901 = !{!10, !56, !10, !10, !70, !14}
!902 = distinct !DISubprogram(name: "writeHandler", scope: !3, file: !3, line: 309, type: !903, scopeLine: 310, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !56, !10, !14, !10}
!905 = !{!906, !907, !908, !909, !910, !911, !914, !915}
!906 = !DILocalVariable(name: "el", arg: 1, scope: !902, file: !3, line: 309, type: !56)
!907 = !DILocalVariable(name: "fd", arg: 2, scope: !902, file: !3, line: 309, type: !10)
!908 = !DILocalVariable(name: "privdata", arg: 3, scope: !902, file: !3, line: 309, type: !14)
!909 = !DILocalVariable(name: "mask", arg: 4, scope: !902, file: !3, line: 309, type: !10)
!910 = !DILocalVariable(name: "c", scope: !902, file: !3, line: 311, type: !24)
!911 = !DILocalVariable(name: "ptr", scope: !912, file: !3, line: 321, type: !14)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 320, column: 39)
!913 = distinct !DILexicalBlock(scope: !902, file: !3, line: 320, column: 9)
!914 = !DILocalVariable(name: "len", scope: !912, file: !3, line: 322, type: !10)
!915 = !DILocalVariable(name: "nwritten", scope: !912, file: !3, line: 323, type: !10)
!916 = !DILocation(line: 0, scope: !902)
!917 = !DILocation(line: 311, column: 16, scope: !902)
!918 = !DILocation(line: 316, column: 12, scope: !919)
!919 = distinct !DILexicalBlock(scope: !902, file: !3, line: 316, column: 9)
!920 = !DILocation(line: 316, column: 18, scope: !919)
!921 = !DILocation(line: 316, column: 9, scope: !902)
!922 = !DILocation(line: 317, column: 18, scope: !923)
!923 = distinct !DILexicalBlock(scope: !919, file: !3, line: 316, column: 40)
!924 = !DILocation(line: 318, column: 20, scope: !923)
!925 = !DILocation(line: 318, column: 12, scope: !923)
!926 = !DILocation(line: 318, column: 18, scope: !923)
!927 = !{!405, !195, i64 48}
!928 = !DILocation(line: 319, column: 5, scope: !923)
!929 = !DILocation(line: 320, column: 19, scope: !913)
!930 = !DILocation(line: 320, column: 9, scope: !913)
!931 = !DILocation(line: 320, column: 30, scope: !913)
!932 = !{!405, !194, i64 36}
!933 = !DILocation(line: 320, column: 27, scope: !913)
!934 = !DILocation(line: 320, column: 25, scope: !913)
!935 = !DILocation(line: 320, column: 9, scope: !902)
!936 = !DILocation(line: 321, column: 24, scope: !912)
!937 = !DILocation(line: 321, column: 28, scope: !912)
!938 = !DILocation(line: 0, scope: !912)
!939 = !DILocation(line: 322, column: 19, scope: !912)
!940 = !DILocation(line: 322, column: 40, scope: !912)
!941 = !DILocation(line: 323, column: 33, scope: !912)
!942 = !DILocation(line: 323, column: 42, scope: !912)
!943 = !DILocation(line: 323, column: 24, scope: !912)
!944 = !DILocation(line: 324, column: 22, scope: !945)
!945 = distinct !DILexicalBlock(scope: !912, file: !3, line: 324, column: 13)
!946 = !DILocation(line: 324, column: 13, scope: !912)
!947 = !DILocation(line: 325, column: 17, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 325, column: 17)
!949 = distinct !DILexicalBlock(scope: !945, file: !3, line: 324, column: 29)
!950 = !DILocation(line: 325, column: 23, scope: !948)
!951 = !DILocation(line: 325, column: 17, scope: !949)
