; ModuleID = 'sds.c'
source_filename = "sds.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [47 x i8] c"SDS: Out Of Memory (SDS_ABORT_ON_OOM defined)\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local nonnull i8* @sdsnewlen(i8* noundef %init, i64 noundef %initlen) local_unnamed_addr #0 !dbg !30 {
entry:
  call void @llvm.dbg.value(metadata i8* %init, metadata !41, metadata !DIExpression()), !dbg !54
  call void @llvm.dbg.value(metadata i64 %initlen, metadata !42, metadata !DIExpression()), !dbg !54
  %add1 = add i64 %initlen, 17, !dbg !55
  %call = tail call i8* @zmalloc(i64 noundef %add1) #15, !dbg !56
  call void @llvm.dbg.value(metadata i8* %call, metadata !43, metadata !DIExpression()), !dbg !54
  %cmp = icmp eq i8* %call, null, !dbg !57

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "sds.c", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "27b644bab9061399b3978ced41c4d9d7")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "36575f934ef4fe7e9d50a3cb17bd5c66")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "_ISupper", value: 256)
!8 = !DIEnumerator(name: "_ISlower", value: 512)
!9 = !DIEnumerator(name: "_ISalpha", value: 1024)
!10 = !DIEnumerator(name: "_ISdigit", value: 2048)
!11 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!12 = !DIEnumerator(name: "_ISspace", value: 8192)
!13 = !DIEnumerator(name: "_ISprint", value: 16384)
!14 = !DIEnumerator(name: "_ISgraph", value: 32768)
!15 = !DIEnumerator(name: "_ISblank", value: 1)
!16 = !DIEnumerator(name: "_IScntrl", value: 2)
!17 = !DIEnumerator(name: "_ISpunct", value: 4)
!18 = !DIEnumerator(name: "_ISalnum", value: 8)
!19 = !{!20, !21, !23, !24}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !{i32 7, !"Dwarf Version", i32 5}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{i32 7, !"uwtable", i32 1}
!29 = !{!"clang version 14.0.0"}
!30 = distinct !DISubprogram(name: "sdsnewlen", scope: !1, file: !1, line: 46, type: !31, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !40)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !37}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "sds", file: !34, line: 36, baseType: !21)
!34 = !DIFile(filename: "./sds.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "be5f4c5599eae55b8730033246030f20")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stddef.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!39 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!40 = !{!41, !42, !43}
!41 = !DILocalVariable(name: "init", arg: 1, scope: !30, file: !1, line: 46, type: !35)
!42 = !DILocalVariable(name: "initlen", arg: 2, scope: !30, file: !1, line: 46, type: !37)
!43 = !DILocalVariable(name: "sh", scope: !30, file: !1, line: 47, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sdshdr", file: !34, line: 38, size: 128, elements: !46)
!46 = !{!47, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !34, line: 39, baseType: !48, size: 64)
!48 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !45, file: !34, line: 40, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !45, file: !34, line: 41, baseType: !51, offset: 128)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: -1)
!54 = !DILocation(line: 0, scope: !30)
!55 = !DILocation(line: 49, column: 47, scope: !30)
!56 = !DILocation(line: 49, column: 10, scope: !30)
!57 = !DILocation(line: 51, column: 12, scope: !58)
!58 = distinct !DILexicalBlock(scope: !30, file: !1, line: 51, column: 9)
!59 = !DILocation(line: 51, column: 9, scope: !30)
!60 = !DILocation(line: 51, column: 21, scope: !58)
!61 = !DILocation(line: 55, column: 9, scope: !30)
!62 = !DILocation(line: 55, column: 13, scope: !30)
!63 = !{!64, !64, i64 0}
!64 = !{!"long", !65, i64 0}
!65 = !{!"omnipotent char", !66, i64 0}
!66 = !{!"Simple C/C++ TBAA"}
!67 = !DILocation(line: 56, column: 9, scope: !30)
!68 = !DILocation(line: 56, column: 14, scope: !30)
!69 = !DILocation(line: 57, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !30, file: !1, line: 57, column: 9)
!71 = !DILocation(line: 57, column: 9, scope: !30)
!72 = !DILocation(line: 58, column: 13, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !1, line: 58, column: 13)
!74 = distinct !DILexicalBlock(scope: !70, file: !1, line: 57, column: 18)
!75 = !DILocation(line: 0, scope: !73)
!76 = !DILocation(line: 58, column: 13, scope: !74)
!77 = !DILocation(line: 58, column: 19, scope: !73)
!78 = !DILocation(line: 59, column: 14, scope: !73)
!79 = !DILocation(line: 61, column: 9, scope: !30)
!80 = !DILocation(line: 61, column: 5, scope: !30)
!81 = !DILocation(line: 61, column: 22, scope: !30)
!82 = !{!65, !65, i64 0}
!83 = !DILocation(line: 62, column: 5, scope: !30)
!84 = !DISubprogram(name: "zmalloc", scope: !85, file: !85, line: 34, type: !86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!85 = !DIFile(filename: "./zmalloc.h", directory: "/home/xuheng/blackbox/llvm-test/redis", checksumkind: CSK_MD5, checksum: "8c6e7e80b58457b2728e51e83fedc2bb")
!86 = !DISubroutineType(types: !87)
!87 = !{!20, !37}
!88 = !{}
!89 = distinct !DISubprogram(name: "sdsOomAbort", scope: !1, file: !1, line: 41, type: !90, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !88)
!90 = !DISubroutineType(types: !91)
!91 = !{null}
!92 = !DILocation(line: 42, column: 13, scope: !89)
!93 = !{!94, !94, i64 0}
!94 = !{!"any pointer", !65, i64 0}
!95 = !DILocation(line: 42, column: 5, scope: !89)
!96 = !DILocation(line: 43, column: 5, scope: !89)
!97 = !DISubprogram(name: "memcpy", scope: !98, file: !98, line: 43, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!98 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "61f60112cf5c0a45c54ea1f595add24c")
!99 = !DISubroutineType(types: !100)
!100 = !{!20, !101, !102, !37}
!101 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !20)
!102 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!103 = !DISubprogram(name: "memset", scope: !98, file: !98, line: 61, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!104 = !DISubroutineType(types: !105)
!105 = !{!20, !20, !23, !37}
!106 = distinct !DISubprogram(name: "sdsempty", scope: !1, file: !1, line: 65, type: !107, scopeLine: 65, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !88)
!107 = !DISubroutineType(types: !108)
!108 = !{!33}
!109 = !DILocation(line: 66, column: 12, scope: !106)
!110 = !DILocation(line: 66, column: 5, scope: !106)
!111 = distinct !DISubprogram(name: "sdsnew", scope: !1, file: !1, line: 69, type: !112, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !116)
!112 = !DISubroutineType(types: !113)
!113 = !{!33, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!116 = !{!117, !118}
!117 = !DILocalVariable(name: "init", arg: 1, scope: !111, file: !1, line: 69, type: !114)
!118 = !DILocalVariable(name: "initlen", scope: !111, file: !1, line: 70, type: !37)
!119 = !DILocation(line: 0, scope: !111)
!120 = !DILocation(line: 70, column: 28, scope: !111)
!121 = !DILocation(line: 70, column: 22, scope: !111)
!122 = !DILocation(line: 70, column: 43, scope: !111)
!123 = !DILocation(line: 71, column: 12, scope: !111)
!124 = !DILocation(line: 71, column: 5, scope: !111)
!125 = !DISubprogram(name: "strlen", scope: !98, file: !98, line: 385, type: !126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!126 = !DISubroutineType(types: !127)
!127 = !{!37, !114}
!128 = distinct !DISubprogram(name: "sdslen", scope: !1, file: !1, line: 74, type: !129, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !132)
!129 = !DISubroutineType(types: !130)
!130 = !{!37, !131}
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!132 = !{!133, !134}
!133 = !DILocalVariable(name: "s", arg: 1, scope: !128, file: !1, line: 74, type: !131)
!134 = !DILocalVariable(name: "sh", scope: !128, file: !1, line: 75, type: !44)
!135 = !DILocation(line: 0, scope: !128)
!136 = !DILocation(line: 75, column: 35, scope: !128)
!137 = !DILocation(line: 76, column: 16, scope: !128)
!138 = !DILocation(line: 76, column: 5, scope: !128)
!139 = distinct !DISubprogram(name: "sdsdup", scope: !1, file: !1, line: 79, type: !140, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{!33, !131}
!142 = !{!143}
!143 = !DILocalVariable(name: "s", arg: 1, scope: !139, file: !1, line: 79, type: !131)
!144 = !DILocation(line: 0, scope: !139)
!145 = !DILocation(line: 80, column: 25, scope: !139)
!146 = !DILocation(line: 80, column: 12, scope: !139)
!147 = !DILocation(line: 80, column: 5, scope: !139)
!148 = distinct !DISubprogram(name: "sdsfree", scope: !1, file: !1, line: 83, type: !149, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !33}
!151 = !{!152}
!152 = !DILocalVariable(name: "s", arg: 1, scope: !148, file: !1, line: 83, type: !33)
!153 = !DILocation(line: 0, scope: !148)
!154 = !DILocation(line: 84, column: 11, scope: !155)
!155 = distinct !DILexicalBlock(scope: !148, file: !1, line: 84, column: 9)
!156 = !DILocation(line: 84, column: 9, scope: !148)
!157 = !DILocation(line: 85, column: 12, scope: !148)
!158 = !DILocation(line: 85, column: 5, scope: !148)
!159 = !DILocation(line: 86, column: 1, scope: !148)
!160 = !DISubprogram(name: "zfree", scope: !85, file: !85, line: 36, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !20}
!163 = distinct !DISubprogram(name: "sdsavail", scope: !1, file: !1, line: 88, type: !164, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{!37, !33}
!166 = !{!167, !168}
!167 = !DILocalVariable(name: "s", arg: 1, scope: !163, file: !1, line: 88, type: !33)
!168 = !DILocalVariable(name: "sh", scope: !163, file: !1, line: 89, type: !44)
!169 = !DILocation(line: 0, scope: !163)
!170 = !DILocation(line: 90, column: 16, scope: !163)
!171 = !DILocation(line: 90, column: 5, scope: !163)
!172 = distinct !DISubprogram(name: "sdsupdatelen", scope: !1, file: !1, line: 93, type: !149, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !173)
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(name: "s", arg: 1, scope: !172, file: !1, line: 93, type: !33)
!175 = !DILocalVariable(name: "sh", scope: !172, file: !1, line: 94, type: !44)
!176 = !DILocalVariable(name: "reallen", scope: !172, file: !1, line: 95, type: !23)
!177 = !DILocation(line: 0, scope: !172)
!178 = !DILocation(line: 94, column: 35, scope: !172)
!179 = !DILocation(line: 95, column: 19, scope: !172)
!180 = !DILocation(line: 96, column: 22, scope: !172)
!181 = !DILocation(line: 96, column: 26, scope: !172)
!182 = !DILocation(line: 96, column: 25, scope: !172)
!183 = !DILocation(line: 96, column: 9, scope: !172)
!184 = !DILocation(line: 96, column: 14, scope: !172)
!185 = !DILocation(line: 97, column: 13, scope: !172)
!186 = !DILocation(line: 98, column: 1, scope: !172)
!187 = distinct !DISubprogram(name: "sdscatlen", scope: !1, file: !1, line: 120, type: !188, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{!33, !33, !20, !37}
!190 = !{!191, !192, !193, !194, !195}
!191 = !DILocalVariable(name: "s", arg: 1, scope: !187, file: !1, line: 120, type: !33)
!192 = !DILocalVariable(name: "t", arg: 2, scope: !187, file: !1, line: 120, type: !20)
!193 = !DILocalVariable(name: "len", arg: 3, scope: !187, file: !1, line: 120, type: !37)
!194 = !DILocalVariable(name: "sh", scope: !187, file: !1, line: 121, type: !44)
!195 = !DILocalVariable(name: "curlen", scope: !187, file: !1, line: 122, type: !37)
!196 = !DILocation(line: 0, scope: !187)
!197 = !DILocation(line: 122, column: 21, scope: !187)
!198 = !DILocation(line: 124, column: 9, scope: !187)
!199 = !DILocation(line: 125, column: 11, scope: !200)
!200 = distinct !DILexicalBlock(scope: !187, file: !1, line: 125, column: 9)
!201 = !DILocation(line: 125, column: 9, scope: !187)
!202 = !DILocation(line: 126, column: 20, scope: !187)
!203 = !DILocation(line: 127, column: 13, scope: !187)
!204 = !DILocation(line: 127, column: 5, scope: !187)
!205 = !DILocation(line: 128, column: 21, scope: !187)
!206 = !DILocation(line: 128, column: 9, scope: !187)
!207 = !DILocation(line: 128, column: 13, scope: !187)
!208 = !DILocation(line: 129, column: 20, scope: !187)
!209 = !DILocation(line: 129, column: 24, scope: !187)
!210 = !DILocation(line: 129, column: 14, scope: !187)
!211 = !DILocation(line: 130, column: 5, scope: !187)
!212 = !DILocation(line: 130, column: 19, scope: !187)
!213 = !DILocation(line: 131, column: 5, scope: !187)
!214 = !DILocation(line: 132, column: 1, scope: !187)
!215 = distinct !DISubprogram(name: "sdsMakeRoomFor", scope: !1, file: !1, line: 100, type: !216, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!33, !33, !37}
!218 = !{!219, !220, !221, !222, !223, !224, !225}
!219 = !DILocalVariable(name: "s", arg: 1, scope: !215, file: !1, line: 100, type: !33)
!220 = !DILocalVariable(name: "addlen", arg: 2, scope: !215, file: !1, line: 100, type: !37)
!221 = !DILocalVariable(name: "sh", scope: !215, file: !1, line: 101, type: !44)
!222 = !DILocalVariable(name: "newsh", scope: !215, file: !1, line: 101, type: !44)
!223 = !DILocalVariable(name: "free", scope: !215, file: !1, line: 102, type: !37)
!224 = !DILocalVariable(name: "len", scope: !215, file: !1, line: 103, type: !37)
!225 = !DILocalVariable(name: "newlen", scope: !215, file: !1, line: 103, type: !37)
!226 = !DILocation(line: 0, scope: !215)
!227 = !DILocation(line: 102, column: 19, scope: !215)
!228 = !DILocation(line: 105, column: 14, scope: !229)
!229 = distinct !DILexicalBlock(scope: !215, file: !1, line: 105, column: 9)
!230 = !DILocation(line: 105, column: 9, scope: !215)
!231 = !DILocation(line: 106, column: 11, scope: !215)
!232 = !DILocation(line: 107, column: 20, scope: !215)
!233 = !DILocation(line: 108, column: 18, scope: !215)
!234 = !DILocation(line: 108, column: 26, scope: !215)
!235 = !DILocation(line: 109, column: 54, scope: !215)
!236 = !DILocation(line: 109, column: 13, scope: !215)
!237 = !DILocation(line: 111, column: 15, scope: !238)
!238 = distinct !DILexicalBlock(scope: !215, file: !1, line: 111, column: 9)
!239 = !DILocation(line: 111, column: 9, scope: !215)
!240 = !DILocation(line: 111, column: 24, scope: !238)
!241 = !DILocation(line: 116, column: 26, scope: !215)
!242 = !DILocation(line: 116, column: 12, scope: !215)
!243 = !DILocation(line: 116, column: 17, scope: !215)
!244 = !DILocation(line: 117, column: 19, scope: !215)
!245 = !DILocation(line: 117, column: 5, scope: !215)
!246 = !DILocation(line: 118, column: 1, scope: !215)
!247 = distinct !DISubprogram(name: "sdscat", scope: !1, file: !1, line: 134, type: !248, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{!33, !33, !21}
!250 = !{!251, !252}
!251 = !DILocalVariable(name: "s", arg: 1, scope: !247, file: !1, line: 134, type: !33)
!252 = !DILocalVariable(name: "t", arg: 2, scope: !247, file: !1, line: 134, type: !21)
!253 = !DILocation(line: 0, scope: !247)
!254 = !DILocation(line: 135, column: 28, scope: !247)
!255 = !DILocation(line: 135, column: 12, scope: !247)
!256 = !DILocation(line: 135, column: 5, scope: !247)
!257 = distinct !DISubprogram(name: "sdscpylen", scope: !1, file: !1, line: 138, type: !258, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!33, !33, !21, !37}
!260 = !{!261, !262, !263, !264, !265}
!261 = !DILocalVariable(name: "s", arg: 1, scope: !257, file: !1, line: 138, type: !33)
!262 = !DILocalVariable(name: "t", arg: 2, scope: !257, file: !1, line: 138, type: !21)
!263 = !DILocalVariable(name: "len", arg: 3, scope: !257, file: !1, line: 138, type: !37)
!264 = !DILocalVariable(name: "sh", scope: !257, file: !1, line: 139, type: !44)
!265 = !DILocalVariable(name: "totlen", scope: !257, file: !1, line: 140, type: !37)
!266 = !DILocation(line: 0, scope: !257)
!267 = !DILocation(line: 139, column: 35, scope: !257)
!268 = !DILocation(line: 140, column: 25, scope: !257)
!269 = !DILocation(line: 140, column: 34, scope: !257)
!270 = !DILocation(line: 140, column: 29, scope: !257)
!271 = !DILocation(line: 142, column: 16, scope: !272)
!272 = distinct !DILexicalBlock(scope: !257, file: !1, line: 142, column: 9)
!273 = !DILocation(line: 142, column: 9, scope: !257)
!274 = !DILocation(line: 143, column: 33, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !1, line: 142, column: 23)
!276 = !DILocation(line: 143, column: 13, scope: !275)
!277 = !DILocation(line: 144, column: 15, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !1, line: 144, column: 13)
!279 = !DILocation(line: 144, column: 13, scope: !275)
!280 = !DILocation(line: 145, column: 24, scope: !275)
!281 = !DILocation(line: 146, column: 22, scope: !275)
!282 = !DILocation(line: 146, column: 31, scope: !275)
!283 = !DILocation(line: 146, column: 26, scope: !275)
!284 = !DILocation(line: 147, column: 5, scope: !275)
!285 = !DILocation(line: 150, column: 9, scope: !257)
!286 = !DILocation(line: 148, column: 5, scope: !257)
!287 = !DILocation(line: 149, column: 5, scope: !257)
!288 = !DILocation(line: 149, column: 12, scope: !257)
!289 = !DILocation(line: 150, column: 13, scope: !257)
!290 = !DILocation(line: 151, column: 22, scope: !257)
!291 = !DILocation(line: 151, column: 9, scope: !257)
!292 = !DILocation(line: 151, column: 14, scope: !257)
!293 = !DILocation(line: 152, column: 5, scope: !257)
!294 = !DILocation(line: 153, column: 1, scope: !257)
!295 = distinct !DISubprogram(name: "sdscpy", scope: !1, file: !1, line: 155, type: !248, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !296)
!296 = !{!297, !298}
!297 = !DILocalVariable(name: "s", arg: 1, scope: !295, file: !1, line: 155, type: !33)
!298 = !DILocalVariable(name: "t", arg: 2, scope: !295, file: !1, line: 155, type: !21)
!299 = !DILocation(line: 0, scope: !295)
!300 = !DILocation(line: 156, column: 28, scope: !295)
!301 = !DILocation(line: 156, column: 12, scope: !295)
!302 = !DILocation(line: 156, column: 5, scope: !295)
!303 = distinct !DISubprogram(name: "sdscatprintf", scope: !1, file: !1, line: 159, type: !304, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !306)
!304 = !DISubroutineType(types: !305)
!305 = !{!33, !33, !114, null}
!306 = !{!307, !308, !309, !323, !324, !325}
!307 = !DILocalVariable(name: "s", arg: 1, scope: !303, file: !1, line: 159, type: !33)
!308 = !DILocalVariable(name: "fmt", arg: 2, scope: !303, file: !1, line: 159, type: !114)
!309 = !DILocalVariable(name: "ap", scope: !303, file: !1, line: 160, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !311, line: 14, baseType: !312)
!311 = !DIFile(filename: "VeriFrame/LLVMUtils/llvm/lib/clang/14.0.0/include/stdarg.h", directory: "/home/xuheng", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !313, baseType: !314)
!313 = !DIFile(filename: "sds.c", directory: "/home/xuheng/blackbox/llvm-test/redis")
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 192, elements: !321)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !315, file: !313, line: 160, baseType: !5, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !315, file: !313, line: 160, baseType: !5, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !315, file: !313, line: 160, baseType: !20, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !315, file: !313, line: 160, baseType: !20, size: 64, offset: 128)
!321 = !{!322}
!322 = !DISubrange(count: 1)
!323 = !DILocalVariable(name: "buf", scope: !303, file: !1, line: 161, type: !21)
!324 = !DILocalVariable(name: "t", scope: !303, file: !1, line: 161, type: !21)
!325 = !DILocalVariable(name: "buflen", scope: !303, file: !1, line: 162, type: !37)
!326 = !DILocation(line: 0, scope: !303)
!327 = !DILocation(line: 160, column: 5, scope: !303)
!328 = !DILocation(line: 160, column: 13, scope: !303)
!329 = !DILocation(line: 165, column: 15, scope: !330)
!330 = distinct !DILexicalBlock(scope: !303, file: !1, line: 164, column: 14)
!331 = !DILocation(line: 167, column: 17, scope: !332)
!332 = distinct !DILexicalBlock(scope: !330, file: !1, line: 167, column: 13)
!333 = !DILocation(line: 167, column: 13, scope: !330)
!334 = !DILocation(line: 167, column: 26, scope: !332)
!335 = !DILocation(line: 171, column: 19, scope: !330)
!336 = !DILocation(line: 171, column: 9, scope: !330)
!337 = !DILocation(line: 171, column: 23, scope: !330)
!338 = !DILocation(line: 172, column: 9, scope: !330)
!339 = !DILocation(line: 173, column: 9, scope: !330)
!340 = !DILocation(line: 174, column: 9, scope: !330)
!341 = !DILocation(line: 175, column: 13, scope: !342)
!342 = distinct !DILexicalBlock(scope: !330, file: !1, line: 175, column: 13)
!343 = !DILocation(line: 175, column: 27, scope: !342)
!344 = !DILocation(line: 175, column: 13, scope: !330)
!345 = !DILocation(line: 176, column: 13, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !1, line: 175, column: 36)
!347 = !DILocation(line: 177, column: 20, scope: !346)
!348 = distinct !{!348, !349, !350}
!349 = !DILocation(line: 164, column: 5, scope: !303)
!350 = !DILocation(line: 181, column: 5, scope: !303)
!351 = !DILocation(line: 182, column: 9, scope: !303)
!352 = !DILocation(line: 183, column: 5, scope: !303)
!353 = !DILocation(line: 185, column: 1, scope: !303)
!354 = !DILocation(line: 184, column: 5, scope: !303)
!355 = !DISubprogram(name: "vsnprintf", scope: !356, file: !356, line: 358, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!356 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!357 = !DISubroutineType(types: !358)
!358 = !{!23, !359, !37, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !21)
!360 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !114)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!362 = distinct !DISubprogram(name: "sdstrim", scope: !1, file: !1, line: 187, type: !363, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{!33, !33, !114}
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373}
!366 = !DILocalVariable(name: "s", arg: 1, scope: !362, file: !1, line: 187, type: !33)
!367 = !DILocalVariable(name: "cset", arg: 2, scope: !362, file: !1, line: 187, type: !114)
!368 = !DILocalVariable(name: "sh", scope: !362, file: !1, line: 188, type: !44)
!369 = !DILocalVariable(name: "start", scope: !362, file: !1, line: 189, type: !21)
!370 = !DILocalVariable(name: "end", scope: !362, file: !1, line: 189, type: !21)
!371 = !DILocalVariable(name: "sp", scope: !362, file: !1, line: 189, type: !21)
!372 = !DILocalVariable(name: "ep", scope: !362, file: !1, line: 189, type: !21)
!373 = !DILocalVariable(name: "len", scope: !362, file: !1, line: 190, type: !37)
!374 = !DILocation(line: 0, scope: !362)
!375 = !DILocation(line: 193, column: 18, scope: !362)
!376 = !DILocation(line: 193, column: 17, scope: !362)
!377 = !DILocation(line: 193, column: 27, scope: !362)
!378 = !DILocation(line: 194, column: 14, scope: !362)
!379 = !DILocation(line: 194, column: 21, scope: !362)
!380 = !DILocation(line: 194, column: 37, scope: !362)
!381 = !DILocation(line: 194, column: 24, scope: !362)
!382 = !DILocation(line: 194, column: 5, scope: !362)
!383 = !DILocation(line: 194, column: 45, scope: !362)
!384 = distinct !{!384, !382, !383}
!385 = !DILocation(line: 195, column: 14, scope: !362)
!386 = !DILocation(line: 195, column: 22, scope: !362)
!387 = !DILocation(line: 195, column: 38, scope: !362)
!388 = !DILocation(line: 195, column: 25, scope: !362)
!389 = !DILocation(line: 195, column: 5, scope: !362)
!390 = !DILocation(line: 195, column: 46, scope: !362)
!391 = distinct !{!391, !389, !390}
!392 = !DILocation(line: 196, column: 15, scope: !362)
!393 = !DILocation(line: 196, column: 11, scope: !362)
!394 = !DILocation(line: 197, column: 17, scope: !395)
!395 = distinct !DILexicalBlock(scope: !362, file: !1, line: 197, column: 9)
!396 = !DILocation(line: 197, column: 9, scope: !362)
!397 = !DILocation(line: 197, column: 24, scope: !395)
!398 = !DILocation(line: 188, column: 35, scope: !362)
!399 = !DILocation(line: 198, column: 5, scope: !362)
!400 = !DILocation(line: 198, column: 18, scope: !362)
!401 = !DILocation(line: 199, column: 20, scope: !362)
!402 = !DILocation(line: 199, column: 30, scope: !362)
!403 = !DILocation(line: 199, column: 33, scope: !362)
!404 = !DILocation(line: 199, column: 24, scope: !362)
!405 = !DILocation(line: 199, column: 14, scope: !362)
!406 = !DILocation(line: 200, column: 13, scope: !362)
!407 = !DILocation(line: 201, column: 5, scope: !362)
!408 = !DISubprogram(name: "strchr", scope: !98, file: !98, line: 226, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!409 = !DISubroutineType(types: !410)
!410 = !{!21, !114, !23}
!411 = !DISubprogram(name: "memmove", scope: !98, file: !98, line: 47, type: !412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!412 = !DISubroutineType(types: !413)
!413 = !{!20, !20, !35, !37}
!414 = distinct !DISubprogram(name: "sdsrange", scope: !1, file: !1, line: 204, type: !415, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!33, !33, !48, !48}
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DILocalVariable(name: "s", arg: 1, scope: !414, file: !1, line: 204, type: !33)
!419 = !DILocalVariable(name: "start", arg: 2, scope: !414, file: !1, line: 204, type: !48)
!420 = !DILocalVariable(name: "end", arg: 3, scope: !414, file: !1, line: 204, type: !48)
!421 = !DILocalVariable(name: "sh", scope: !414, file: !1, line: 205, type: !44)
!422 = !DILocalVariable(name: "newlen", scope: !414, file: !1, line: 206, type: !37)
!423 = !DILocalVariable(name: "len", scope: !414, file: !1, line: 206, type: !37)
!424 = !DILocation(line: 0, scope: !414)
!425 = !DILocation(line: 205, column: 35, scope: !414)
!426 = !DILocation(line: 206, column: 26, scope: !414)
!427 = !DILocation(line: 208, column: 13, scope: !428)
!428 = distinct !DILexicalBlock(scope: !414, file: !1, line: 208, column: 9)
!429 = !DILocation(line: 208, column: 9, scope: !414)
!430 = !DILocation(line: 209, column: 15, scope: !431)
!431 = distinct !DILexicalBlock(scope: !414, file: !1, line: 209, column: 9)
!432 = !DILocation(line: 209, column: 9, scope: !414)
!433 = !DILocation(line: 213, column: 13, scope: !434)
!434 = distinct !DILexicalBlock(scope: !414, file: !1, line: 213, column: 9)
!435 = !DILocation(line: 213, column: 9, scope: !414)
!436 = !DILocation(line: 217, column: 21, scope: !414)
!437 = !DILocation(line: 217, column: 14, scope: !414)
!438 = !DILocation(line: 218, column: 16, scope: !439)
!439 = distinct !DILexicalBlock(scope: !414, file: !1, line: 218, column: 9)
!440 = !DILocation(line: 218, column: 9, scope: !414)
!441 = !DILocation(line: 219, column: 22, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 219, column: 13)
!443 = distinct !DILexicalBlock(scope: !439, file: !1, line: 218, column: 22)
!444 = !DILocation(line: 219, column: 19, scope: !442)
!445 = !DILocation(line: 219, column: 13, scope: !443)
!446 = !DILocation(line: 220, column: 17, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !1, line: 220, column: 13)
!448 = !DILocation(line: 220, column: 13, scope: !443)
!449 = !DILocation(line: 221, column: 25, scope: !443)
!450 = !DILocation(line: 221, column: 18, scope: !443)
!451 = !DILocation(line: 225, column: 15, scope: !452)
!452 = distinct !DILexicalBlock(scope: !414, file: !1, line: 225, column: 9)
!453 = !DILocation(line: 225, column: 9, scope: !414)
!454 = !DILocation(line: 225, column: 45, scope: !452)
!455 = !DILocation(line: 225, column: 21, scope: !452)
!456 = !DILocation(line: 226, column: 5, scope: !414)
!457 = !DILocation(line: 226, column: 21, scope: !414)
!458 = !DILocation(line: 227, column: 20, scope: !414)
!459 = !DILocation(line: 227, column: 30, scope: !414)
!460 = !DILocation(line: 227, column: 33, scope: !414)
!461 = !DILocation(line: 227, column: 24, scope: !414)
!462 = !DILocation(line: 227, column: 14, scope: !414)
!463 = !DILocation(line: 228, column: 13, scope: !414)
!464 = !DILocation(line: 229, column: 5, scope: !414)
!465 = !DILocation(line: 230, column: 1, scope: !414)
!466 = distinct !DISubprogram(name: "sdstolower", scope: !1, file: !1, line: 232, type: !149, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DILocalVariable(name: "s", arg: 1, scope: !466, file: !1, line: 232, type: !33)
!469 = !DILocalVariable(name: "len", scope: !466, file: !1, line: 233, type: !23)
!470 = !DILocalVariable(name: "j", scope: !466, file: !1, line: 233, type: !23)
!471 = !DILocalVariable(name: "__res", scope: !472, file: !1, line: 235, type: !23)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 235, column: 38)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 235, column: 5)
!474 = distinct !DILexicalBlock(scope: !466, file: !1, line: 235, column: 5)
!475 = !DILocation(line: 0, scope: !466)
!476 = !DILocation(line: 233, column: 15, scope: !466)
!477 = !DILocation(line: 235, column: 19, scope: !473)
!478 = !DILocation(line: 235, column: 5, scope: !474)
!479 = !DILocation(line: 235, column: 38, scope: !480)
!480 = distinct !DILexicalBlock(scope: !472, file: !1, line: 235, column: 38)
!481 = !{!482, !482, i64 0}
!482 = !{!"int", !65, i64 0}
!483 = !DILocation(line: 0, scope: !472)
!484 = !DILocation(line: 235, column: 38, scope: !473)
!485 = !DILocation(line: 235, column: 36, scope: !473)
!486 = !DILocation(line: 235, column: 27, scope: !473)
!487 = distinct !{!487, !478, !488}
!488 = !DILocation(line: 235, column: 38, scope: !474)
!489 = distinct !{!489, !490}
!490 = !{!"llvm.loop.unroll.disable"}
!491 = !DILocation(line: 236, column: 1, scope: !466)
!492 = distinct !DISubprogram(name: "sdstoupper", scope: !1, file: !1, line: 238, type: !149, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DILocalVariable(name: "s", arg: 1, scope: !492, file: !1, line: 238, type: !33)
!495 = !DILocalVariable(name: "len", scope: !492, file: !1, line: 239, type: !23)
!496 = !DILocalVariable(name: "j", scope: !492, file: !1, line: 239, type: !23)
!497 = !DILocalVariable(name: "__res", scope: !498, file: !1, line: 241, type: !23)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 241, column: 38)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 241, column: 5)
!500 = distinct !DILexicalBlock(scope: !492, file: !1, line: 241, column: 5)
!501 = !DILocation(line: 0, scope: !492)
!502 = !DILocation(line: 239, column: 15, scope: !492)
!503 = !DILocation(line: 241, column: 19, scope: !499)
!504 = !DILocation(line: 241, column: 5, scope: !500)
!505 = !DILocation(line: 241, column: 38, scope: !506)
!506 = distinct !DILexicalBlock(scope: !498, file: !1, line: 241, column: 38)
!507 = !DILocation(line: 0, scope: !498)
!508 = !DILocation(line: 241, column: 38, scope: !499)
!509 = !DILocation(line: 241, column: 36, scope: !499)
!510 = !DILocation(line: 241, column: 27, scope: !499)
!511 = distinct !{!511, !504, !512}
!512 = !DILocation(line: 241, column: 38, scope: !500)
!513 = distinct !{!513, !490}
!514 = !DILocation(line: 242, column: 1, scope: !492)
!515 = distinct !DISubprogram(name: "sdscmp", scope: !1, file: !1, line: 244, type: !516, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!23, !33, !33}
!518 = !{!519, !520, !521, !522, !523, !524}
!519 = !DILocalVariable(name: "s1", arg: 1, scope: !515, file: !1, line: 244, type: !33)
!520 = !DILocalVariable(name: "s2", arg: 2, scope: !515, file: !1, line: 244, type: !33)
!521 = !DILocalVariable(name: "l1", scope: !515, file: !1, line: 245, type: !37)
!522 = !DILocalVariable(name: "l2", scope: !515, file: !1, line: 245, type: !37)
!523 = !DILocalVariable(name: "minlen", scope: !515, file: !1, line: 245, type: !37)
!524 = !DILocalVariable(name: "cmp", scope: !515, file: !1, line: 246, type: !23)
!525 = !DILocation(line: 0, scope: !515)
!526 = !DILocation(line: 248, column: 10, scope: !515)
!527 = !DILocation(line: 249, column: 10, scope: !515)
!528 = !DILocation(line: 250, column: 18, scope: !515)
!529 = !DILocation(line: 250, column: 14, scope: !515)
!530 = !DILocation(line: 251, column: 11, scope: !515)
!531 = !DILocation(line: 252, column: 13, scope: !532)
!532 = distinct !DILexicalBlock(scope: !515, file: !1, line: 252, column: 9)
!533 = !DILocation(line: 252, column: 9, scope: !515)
!534 = !DILocation(line: 254, column: 1, scope: !515)
!535 = !DISubprogram(name: "memcmp", scope: !98, file: !98, line: 64, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!536 = !DISubroutineType(types: !537)
!537 = !{!23, !35, !35, !37}
!538 = distinct !DISubprogram(name: "sdssplitlen", scope: !1, file: !1, line: 272, type: !539, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !543)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !21, !23, !21, !23, !542}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!544 = !DILocalVariable(name: "s", arg: 1, scope: !538, file: !1, line: 272, type: !21)
!545 = !DILocalVariable(name: "len", arg: 2, scope: !538, file: !1, line: 272, type: !23)
!546 = !DILocalVariable(name: "sep", arg: 3, scope: !538, file: !1, line: 272, type: !21)
!547 = !DILocalVariable(name: "seplen", arg: 4, scope: !538, file: !1, line: 272, type: !23)
!548 = !DILocalVariable(name: "count", arg: 5, scope: !538, file: !1, line: 272, type: !542)
!549 = !DILocalVariable(name: "elements", scope: !538, file: !1, line: 273, type: !23)
!550 = !DILocalVariable(name: "slots", scope: !538, file: !1, line: 273, type: !23)
!551 = !DILocalVariable(name: "start", scope: !538, file: !1, line: 273, type: !23)
!552 = !DILocalVariable(name: "j", scope: !538, file: !1, line: 273, type: !23)
!553 = !DILocalVariable(name: "tokens", scope: !538, file: !1, line: 275, type: !541)
!554 = !DILocalVariable(name: "newtokens", scope: !555, file: !1, line: 287, type: !541)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 286, column: 33)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 286, column: 13)
!557 = distinct !DILexicalBlock(scope: !558, file: !1, line: 284, column: 44)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 284, column: 5)
!559 = distinct !DILexicalBlock(scope: !538, file: !1, line: 284, column: 5)
!560 = !DILocation(line: 0, scope: !538)
!561 = !DILocation(line: 275, column: 19, scope: !538)
!562 = !DILocation(line: 277, column: 16, scope: !563)
!563 = distinct !DILexicalBlock(scope: !538, file: !1, line: 277, column: 9)
!564 = !DILocation(line: 277, column: 9, scope: !538)
!565 = !DILocation(line: 277, column: 25, scope: !563)
!566 = !DILocation(line: 279, column: 20, scope: !567)
!567 = distinct !DILexicalBlock(scope: !538, file: !1, line: 279, column: 9)
!568 = !DILocation(line: 279, column: 16, scope: !567)
!569 = !DILocation(line: 280, column: 13, scope: !570)
!570 = distinct !DILexicalBlock(scope: !538, file: !1, line: 280, column: 9)
!571 = !DILocation(line: 280, column: 9, scope: !538)
!572 = !DILocation(line: 284, column: 19, scope: !558)
!573 = !DILocation(line: 284, column: 5, scope: !559)
!574 = !DILocation(line: 286, column: 29, scope: !556)
!575 = !DILocation(line: 286, column: 19, scope: !556)
!576 = !DILocation(line: 286, column: 13, scope: !557)
!577 = !DILocation(line: 289, column: 19, scope: !555)
!578 = !DILocation(line: 290, column: 34, scope: !555)
!579 = !DILocation(line: 290, column: 53, scope: !555)
!580 = !DILocation(line: 290, column: 52, scope: !555)
!581 = !DILocation(line: 290, column: 25, scope: !555)
!582 = !DILocation(line: 0, scope: !555)
!583 = !DILocation(line: 291, column: 27, scope: !584)
!584 = distinct !DILexicalBlock(scope: !555, file: !1, line: 291, column: 17)
!585 = !DILocation(line: 291, column: 17, scope: !555)
!586 = !DILocation(line: 293, column: 17, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !1, line: 291, column: 36)
!588 = !DILocation(line: 297, column: 13, scope: !587)
!589 = !DILocation(line: 0, scope: !590)
!590 = distinct !DILexicalBlock(scope: !557, file: !1, line: 301, column: 13)
!591 = !DILocation(line: 301, column: 26, scope: !590)
!592 = !DILocation(line: 301, column: 32, scope: !590)
!593 = !DILocation(line: 301, column: 29, scope: !590)
!594 = !DILocation(line: 301, column: 39, scope: !590)
!595 = !DILocation(line: 301, column: 36, scope: !590)
!596 = !DILocation(line: 301, column: 47, scope: !590)
!597 = !DILocation(line: 301, column: 59, scope: !590)
!598 = !DILocation(line: 301, column: 51, scope: !590)
!599 = !DILocation(line: 301, column: 74, scope: !590)
!600 = !DILocation(line: 301, column: 13, scope: !557)
!601 = !DILocation(line: 302, column: 43, scope: !602)
!602 = distinct !DILexicalBlock(scope: !590, file: !1, line: 301, column: 81)
!603 = !DILocation(line: 302, column: 51, scope: !602)
!604 = !DILocation(line: 302, column: 50, scope: !602)
!605 = !DILocation(line: 302, column: 32, scope: !602)
!606 = !DILocation(line: 302, column: 13, scope: !602)
!607 = !DILocation(line: 302, column: 30, scope: !602)
!608 = !DILocation(line: 310, column: 21, scope: !602)
!609 = !DILocation(line: 311, column: 22, scope: !602)
!610 = !DILocation(line: 312, column: 25, scope: !602)
!611 = !DILocation(line: 313, column: 9, scope: !602)
!612 = !DILocation(line: 0, scope: !559)
!613 = !DILocation(line: 284, column: 40, scope: !558)
!614 = distinct !{!614, !573, !615}
!615 = !DILocation(line: 314, column: 5, scope: !559)
!616 = !DILocation(line: 316, column: 35, scope: !538)
!617 = !DILocation(line: 316, column: 45, scope: !538)
!618 = !DILocation(line: 316, column: 42, scope: !538)
!619 = !DILocation(line: 316, column: 24, scope: !538)
!620 = !DILocation(line: 316, column: 5, scope: !538)
!621 = !DILocation(line: 316, column: 22, scope: !538)
!622 = !DILocation(line: 324, column: 13, scope: !538)
!623 = !DILocation(line: 326, column: 5, scope: !538)
!624 = !DILocation(line: 337, column: 1, scope: !538)
!625 = !DISubprogram(name: "zrealloc", scope: !85, file: !85, line: 35, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!626 = !DISubroutineType(types: !627)
!627 = !{!20, !20, !37}
!628 = distinct !DISubprogram(name: "sdsfreesplitres", scope: !1, file: !1, line: 339, type: !629, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !541, !23}
!631 = !{!632, !633}
!632 = !DILocalVariable(name: "tokens", arg: 1, scope: !628, file: !1, line: 339, type: !541)
!633 = !DILocalVariable(name: "count", arg: 2, scope: !628, file: !1, line: 339, type: !23)
!634 = !DILocation(line: 0, scope: !628)
!635 = !DILocation(line: 340, column: 10, scope: !636)
!636 = distinct !DILexicalBlock(scope: !628, file: !1, line: 340, column: 9)
!637 = !DILocation(line: 340, column: 9, scope: !628)
!638 = !DILocation(line: 341, column: 5, scope: !628)
!639 = !DILocation(line: 341, column: 16, scope: !628)
!640 = !DILocation(line: 342, column: 17, scope: !628)
!641 = !DILocation(line: 342, column: 9, scope: !628)
!642 = distinct !{!642, !638, !643}
!643 = !DILocation(line: 342, column: 30, scope: !628)
!644 = !DILocation(line: 343, column: 11, scope: !628)
!645 = !DILocation(line: 343, column: 5, scope: !628)
!646 = !DILocation(line: 344, column: 1, scope: !628)
!647 = distinct !DISubprogram(name: "sdsfromlonglong", scope: !1, file: !1, line: 346, type: !648, scopeLine: 346, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !651)
!648 = !DISubroutineType(types: !649)
!649 = !{!33, !650}
!650 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!651 = !{!652, !653, !657, !658}
!652 = !DILocalVariable(name: "value", arg: 1, scope: !647, file: !1, line: 346, type: !650)
!653 = !DILocalVariable(name: "buf", scope: !647, file: !1, line: 347, type: !654)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 32)
!657 = !DILocalVariable(name: "p", scope: !647, file: !1, line: 347, type: !21)
!658 = !DILocalVariable(name: "v", scope: !647, file: !1, line: 348, type: !659)
!659 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!660 = !DILocation(line: 0, scope: !647)
!661 = !DILocation(line: 347, column: 5, scope: !647)
!662 = !DILocation(line: 347, column: 10, scope: !647)
!663 = !DILocation(line: 350, column: 16, scope: !647)
!664 = !DILocation(line: 350, column: 9, scope: !647)
!665 = !DILocation(line: 351, column: 12, scope: !647)
!666 = !DILocation(line: 352, column: 5, scope: !647)
!667 = !DILocation(line: 353, column: 22, scope: !668)
!668 = distinct !DILexicalBlock(scope: !647, file: !1, line: 352, column: 8)
!669 = !DILocation(line: 353, column: 16, scope: !668)
!670 = !DILocation(line: 353, column: 11, scope: !668)
!671 = !DILocation(line: 353, column: 14, scope: !668)
!672 = !DILocation(line: 354, column: 11, scope: !668)
!673 = !DILocation(line: 355, column: 5, scope: !668)
!674 = distinct !{!674, !666, !675}
!675 = !DILocation(line: 355, column: 14, scope: !647)
!676 = !DILocation(line: 356, column: 9, scope: !647)
!677 = !DILocation(line: 356, column: 25, scope: !678)
!678 = distinct !DILexicalBlock(scope: !647, file: !1, line: 356, column: 9)
!679 = !DILocation(line: 356, column: 20, scope: !678)
!680 = !DILocation(line: 356, column: 22, scope: !678)
!681 = !DILocation(line: 357, column: 6, scope: !647)
!682 = !DILocation(line: 358, column: 29, scope: !647)
!683 = !DILocation(line: 358, column: 26, scope: !647)
!684 = !DILocation(line: 358, column: 12, scope: !647)
!685 = !DILocation(line: 359, column: 1, scope: !647)
!686 = !DILocation(line: 358, column: 5, scope: !647)
!687 = distinct !DISubprogram(name: "sdssplitargs", scope: !1, file: !1, line: 373, type: !688, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!541, !21, !542}
!690 = !{!691, !692, !693, !694, !695, !697, !701, !702, !708}
!691 = !DILocalVariable(name: "line", arg: 1, scope: !687, file: !1, line: 373, type: !21)
!692 = !DILocalVariable(name: "argc", arg: 2, scope: !687, file: !1, line: 373, type: !542)
!693 = !DILocalVariable(name: "p", scope: !687, file: !1, line: 374, type: !21)
!694 = !DILocalVariable(name: "current", scope: !687, file: !1, line: 375, type: !21)
!695 = !DILocalVariable(name: "vector", scope: !687, file: !1, line: 376, type: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!697 = !DILocalVariable(name: "inq", scope: !698, file: !1, line: 384, type: !23)
!698 = distinct !DILexicalBlock(scope: !699, file: !1, line: 382, column: 17)
!699 = distinct !DILexicalBlock(scope: !700, file: !1, line: 382, column: 13)
!700 = distinct !DILexicalBlock(scope: !687, file: !1, line: 379, column: 14)
!701 = !DILocalVariable(name: "done", scope: !698, file: !1, line: 385, type: !23)
!702 = !DILocalVariable(name: "c", scope: !703, file: !1, line: 391, type: !22)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 390, column: 47)
!704 = distinct !DILexicalBlock(scope: !705, file: !1, line: 390, column: 25)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 389, column: 26)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 389, column: 21)
!707 = distinct !DILexicalBlock(scope: !698, file: !1, line: 388, column: 26)
!708 = !DILabel(scope: !687, name: "err", file: !1, line: 442)
!709 = !DILocation(line: 0, scope: !687)
!710 = !DILocation(line: 381, column: 15, scope: !700)
!711 = !DILocation(line: 381, column: 18, scope: !700)
!712 = !DILocation(line: 381, column: 21, scope: !700)
!713 = !{!714, !714, i64 0}
!714 = !{!"short", !65, i64 0}
!715 = !DILocation(line: 381, column: 9, scope: !700)
!716 = !DILocation(line: 381, column: 35, scope: !700)
!717 = distinct !{!717, !715, !716}
!718 = !DILocation(line: 0, scope: !698)
!719 = !DILocation(line: 387, column: 44, scope: !720)
!720 = distinct !DILexicalBlock(scope: !698, file: !1, line: 387, column: 17)
!721 = !DILocation(line: 388, column: 13, scope: !698)
!722 = !DILocation(line: 389, column: 21, scope: !706)
!723 = !DILocation(line: 0, scope: !706)
!724 = !DILocation(line: 389, column: 21, scope: !707)
!725 = !DILocation(line: 390, column: 36, scope: !704)
!726 = !DILocation(line: 390, column: 42, scope: !704)
!727 = !DILocation(line: 390, column: 39, scope: !704)
!728 = !DILocation(line: 390, column: 25, scope: !705)
!729 = !DILocation(line: 391, column: 25, scope: !703)
!730 = !DILocation(line: 394, column: 32, scope: !703)
!731 = !DILocation(line: 394, column: 25, scope: !703)
!732 = !DILocation(line: 0, scope: !703)
!733 = !DILocation(line: 395, column: 37, scope: !734)
!734 = distinct !DILexicalBlock(scope: !703, file: !1, line: 394, column: 36)
!735 = !DILocation(line: 395, column: 45, scope: !734)
!736 = !DILocation(line: 396, column: 37, scope: !734)
!737 = !DILocation(line: 396, column: 45, scope: !734)
!738 = !DILocation(line: 397, column: 37, scope: !734)
!739 = !DILocation(line: 397, column: 45, scope: !734)
!740 = !DILocation(line: 398, column: 37, scope: !734)
!741 = !DILocation(line: 398, column: 45, scope: !734)
!742 = !DILocation(line: 399, column: 37, scope: !734)
!743 = !DILocation(line: 399, column: 45, scope: !734)
!744 = !DILocation(line: 400, column: 36, scope: !734)
!745 = !DILocation(line: 400, column: 42, scope: !734)
!746 = !DILocation(line: 402, column: 35, scope: !703)
!747 = !DILocation(line: 403, column: 21, scope: !704)
!748 = !DILocation(line: 403, column: 21, scope: !703)
!749 = !DILocation(line: 405, column: 32, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 405, column: 29)
!751 = distinct !DILexicalBlock(scope: !752, file: !1, line: 403, column: 43)
!752 = distinct !DILexicalBlock(scope: !704, file: !1, line: 403, column: 32)
!753 = !DILocation(line: 405, column: 29, scope: !750)
!754 = !DILocation(line: 405, column: 36, scope: !750)
!755 = !DILocation(line: 405, column: 40, scope: !750)
!756 = !DILocation(line: 405, column: 29, scope: !751)
!757 = !DILocation(line: 411, column: 35, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 410, column: 28)
!759 = distinct !DILexicalBlock(scope: !752, file: !1, line: 407, column: 32)
!760 = !DILocation(line: 414, column: 28, scope: !761)
!761 = distinct !DILexicalBlock(scope: !706, file: !1, line: 413, column: 24)
!762 = !DILocation(line: 414, column: 21, scope: !761)
!763 = !DILocation(line: 426, column: 35, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !1, line: 414, column: 32)
!765 = !DILocation(line: 427, column: 25, scope: !764)
!766 = !DILocation(line: 430, column: 21, scope: !767)
!767 = distinct !DILexicalBlock(scope: !707, file: !1, line: 430, column: 21)
!768 = !DILocation(line: 430, column: 21, scope: !707)
!769 = distinct !{!769, !721, !770}
!770 = !DILocation(line: 431, column: 13, scope: !698)
!771 = !DILocation(line: 433, column: 31, scope: !698)
!772 = !DILocation(line: 433, column: 40, scope: !698)
!773 = !DILocation(line: 433, column: 46, scope: !698)
!774 = !DILocation(line: 433, column: 38, scope: !698)
!775 = !DILocation(line: 433, column: 49, scope: !698)
!776 = !DILocation(line: 433, column: 22, scope: !698)
!777 = !DILocation(line: 434, column: 20, scope: !698)
!778 = !DILocation(line: 434, column: 13, scope: !698)
!779 = !DILocation(line: 434, column: 27, scope: !698)
!780 = !DILocation(line: 435, column: 20, scope: !698)
!781 = !DILocation(line: 443, column: 18, scope: !687)
!782 = !DILocation(line: 443, column: 5, scope: !687)
!783 = !DILocation(line: 444, column: 17, scope: !687)
!784 = !DILocation(line: 444, column: 9, scope: !687)
!785 = distinct !{!785, !782, !786}
!786 = !DILocation(line: 444, column: 30, scope: !687)
!787 = !DILocation(line: 445, column: 11, scope: !687)
!788 = !DILocation(line: 445, column: 5, scope: !687)
!789 = !DILocation(line: 446, column: 9, scope: !790)
!790 = distinct !DILexicalBlock(scope: !687, file: !1, line: 446, column: 9)
!791 = !DILocation(line: 446, column: 9, scope: !687)
!792 = !DILocation(line: 446, column: 18, scope: !790)
!793 = !DILocation(line: 448, column: 1, scope: !687)
!794 = !DISubprogram(name: "fprintf", scope: !356, file: !356, line: 326, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !88)
!795 = !DISubroutineType(types: !796)
!796 = !{!23, !797, !360, null}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !800, line: 7, baseType: !801)
!800 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !802, line: 49, size: 1728, elements: !803)
!802 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !819, !821, !822, !823, !826, !827, !829, !831, !834, !836, !839, !842, !843, !844, !845, !846}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !801, file: !802, line: 51, baseType: !23, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !801, file: !802, line: 54, baseType: !21, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !801, file: !802, line: 55, baseType: !21, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !801, file: !802, line: 56, baseType: !21, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !801, file: !802, line: 57, baseType: !21, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !801, file: !802, line: 58, baseType: !21, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !801, file: !802, line: 59, baseType: !21, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !801, file: !802, line: 60, baseType: !21, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !801, file: !802, line: 61, baseType: !21, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !801, file: !802, line: 64, baseType: !21, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !801, file: !802, line: 65, baseType: !21, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !801, file: !802, line: 66, baseType: !21, size: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !801, file: !802, line: 68, baseType: !817, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !802, line: 36, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !801, file: !802, line: 70, baseType: !820, size: 64, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !801, file: !802, line: 72, baseType: !23, size: 32, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !801, file: !802, line: 73, baseType: !23, size: 32, offset: 928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !801, file: !802, line: 74, baseType: !824, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !825, line: 152, baseType: !48)
!825 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !801, file: !802, line: 77, baseType: !24, size: 16, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !801, file: !802, line: 78, baseType: !828, size: 8, offset: 1040)
!828 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !801, file: !802, line: 79, baseType: !830, size: 8, offset: 1048)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !321)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !801, file: !802, line: 81, baseType: !832, size: 64, offset: 1088)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !802, line: 43, baseType: null)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !801, file: !802, line: 89, baseType: !835, size: 64, offset: 1152)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !825, line: 153, baseType: !48)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !801, file: !802, line: 91, baseType: !837, size: 64, offset: 1216)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !802, line: 37, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !801, file: !802, line: 92, baseType: !840, size: 64, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !802, line: 38, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !801, file: !802, line: 93, baseType: !820, size: 64, offset: 1344)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !801, file: !802, line: 94, baseType: !20, size: 64, offset: 1408)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !801, file: !802, line: 95, baseType: !37, size: 64, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !801, file: !802, line: 96, baseType: !23, size: 32, offset: 1536)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !801, file: !802, line: 98, baseType: !847, size: 160, offset: 1568)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 20)
!850 = !DISubprogram(name: "abort", scope: !851, file: !851, line: 591, type: !90, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !88)
!851 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "f0db66726d35051e5af2525f5b33bd81")
