; ModuleID = 'zipmap.c'
source_filename = "zipmap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [12 x i8] c"{status %u}\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"{end}\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"{key %u}\00", align 1
@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [11 x i8] c"{value %u}\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"[\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c".\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"]\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i8* @zipmapNew() local_unnamed_addr #0 !dbg !10 {
entry:
  %call = tail call i8* @zmalloc(i64 noundef 2) #7, !dbg !17
  call void @llvm.dbg.value(metadata i8* %call, metadata !16, metadata !DIExpression()), !dbg !18

!457 = !DILocation(line: 355, column: 28, scope: !449)
!458 = !DILocation(line: 0, scope: !449)
!459 = !DILocation(line: 356, column: 9, scope: !449)
!460 = !DILocation(line: 356, column: 20, scope: !449)
!461 = !DILocation(line: 356, column: 55, scope: !449)
!462 = !DILocation(line: 356, column: 67, scope: !449)
!463 = distinct !{!463, !459, !462}
!464 = !DILocation(line: 359, column: 17, scope: !465)
!465 = distinct !DILexicalBlock(scope: !449, file: !1, line: 359, column: 13)
!466 = !DILocation(line: 359, column: 13, scope: !449)
!467 = !DILocation(line: 359, column: 42, scope: !465)
!468 = !DILocation(line: 359, column: 40, scope: !465)
!469 = !DILocation(line: 359, column: 34, scope: !465)
!470 = !DILocation(line: 361, column: 5, scope: !444)
!471 = distinct !DISubprogram(name: "zipmapRepr", scope: !1, file: !1, line: 364, type: !472, scopeLine: 364, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !13}
!474 = !{!475, !476, !477}
!475 = !DILocalVariable(name: "p", arg: 1, scope: !471, file: !1, line: 364, type: !13)
!476 = !DILocalVariable(name: "l", scope: !471, file: !1, line: 365, type: !4)
!477 = !DILocalVariable(name: "e", scope: !478, file: !1, line: 373, type: !14)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 372, column: 16)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 369, column: 13)
!480 = distinct !DILexicalBlock(scope: !471, file: !1, line: 368, column: 14)
!481 = !DILocation(line: 0, scope: !471)
!482 = !DILocation(line: 367, column: 28, scope: !471)
!483 = !DILocation(line: 367, column: 26, scope: !471)
!484 = !DILocation(line: 367, column: 5, scope: !471)
!485 = !DILocation(line: 369, column: 13, scope: !479)
!486 = !DILocation(line: 369, column: 18, scope: !479)
!487 = !DILocation(line: 369, column: 13, scope: !480)
!488 = !DILocation(line: 370, column: 13, scope: !489)
!489 = distinct !DILexicalBlock(scope: !479, file: !1, line: 369, column: 33)
!490 = !DILocation(line: 394, column: 5, scope: !471)
!491 = !DILocation(line: 395, column: 1, scope: !471)
!492 = !DILocation(line: 375, column: 17, scope: !478)
!493 = !DILocation(line: 376, column: 13, scope: !478)
!494 = !DILocation(line: 377, column: 18, scope: !478)
!495 = !DILocation(line: 377, column: 15, scope: !478)
!496 = !DILocation(line: 378, column: 22, scope: !478)
!497 = !DILocation(line: 378, column: 26, scope: !478)
!498 = !DILocation(line: 378, column: 13, scope: !478)
!499 = !DILocation(line: 379, column: 15, scope: !478)
!500 = !DILocation(line: 381, column: 17, scope: !478)
!501 = !DILocation(line: 382, column: 13, scope: !478)
!502 = !DILocation(line: 383, column: 18, scope: !478)
!503 = !DILocation(line: 383, column: 15, scope: !478)
!504 = !DILocation(line: 384, column: 19, scope: !478)
!505 = !DILocation(line: 384, column: 17, scope: !478)
!506 = !DILocation(line: 0, scope: !478)
!507 = !DILocation(line: 385, column: 22, scope: !478)
!508 = !DILocation(line: 385, column: 26, scope: !478)
!509 = !DILocation(line: 385, column: 13, scope: !478)
!510 = !DILocation(line: 386, column: 20, scope: !478)
!511 = !DILocation(line: 386, column: 19, scope: !478)
!512 = !DILocation(line: 386, column: 15, scope: !478)
!513 = !DILocation(line: 387, column: 17, scope: !514)
!514 = distinct !DILexicalBlock(scope: !478, file: !1, line: 387, column: 17)
!515 = !DILocation(line: 387, column: 17, scope: !478)
!516 = !DILocation(line: 388, column: 17, scope: !517)
!517 = distinct !DILexicalBlock(scope: !514, file: !1, line: 387, column: 20)
!518 = !DILocation(line: 389, column: 17, scope: !517)
!519 = !DILocation(line: 389, column: 24, scope: !517)
!520 = !DILocation(line: 389, column: 28, scope: !517)
!521 = distinct !{!521, !518, !522}
!522 = !DILocation(line: 389, column: 38, scope: !517)
!523 = !DILocation(line: 390, column: 17, scope: !517)
!524 = !DILocation(line: 391, column: 13, scope: !517)
!525 = distinct !{!525, !526, !527}
!526 = !DILocation(line: 368, column: 5, scope: !471)
!527 = !DILocation(line: 393, column: 5, scope: !471)
!528 = !DISubprogram(name: "printf", scope: !529, file: !529, line: 332, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !33)
!529 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!530 = !DISubroutineType(types: !531)
!531 = !{!38, !532, null}
!532 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!536 = !DISubprogram(name: "fwrite", scope: !529, file: !529, line: 652, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !33)
!537 = !DISubroutineType(types: !538)
!538 = !{!30, !272, !30, !30, !539}
!539 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !542, line: 7, baseType: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !544, line: 49, size: 1728, elements: !545)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!545 = !{!546, !547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !562, !564, !565, !566, !570, !572, !574, !578, !581, !583, !586, !589, !590, !591, !592, !593}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !543, file: !544, line: 51, baseType: !38, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !543, file: !544, line: 54, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !543, file: !544, line: 55, baseType: !548, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !543, file: !544, line: 56, baseType: !548, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !543, file: !544, line: 57, baseType: !548, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !543, file: !544, line: 58, baseType: !548, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !543, file: !544, line: 59, baseType: !548, size: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !543, file: !544, line: 60, baseType: !548, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !543, file: !544, line: 61, baseType: !548, size: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !543, file: !544, line: 64, baseType: !548, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !543, file: !544, line: 65, baseType: !548, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !543, file: !544, line: 66, baseType: !548, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !543, file: !544, line: 68, baseType: !560, size: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !544, line: 36, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !543, file: !544, line: 70, baseType: !563, size: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !543, file: !544, line: 72, baseType: !38, size: 32, offset: 896)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !543, file: !544, line: 73, baseType: !38, size: 32, offset: 928)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !543, file: !544, line: 74, baseType: !567, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !568, line: 152, baseType: !569)
!568 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!569 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !543, file: !544, line: 77, baseType: !571, size: 16, offset: 1024)
!571 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !543, file: !544, line: 78, baseType: !573, size: 8, offset: 1040)
!573 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !543, file: !544, line: 79, baseType: !575, size: 8, offset: 1048)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 8, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !543, file: !544, line: 81, baseType: !579, size: 64, offset: 1088)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !544, line: 43, baseType: null)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !543, file: !544, line: 89, baseType: !582, size: 64, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !568, line: 153, baseType: !569)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !543, file: !544, line: 91, baseType: !584, size: 64, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !544, line: 37, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !543, file: !544, line: 92, baseType: !587, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !544, line: 38, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !543, file: !544, line: 93, baseType: !563, size: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !543, file: !544, line: 94, baseType: !3, size: 64, offset: 1408)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !543, file: !544, line: 95, baseType: !30, size: 64, offset: 1472)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !543, file: !544, line: 96, baseType: !38, size: 32, offset: 1536)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !543, file: !544, line: 98, baseType: !594, size: 160, offset: 1568)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 160, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 20)
!597 = !DISubprogram(name: "memcmp", scope: !235, file: !235, line: 64, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !33)
!598 = !DISubroutineType(types: !599)
!599 = !{!38, !238, !238, !30}
!600 = !DISubprogram(name: "zrealloc", scope: !27, file: !27, line: 35, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !33)
!601 = !DISubroutineType(types: !602)
!602 = !{!3, !3, !30}
